	var __wxAppData = __wxAppData || {}; 	var __wxRoute = __wxRoute || ""; 	var __wxRouteBegin = __wxRouteBegin || ""; 	var __wxAppCode__ = __wxAppCode__ || {};	var global = global || {};	var __WXML_GLOBAL__=__WXML_GLOBAL__ || {};	var __wxAppCurrentFile__=__wxAppCurrentFile__||""; 	var Component = Component || function(){};	var definePlugin = definePlugin || function(){};	var requirePlugin = requirePlugin || function(){};	var Behavior = Behavior || function(){};
	
	define("config.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x4fa9 = ['\x31\x2e\x30\x2e\x32', '\u6E05\u6B22\u7D20\u96C5', '\x6d\x47\x56\x46\x63\x33\x31\x4d\x59\x4e\x4d\x6f\x52\x39\x5a\x2d\x41\x39\x79\x65\x56\x56\x59\x4c\x49\x56\x47\x70\x68\x55\x56\x63\x4b\x32\x2d\x53\x32\x55\x64\x5a\x48\x6d\x67', '\x41\x72\x6d\x32\x61\x53\x31\x72\x73\x6b\x6c\x52\x75\x4a\x53\x72\x66\x7a\x2d\x51\x56\x6f\x79\x55\x7a\x4c\x56\x6d\x55\x32\x76\x45\x4d\x6e\x5f\x48\x67\x4d\x78\x75\x65\x67\x77', '\x5a\x48\x32\x6a\x43\x56\x4d\x61\x38\x38\x4f\x4d\x78\x6b\x69\x33\x43\x36\x35\x68\x4c\x4c\x31\x57\x42\x30\x43\x71\x34\x5a\x6f\x4f\x57\x41\x7a\x4d\x56\x64\x30\x6b\x77\x55\x55', '\x65\x78\x70\x6f\x72\x74\x73', '\x68\x74\x74\x70\x73\x3a\x2f\x2f\x61\x70\x69\x2e\x69\x74\x31\x32\x30\x2e\x63\x63\x2f', '\x71\x69\x6e\x67\x70\x69\x6e\x67\x73\x75\x79\x61'];(function (_0x41356b, _0x5ba733) {
  var _0x45be32 = function _0x45be32(_0x235cea) {
    while (--_0x235cea) {
      _0x41356b['push'](_0x41356b['shift']());
    }
  };_0x45be32(++_0x5ba733);
})(wanzikun_0x4fa9, 0xbe);var wanzikun_0x5884 = function wanzikun_0x5884(_0x492c80, _0x2ebec3) {
  _0x492c80 = _0x492c80 - 0x0;var _0x453fcd = wanzikun_0x4fa9[_0x492c80];return _0x453fcd;
};var wanzikun_0x435319 = { '\x75\x72\x6c': wanzikun_0x5884('0x0'), '\x73\x75\x62\x44\x6f\x6d\x61\x69\x6e': wanzikun_0x5884('0x1'), '\x76\x65\x72\x73\x69\x6f\x6e': wanzikun_0x5884('0x2'), '\x73\x68\x61\x72\x65\x50\x72\x6f\x66\x69\x6c\x65': wanzikun_0x5884('0x3'), '\x74\x65\x6d\x70\x6c\x61\x74\x65\x6b\x65\x79': '\x38\x4b\x35\x53\x6c\x41\x64\x59\x58\x53\x51\x4d\x44\x38\x56\x6c\x6c\x61\x4e\x43\x47\x45\x72\x77\x64\x4a\x51\x77\x77\x72\x71\x51', '\x63\x6c\x6f\x73\x65\x6f\x72\x64\x65\x72\x6b\x65\x79': wanzikun_0x5884('0x4'), '\x64\x65\x6c\x69\x76\x65\x72\x79\x6f\x72\x64\x65\x72\x6b\x65\x79': wanzikun_0x5884('0x5'), '\x61\x73\x73\x65\x73\x73\x6f\x72\x64\x65\x72\x6b\x65\x79': wanzikun_0x5884('0x6'), '\x73\x75\x63\x63\x65\x73\x73\x6f\x72\x64\x65\x72\x6b\x65\x79': '\x6c\x4b\x42\x59\x31\x31\x64\x53\x6b\x78\x69\x69\x69\x36\x47\x42\x38\x33\x33\x56\x2d\x68\x46\x66\x48\x6a\x62\x42\x59\x73\x30\x76\x46\x74\x5f\x6f\x74\x71\x4d\x4b\x47\x5f\x34' };module[wanzikun_0x5884('0x7')] = wanzikun_0x435319; 
 			}); 
		define("pages/wuliu/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0xdab7 = ['\x52\x6c\x6d\x75\x42', '\x63\x6f\x64\x65', '\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c', '\x6d\x73\x67', '\x73\x65\x74\x44\x61\x74\x61', '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x54\x72\x61\x63\x65\x73', '\x72\x65\x76\x65\x72\x73\x65', '\x64\x61\x74\x61', '\x6f\x72\x64\x65\x72\x49\x64', '\x2f\x6f\x72\x64\x65\x72\x2f\x64\x65\x74\x61\x69\x6c', '\x72\x65\x71\x75\x65\x73\x74', '\x79\x49\x6a\x4a\x4d', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x75\x72\x6c\x73', '\x74\x6f\x6b\x65\x6e'];(function (_0x55f726, _0x3fc002) {
  var _0x1ef925 = function _0x1ef925(_0x278a44) {
    while (--_0x278a44) {
      _0x55f726['push'](_0x55f726['shift']());
    }
  };_0x1ef925(++_0x3fc002);
})(wanzikun_0xdab7, 0x19c);var wanzikun_0x1474 = function wanzikun_0x1474(_0x828f77, _0x5bd2c3) {
  _0x828f77 = _0x828f77 - 0x0;var _0x2b1cd3 = wanzikun_0xdab7[_0x828f77];return _0x2b1cd3;
};var wanzikun_0xd6c3f8 = getApp();Page({ '\x64\x61\x74\x61': {}, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad(_0x589084) {
    var _0x2ab8cd = _0x589084['\x69\x64'];this[wanzikun_0x1474('0x0')][wanzikun_0x1474('0x1')] = _0x2ab8cd;
  }, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    var _0x2ca421 = { '\x52\x6c\x6d\x75\x42': function RlmuB(_0x20dc85, _0x104159) {
        return _0x20dc85 != _0x104159;
      }, '\x79\x49\x6a\x4a\x4d': function yIjJM(_0x282e7e, _0x83da26) {
        return _0x282e7e + _0x83da26;
      }, '\x77\x71\x54\x6c\x64': wanzikun_0x1474('0x2') };var _0x4970c2 = this;wx[wanzikun_0x1474('0x3')]({ '\x75\x72\x6c': _0x2ca421[wanzikun_0x1474('0x4')](wanzikun_0xd6c3f8[wanzikun_0x1474('0x5')][wanzikun_0x1474('0x6')], _0x2ca421['\x77\x71\x54\x6c\x64']), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0xd6c3f8[wanzikun_0x1474('0x5')][wanzikun_0x1474('0x7')], '\x69\x64': _0x4970c2[wanzikun_0x1474('0x0')][wanzikun_0x1474('0x1')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x2bbc73) {
        wx['\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67']();if (_0x2ca421[wanzikun_0x1474('0x8')](_0x2bbc73[wanzikun_0x1474('0x0')][wanzikun_0x1474('0x9')], 0x0)) {
          wx[wanzikun_0x1474('0xa')]({ '\x74\x69\x74\x6c\x65': '\u9519\u8BEF', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x2bbc73[wanzikun_0x1474('0x0')][wanzikun_0x1474('0xb')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
        }_0x4970c2[wanzikun_0x1474('0xc')]({ '\x6f\x72\x64\x65\x72\x44\x65\x74\x61\x69\x6c': _0x2bbc73[wanzikun_0x1474('0x0')][wanzikun_0x1474('0x0')], '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x54\x72\x61\x63\x65\x73': _0x2bbc73[wanzikun_0x1474('0x0')]['\x64\x61\x74\x61'][wanzikun_0x1474('0xd')][wanzikun_0x1474('0xe')]() });
      } });
  } }); 
 			}); 
		define("utils/city.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
"use strict";

var cityData = [{ "name": "北京市", "id": 110000, "cityList": [{ "districtList": [], "name": "东城区", "pid": 110000, "id": 110101 }, { "districtList": [], "name": "西城区", "pid": 110000, "id": 110102 }, { "districtList": [], "name": "朝阳区", "pid": 110000, "id": 110105 }, { "districtList": [], "name": "丰台区", "pid": 110000, "id": 110106 }, { "districtList": [], "name": "石景山区", "pid": 110000, "id": 110107 }, { "districtList": [], "name": "海淀区", "pid": 110000, "id": 110108 }, { "districtList": [], "name": "门头沟区", "pid": 110000, "id": 110109 }, { "districtList": [], "name": "房山区", "pid": 110000, "id": 110111 }, { "districtList": [], "name": "通州区", "pid": 110000, "id": 110112 }, { "districtList": [], "name": "顺义区", "pid": 110000, "id": 110113 }, { "districtList": [], "name": "昌平区", "pid": 110000, "id": 110114 }, { "districtList": [], "name": "大兴区", "pid": 110000, "id": 110115 }, { "districtList": [], "name": "怀柔区", "pid": 110000, "id": 110116 }, { "districtList": [], "name": "平谷区", "pid": 110000, "id": 110117 }, { "districtList": [], "name": "密云县", "pid": 110000, "id": 110228 }, { "districtList": [], "name": "延庆县", "pid": 110000, "id": 110229 }] }, { "name": "天津市", "id": 120000, "cityList": [{ "districtList": [], "name": "和平区", "pid": 120000, "id": 120101 }, { "districtList": [], "name": "河东区", "pid": 120000, "id": 120102 }, { "districtList": [], "name": "河西区", "pid": 120000, "id": 120103 }, { "districtList": [], "name": "南开区", "pid": 120000, "id": 120104 }, { "districtList": [], "name": "河北区", "pid": 120000, "id": 120105 }, { "districtList": [], "name": "红桥区", "pid": 120000, "id": 120106 }, { "districtList": [], "name": "东丽区", "pid": 120000, "id": 120110 }, { "districtList": [], "name": "西青区", "pid": 120000, "id": 120111 }, { "districtList": [], "name": "津南区", "pid": 120000, "id": 120112 }, { "districtList": [], "name": "北辰区", "pid": 120000, "id": 120113 }, { "districtList": [], "name": "武清区", "pid": 120000, "id": 120114 }, { "districtList": [], "name": "宝坻区", "pid": 120000, "id": 120115 }, { "districtList": [], "name": "滨海新区", "pid": 120000, "id": 120116 }, { "districtList": [], "name": "宁河县", "pid": 120000, "id": 120221 }, { "districtList": [], "name": "静海县", "pid": 120000, "id": 120223 }, { "districtList": [], "name": "蓟县", "pid": 120000, "id": 120225 }] }, { "name": "河北省", "id": 130000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 130100, "id": 130101 }, { "name": "长安区", "pid": 130100, "id": 130102 }, { "name": "桥东区", "pid": 130100, "id": 130103 }, { "name": "桥西区", "pid": 130100, "id": 130104 }, { "name": "新华区", "pid": 130100, "id": 130105 }, { "name": "井陉矿区", "pid": 130100, "id": 130107 }, { "name": "裕华区", "pid": 130100, "id": 130108 }, { "name": "井陉县", "pid": 130100, "id": 130121 }, { "name": "正定县", "pid": 130100, "id": 130123 }, { "name": "栾城县", "pid": 130100, "id": 130124 }, { "name": "行唐县", "pid": 130100, "id": 130125 }, { "name": "灵寿县", "pid": 130100, "id": 130126 }, { "name": "高邑县", "pid": 130100, "id": 130127 }, { "name": "深泽县", "pid": 130100, "id": 130128 }, { "name": "赞皇县", "pid": 130100, "id": 130129 }, { "name": "无极县", "pid": 130100, "id": 130130 }, { "name": "平山县", "pid": 130100, "id": 130131 }, { "name": "元氏县", "pid": 130100, "id": 130132 }, { "name": "赵县", "pid": 130100, "id": 130133 }, { "name": "辛集市", "pid": 130100, "id": 130181 }, { "name": "藁城市", "pid": 130100, "id": 130182 }, { "name": "晋州市", "pid": 130100, "id": 130183 }, { "name": "新乐市", "pid": 130100, "id": 130184 }, { "name": "鹿泉市", "pid": 130100, "id": 130185 }], "name": "石家庄市", "pid": 130000, "id": 130100 }, { "districtList": [{ "name": "市辖区", "pid": 130200, "id": 130201 }, { "name": "路南区", "pid": 130200, "id": 130202 }, { "name": "路北区", "pid": 130200, "id": 130203 }, { "name": "古冶区", "pid": 130200, "id": 130204 }, { "name": "开平区", "pid": 130200, "id": 130205 }, { "name": "丰南区", "pid": 130200, "id": 130207 }, { "name": "丰润区", "pid": 130200, "id": 130208 }, { "name": "曹妃甸区", "pid": 130200, "id": 130209 }, { "name": "滦县", "pid": 130200, "id": 130223 }, { "name": "滦南县", "pid": 130200, "id": 130224 }, { "name": "乐亭县", "pid": 130200, "id": 130225 }, { "name": "迁西县", "pid": 130200, "id": 130227 }, { "name": "玉田县", "pid": 130200, "id": 130229 }, { "name": "遵化市", "pid": 130200, "id": 130281 }, { "name": "迁安市", "pid": 130200, "id": 130283 }], "name": "唐山市", "pid": 130000, "id": 130200 }, { "districtList": [{ "name": "市辖区", "pid": 130300, "id": 130301 }, { "name": "海港区", "pid": 130300, "id": 130302 }, { "name": "山海关区", "pid": 130300, "id": 130303 }, { "name": "北戴河区", "pid": 130300, "id": 130304 }, { "name": "青龙满族自治县", "pid": 130300, "id": 130321 }, { "name": "昌黎县", "pid": 130300, "id": 130322 }, { "name": "抚宁县", "pid": 130300, "id": 130323 }, { "name": "卢龙县", "pid": 130300, "id": 130324 }], "name": "秦皇岛市", "pid": 130000, "id": 130300 }, { "districtList": [{ "name": "市辖区", "pid": 130400, "id": 130401 }, { "name": "邯山区", "pid": 130400, "id": 130402 }, { "name": "丛台区", "pid": 130400, "id": 130403 }, { "name": "复兴区", "pid": 130400, "id": 130404 }, { "name": "峰峰矿区", "pid": 130400, "id": 130406 }, { "name": "邯郸县", "pid": 130400, "id": 130421 }, { "name": "临漳县", "pid": 130400, "id": 130423 }, { "name": "成安县", "pid": 130400, "id": 130424 }, { "name": "大名县", "pid": 130400, "id": 130425 }, { "name": "涉县", "pid": 130400, "id": 130426 }, { "name": "磁县", "pid": 130400, "id": 130427 }, { "name": "肥乡县", "pid": 130400, "id": 130428 }, { "name": "永年县", "pid": 130400, "id": 130429 }, { "name": "邱县", "pid": 130400, "id": 130430 }, { "name": "鸡泽县", "pid": 130400, "id": 130431 }, { "name": "广平县", "pid": 130400, "id": 130432 }, { "name": "馆陶县", "pid": 130400, "id": 130433 }, { "name": "魏县", "pid": 130400, "id": 130434 }, { "name": "曲周县", "pid": 130400, "id": 130435 }, { "name": "武安市", "pid": 130400, "id": 130481 }], "name": "邯郸市", "pid": 130000, "id": 130400 }, { "districtList": [{ "name": "市辖区", "pid": 130500, "id": 130501 }, { "name": "桥东区", "pid": 130500, "id": 130502 }, { "name": "桥西区", "pid": 130500, "id": 130503 }, { "name": "邢台县", "pid": 130500, "id": 130521 }, { "name": "临城县", "pid": 130500, "id": 130522 }, { "name": "内丘县", "pid": 130500, "id": 130523 }, { "name": "柏乡县", "pid": 130500, "id": 130524 }, { "name": "隆尧县", "pid": 130500, "id": 130525 }, { "name": "任县", "pid": 130500, "id": 130526 }, { "name": "南和县", "pid": 130500, "id": 130527 }, { "name": "宁晋县", "pid": 130500, "id": 130528 }, { "name": "巨鹿县", "pid": 130500, "id": 130529 }, { "name": "新河县", "pid": 130500, "id": 130530 }, { "name": "广宗县", "pid": 130500, "id": 130531 }, { "name": "平乡县", "pid": 130500, "id": 130532 }, { "name": "威县", "pid": 130500, "id": 130533 }, { "name": "清河县", "pid": 130500, "id": 130534 }, { "name": "临西县", "pid": 130500, "id": 130535 }, { "name": "南宫市", "pid": 130500, "id": 130581 }, { "name": "沙河市", "pid": 130500, "id": 130582 }], "name": "邢台市", "pid": 130000, "id": 130500 }, { "districtList": [{ "name": "市辖区", "pid": 130600, "id": 130601 }, { "name": "新市区", "pid": 130600, "id": 130602 }, { "name": "北市区", "pid": 130600, "id": 130603 }, { "name": "南市区", "pid": 130600, "id": 130604 }, { "name": "满城县", "pid": 130600, "id": 130621 }, { "name": "清苑县", "pid": 130600, "id": 130622 }, { "name": "涞水县", "pid": 130600, "id": 130623 }, { "name": "阜平县", "pid": 130600, "id": 130624 }, { "name": "徐水县", "pid": 130600, "id": 130625 }, { "name": "定兴县", "pid": 130600, "id": 130626 }, { "name": "唐县", "pid": 130600, "id": 130627 }, { "name": "高阳县", "pid": 130600, "id": 130628 }, { "name": "容城县", "pid": 130600, "id": 130629 }, { "name": "涞源县", "pid": 130600, "id": 130630 }, { "name": "望都县", "pid": 130600, "id": 130631 }, { "name": "安新县", "pid": 130600, "id": 130632 }, { "name": "易县", "pid": 130600, "id": 130633 }, { "name": "曲阳县", "pid": 130600, "id": 130634 }, { "name": "蠡县", "pid": 130600, "id": 130635 }, { "name": "顺平县", "pid": 130600, "id": 130636 }, { "name": "博野县", "pid": 130600, "id": 130637 }, { "name": "雄县", "pid": 130600, "id": 130638 }, { "name": "涿州市", "pid": 130600, "id": 130681 }, { "name": "定州市", "pid": 130600, "id": 130682 }, { "name": "安国市", "pid": 130600, "id": 130683 }, { "name": "高碑店市", "pid": 130600, "id": 130684 }], "name": "保定市", "pid": 130000, "id": 130600 }, { "districtList": [{ "name": "市辖区", "pid": 130700, "id": 130701 }, { "name": "桥东区", "pid": 130700, "id": 130702 }, { "name": "桥西区", "pid": 130700, "id": 130703 }, { "name": "宣化区", "pid": 130700, "id": 130705 }, { "name": "下花园区", "pid": 130700, "id": 130706 }, { "name": "宣化县", "pid": 130700, "id": 130721 }, { "name": "张北县", "pid": 130700, "id": 130722 }, { "name": "康保县", "pid": 130700, "id": 130723 }, { "name": "沽源县", "pid": 130700, "id": 130724 }, { "name": "尚义县", "pid": 130700, "id": 130725 }, { "name": "蔚县", "pid": 130700, "id": 130726 }, { "name": "阳原县", "pid": 130700, "id": 130727 }, { "name": "怀安县", "pid": 130700, "id": 130728 }, { "name": "万全县", "pid": 130700, "id": 130729 }, { "name": "怀来县", "pid": 130700, "id": 130730 }, { "name": "涿鹿县", "pid": 130700, "id": 130731 }, { "name": "赤城县", "pid": 130700, "id": 130732 }, { "name": "崇礼县", "pid": 130700, "id": 130733 }], "name": "张家口市", "pid": 130000, "id": 130700 }, { "districtList": [{ "name": "市辖区", "pid": 130800, "id": 130801 }, { "name": "双桥区", "pid": 130800, "id": 130802 }, { "name": "双滦区", "pid": 130800, "id": 130803 }, { "name": "鹰手营子矿区", "pid": 130800, "id": 130804 }, { "name": "承德县", "pid": 130800, "id": 130821 }, { "name": "兴隆县", "pid": 130800, "id": 130822 }, { "name": "平泉县", "pid": 130800, "id": 130823 }, { "name": "滦平县", "pid": 130800, "id": 130824 }, { "name": "隆化县", "pid": 130800, "id": 130825 }, { "name": "丰宁满族自治县", "pid": 130800, "id": 130826 }, { "name": "宽城满族自治县", "pid": 130800, "id": 130827 }, { "name": "围场满族蒙古族自治县", "pid": 130800, "id": 130828 }], "name": "承德市", "pid": 130000, "id": 130800 }, { "districtList": [{ "name": "市辖区", "pid": 130900, "id": 130901 }, { "name": "新华区", "pid": 130900, "id": 130902 }, { "name": "运河区", "pid": 130900, "id": 130903 }, { "name": "沧县", "pid": 130900, "id": 130921 }, { "name": "青县", "pid": 130900, "id": 130922 }, { "name": "东光县", "pid": 130900, "id": 130923 }, { "name": "海兴县", "pid": 130900, "id": 130924 }, { "name": "盐山县", "pid": 130900, "id": 130925 }, { "name": "肃宁县", "pid": 130900, "id": 130926 }, { "name": "南皮县", "pid": 130900, "id": 130927 }, { "name": "吴桥县", "pid": 130900, "id": 130928 }, { "name": "献县", "pid": 130900, "id": 130929 }, { "name": "孟村回族自治县", "pid": 130900, "id": 130930 }, { "name": "泊头市", "pid": 130900, "id": 130981 }, { "name": "任丘市", "pid": 130900, "id": 130982 }, { "name": "黄骅市", "pid": 130900, "id": 130983 }, { "name": "河间市", "pid": 130900, "id": 130984 }], "name": "沧州市", "pid": 130000, "id": 130900 }, { "districtList": [{ "name": "市辖区", "pid": 131000, "id": 131001 }, { "name": "安次区", "pid": 131000, "id": 131002 }, { "name": "广阳区", "pid": 131000, "id": 131003 }, { "name": "固安县", "pid": 131000, "id": 131022 }, { "name": "永清县", "pid": 131000, "id": 131023 }, { "name": "香河县", "pid": 131000, "id": 131024 }, { "name": "大城县", "pid": 131000, "id": 131025 }, { "name": "文安县", "pid": 131000, "id": 131026 }, { "name": "大厂回族自治县", "pid": 131000, "id": 131028 }, { "name": "霸州市", "pid": 131000, "id": 131081 }, { "name": "三河市", "pid": 131000, "id": 131082 }], "name": "廊坊市", "pid": 130000, "id": 131000 }, { "districtList": [{ "name": "市辖区", "pid": 131100, "id": 131101 }, { "name": "桃城区", "pid": 131100, "id": 131102 }, { "name": "枣强县", "pid": 131100, "id": 131121 }, { "name": "武邑县", "pid": 131100, "id": 131122 }, { "name": "武强县", "pid": 131100, "id": 131123 }, { "name": "饶阳县", "pid": 131100, "id": 131124 }, { "name": "安平县", "pid": 131100, "id": 131125 }, { "name": "故城县", "pid": 131100, "id": 131126 }, { "name": "景县", "pid": 131100, "id": 131127 }, { "name": "阜城县", "pid": 131100, "id": 131128 }, { "name": "冀州市", "pid": 131100, "id": 131181 }, { "name": "深州市", "pid": 131100, "id": 131182 }], "name": "衡水市", "pid": 130000, "id": 131100 }] }, { "name": "山西省", "id": 140000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 140100, "id": 140101 }, { "name": "小店区", "pid": 140100, "id": 140105 }, { "name": "迎泽区", "pid": 140100, "id": 140106 }, { "name": "杏花岭区", "pid": 140100, "id": 140107 }, { "name": "尖草坪区", "pid": 140100, "id": 140108 }, { "name": "万柏林区", "pid": 140100, "id": 140109 }, { "name": "晋源区", "pid": 140100, "id": 140110 }, { "name": "清徐县", "pid": 140100, "id": 140121 }, { "name": "阳曲县", "pid": 140100, "id": 140122 }, { "name": "娄烦县", "pid": 140100, "id": 140123 }, { "name": "古交市", "pid": 140100, "id": 140181 }], "name": "太原市", "pid": 140000, "id": 140100 }, { "districtList": [{ "name": "市辖区", "pid": 140200, "id": 140201 }, { "name": "城区", "pid": 140200, "id": 140202 }, { "name": "矿区", "pid": 140200, "id": 140203 }, { "name": "南郊区", "pid": 140200, "id": 140211 }, { "name": "新荣区", "pid": 140200, "id": 140212 }, { "name": "阳高县", "pid": 140200, "id": 140221 }, { "name": "天镇县", "pid": 140200, "id": 140222 }, { "name": "广灵县", "pid": 140200, "id": 140223 }, { "name": "灵丘县", "pid": 140200, "id": 140224 }, { "name": "浑源县", "pid": 140200, "id": 140225 }, { "name": "左云县", "pid": 140200, "id": 140226 }, { "name": "大同县", "pid": 140200, "id": 140227 }], "name": "大同市", "pid": 140000, "id": 140200 }, { "districtList": [{ "name": "市辖区", "pid": 140300, "id": 140301 }, { "name": "城区", "pid": 140300, "id": 140302 }, { "name": "矿区", "pid": 140300, "id": 140303 }, { "name": "郊区", "pid": 140300, "id": 140311 }, { "name": "平定县", "pid": 140300, "id": 140321 }, { "name": "盂县", "pid": 140300, "id": 140322 }], "name": "阳泉市", "pid": 140000, "id": 140300 }, { "districtList": [{ "name": "市辖区", "pid": 140400, "id": 140401 }, { "name": "城区", "pid": 140400, "id": 140402 }, { "name": "郊区", "pid": 140400, "id": 140411 }, { "name": "长治县", "pid": 140400, "id": 140421 }, { "name": "襄垣县", "pid": 140400, "id": 140423 }, { "name": "屯留县", "pid": 140400, "id": 140424 }, { "name": "平顺县", "pid": 140400, "id": 140425 }, { "name": "黎城县", "pid": 140400, "id": 140426 }, { "name": "壶关县", "pid": 140400, "id": 140427 }, { "name": "长子县", "pid": 140400, "id": 140428 }, { "name": "武乡县", "pid": 140400, "id": 140429 }, { "name": "沁县", "pid": 140400, "id": 140430 }, { "name": "沁源县", "pid": 140400, "id": 140431 }, { "name": "潞城市", "pid": 140400, "id": 140481 }], "name": "长治市", "pid": 140000, "id": 140400 }, { "districtList": [{ "name": "市辖区", "pid": 140500, "id": 140501 }, { "name": "城区", "pid": 140500, "id": 140502 }, { "name": "沁水县", "pid": 140500, "id": 140521 }, { "name": "阳城县", "pid": 140500, "id": 140522 }, { "name": "陵川县", "pid": 140500, "id": 140524 }, { "name": "泽州县", "pid": 140500, "id": 140525 }, { "name": "高平市", "pid": 140500, "id": 140581 }], "name": "晋城市", "pid": 140000, "id": 140500 }, { "districtList": [{ "name": "市辖区", "pid": 140600, "id": 140601 }, { "name": "朔城区", "pid": 140600, "id": 140602 }, { "name": "平鲁区", "pid": 140600, "id": 140603 }, { "name": "山阴县", "pid": 140600, "id": 140621 }, { "name": "应县", "pid": 140600, "id": 140622 }, { "name": "右玉县", "pid": 140600, "id": 140623 }, { "name": "怀仁县", "pid": 140600, "id": 140624 }], "name": "朔州市", "pid": 140000, "id": 140600 }, { "districtList": [{ "name": "市辖区", "pid": 140700, "id": 140701 }, { "name": "榆次区", "pid": 140700, "id": 140702 }, { "name": "榆社县", "pid": 140700, "id": 140721 }, { "name": "左权县", "pid": 140700, "id": 140722 }, { "name": "和顺县", "pid": 140700, "id": 140723 }, { "name": "昔阳县", "pid": 140700, "id": 140724 }, { "name": "寿阳县", "pid": 140700, "id": 140725 }, { "name": "太谷县", "pid": 140700, "id": 140726 }, { "name": "祁县", "pid": 140700, "id": 140727 }, { "name": "平遥县", "pid": 140700, "id": 140728 }, { "name": "灵石县", "pid": 140700, "id": 140729 }, { "name": "介休市", "pid": 140700, "id": 140781 }], "name": "晋中市", "pid": 140000, "id": 140700 }, { "districtList": [{ "name": "市辖区", "pid": 140800, "id": 140801 }, { "name": "盐湖区", "pid": 140800, "id": 140802 }, { "name": "临猗县", "pid": 140800, "id": 140821 }, { "name": "万荣县", "pid": 140800, "id": 140822 }, { "name": "闻喜县", "pid": 140800, "id": 140823 }, { "name": "稷山县", "pid": 140800, "id": 140824 }, { "name": "新绛县", "pid": 140800, "id": 140825 }, { "name": "绛县", "pid": 140800, "id": 140826 }, { "name": "垣曲县", "pid": 140800, "id": 140827 }, { "name": "夏县", "pid": 140800, "id": 140828 }, { "name": "平陆县", "pid": 140800, "id": 140829 }, { "name": "芮城县", "pid": 140800, "id": 140830 }, { "name": "永济市", "pid": 140800, "id": 140881 }, { "name": "河津市", "pid": 140800, "id": 140882 }], "name": "运城市", "pid": 140000, "id": 140800 }, { "districtList": [{ "name": "市辖区", "pid": 140900, "id": 140901 }, { "name": "忻府区", "pid": 140900, "id": 140902 }, { "name": "定襄县", "pid": 140900, "id": 140921 }, { "name": "五台县", "pid": 140900, "id": 140922 }, { "name": "代县", "pid": 140900, "id": 140923 }, { "name": "繁峙县", "pid": 140900, "id": 140924 }, { "name": "宁武县", "pid": 140900, "id": 140925 }, { "name": "静乐县", "pid": 140900, "id": 140926 }, { "name": "神池县", "pid": 140900, "id": 140927 }, { "name": "五寨县", "pid": 140900, "id": 140928 }, { "name": "岢岚县", "pid": 140900, "id": 140929 }, { "name": "河曲县", "pid": 140900, "id": 140930 }, { "name": "保德县", "pid": 140900, "id": 140931 }, { "name": "偏关县", "pid": 140900, "id": 140932 }, { "name": "原平市", "pid": 140900, "id": 140981 }], "name": "忻州市", "pid": 140000, "id": 140900 }, { "districtList": [{ "name": "市辖区", "pid": 141000, "id": 141001 }, { "name": "尧都区", "pid": 141000, "id": 141002 }, { "name": "曲沃县", "pid": 141000, "id": 141021 }, { "name": "翼城县", "pid": 141000, "id": 141022 }, { "name": "襄汾县", "pid": 141000, "id": 141023 }, { "name": "洪洞县", "pid": 141000, "id": 141024 }, { "name": "古县", "pid": 141000, "id": 141025 }, { "name": "安泽县", "pid": 141000, "id": 141026 }, { "name": "浮山县", "pid": 141000, "id": 141027 }, { "name": "吉县", "pid": 141000, "id": 141028 }, { "name": "乡宁县", "pid": 141000, "id": 141029 }, { "name": "大宁县", "pid": 141000, "id": 141030 }, { "name": "隰县", "pid": 141000, "id": 141031 }, { "name": "永和县", "pid": 141000, "id": 141032 }, { "name": "蒲县", "pid": 141000, "id": 141033 }, { "name": "汾西县", "pid": 141000, "id": 141034 }, { "name": "侯马市", "pid": 141000, "id": 141081 }, { "name": "霍州市", "pid": 141000, "id": 141082 }], "name": "临汾市", "pid": 140000, "id": 141000 }, { "districtList": [{ "name": "市辖区", "pid": 141100, "id": 141101 }, { "name": "离石区", "pid": 141100, "id": 141102 }, { "name": "文水县", "pid": 141100, "id": 141121 }, { "name": "交城县", "pid": 141100, "id": 141122 }, { "name": "兴县", "pid": 141100, "id": 141123 }, { "name": "临县", "pid": 141100, "id": 141124 }, { "name": "柳林县", "pid": 141100, "id": 141125 }, { "name": "石楼县", "pid": 141100, "id": 141126 }, { "name": "岚县", "pid": 141100, "id": 141127 }, { "name": "方山县", "pid": 141100, "id": 141128 }, { "name": "中阳县", "pid": 141100, "id": 141129 }, { "name": "交口县", "pid": 141100, "id": 141130 }, { "name": "孝义市", "pid": 141100, "id": 141181 }, { "name": "汾阳市", "pid": 141100, "id": 141182 }], "name": "吕梁市", "pid": 140000, "id": 141100 }] }, { "name": "内蒙古自治区", "id": 150000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 150100, "id": 150101 }, { "name": "新城区", "pid": 150100, "id": 150102 }, { "name": "回民区", "pid": 150100, "id": 150103 }, { "name": "玉泉区", "pid": 150100, "id": 150104 }, { "name": "赛罕区", "pid": 150100, "id": 150105 }, { "name": "土默特左旗", "pid": 150100, "id": 150121 }, { "name": "托克托县", "pid": 150100, "id": 150122 }, { "name": "和林格尔县", "pid": 150100, "id": 150123 }, { "name": "清水河县", "pid": 150100, "id": 150124 }, { "name": "武川县", "pid": 150100, "id": 150125 }], "name": "呼和浩特市", "pid": 150000, "id": 150100 }, { "districtList": [{ "name": "市辖区", "pid": 150200, "id": 150201 }, { "name": "东河区", "pid": 150200, "id": 150202 }, { "name": "昆都仑区", "pid": 150200, "id": 150203 }, { "name": "青山区", "pid": 150200, "id": 150204 }, { "name": "石拐区", "pid": 150200, "id": 150205 }, { "name": "白云鄂博矿区", "pid": 150200, "id": 150206 }, { "name": "九原区", "pid": 150200, "id": 150207 }, { "name": "土默特右旗", "pid": 150200, "id": 150221 }, { "name": "固阳县", "pid": 150200, "id": 150222 }, { "name": "达尔罕茂明安联合旗", "pid": 150200, "id": 150223 }], "name": "包头市", "pid": 150000, "id": 150200 }, { "districtList": [{ "name": "市辖区", "pid": 150300, "id": 150301 }, { "name": "海勃湾区", "pid": 150300, "id": 150302 }, { "name": "海南区", "pid": 150300, "id": 150303 }, { "name": "乌达区", "pid": 150300, "id": 150304 }], "name": "乌海市", "pid": 150000, "id": 150300 }, { "districtList": [{ "name": "市辖区", "pid": 150400, "id": 150401 }, { "name": "红山区", "pid": 150400, "id": 150402 }, { "name": "元宝山区", "pid": 150400, "id": 150403 }, { "name": "松山区", "pid": 150400, "id": 150404 }, { "name": "阿鲁科尔沁旗", "pid": 150400, "id": 150421 }, { "name": "巴林左旗", "pid": 150400, "id": 150422 }, { "name": "巴林右旗", "pid": 150400, "id": 150423 }, { "name": "林西县", "pid": 150400, "id": 150424 }, { "name": "克什克腾旗", "pid": 150400, "id": 150425 }, { "name": "翁牛特旗", "pid": 150400, "id": 150426 }, { "name": "喀喇沁旗", "pid": 150400, "id": 150428 }, { "name": "宁城县", "pid": 150400, "id": 150429 }, { "name": "敖汉旗", "pid": 150400, "id": 150430 }], "name": "赤峰市", "pid": 150000, "id": 150400 }, { "districtList": [{ "name": "市辖区", "pid": 150500, "id": 150501 }, { "name": "科尔沁区", "pid": 150500, "id": 150502 }, { "name": "科尔沁左翼中旗", "pid": 150500, "id": 150521 }, { "name": "科尔沁左翼后旗", "pid": 150500, "id": 150522 }, { "name": "开鲁县", "pid": 150500, "id": 150523 }, { "name": "库伦旗", "pid": 150500, "id": 150524 }, { "name": "奈曼旗", "pid": 150500, "id": 150525 }, { "name": "扎鲁特旗", "pid": 150500, "id": 150526 }, { "name": "霍林郭勒市", "pid": 150500, "id": 150581 }], "name": "通辽市", "pid": 150000, "id": 150500 }, { "districtList": [{ "name": "市辖区", "pid": 150600, "id": 150601 }, { "name": "东胜区", "pid": 150600, "id": 150602 }, { "name": "达拉特旗", "pid": 150600, "id": 150621 }, { "name": "准格尔旗", "pid": 150600, "id": 150622 }, { "name": "鄂托克前旗", "pid": 150600, "id": 150623 }, { "name": "鄂托克旗", "pid": 150600, "id": 150624 }, { "name": "杭锦旗", "pid": 150600, "id": 150625 }, { "name": "乌审旗", "pid": 150600, "id": 150626 }, { "name": "伊金霍洛旗", "pid": 150600, "id": 150627 }], "name": "鄂尔多斯市", "pid": 150000, "id": 150600 }, { "districtList": [{ "name": "市辖区", "pid": 150700, "id": 150701 }, { "name": "海拉尔区", "pid": 150700, "id": 150702 }, { "name": "扎赉诺尔区", "pid": 150700, "id": 150703 }, { "name": "阿荣旗", "pid": 150700, "id": 150721 }, { "name": "莫力达瓦达斡尔族自治旗", "pid": 150700, "id": 150722 }, { "name": "鄂伦春自治旗", "pid": 150700, "id": 150723 }, { "name": "鄂温克族自治旗", "pid": 150700, "id": 150724 }, { "name": "陈巴尔虎旗", "pid": 150700, "id": 150725 }, { "name": "新巴尔虎左旗", "pid": 150700, "id": 150726 }, { "name": "新巴尔虎右旗", "pid": 150700, "id": 150727 }, { "name": "满洲里市", "pid": 150700, "id": 150781 }, { "name": "牙克石市", "pid": 150700, "id": 150782 }, { "name": "扎兰屯市", "pid": 150700, "id": 150783 }, { "name": "额尔古纳市", "pid": 150700, "id": 150784 }, { "name": "根河市", "pid": 150700, "id": 150785 }], "name": "呼伦贝尔市", "pid": 150000, "id": 150700 }, { "districtList": [{ "name": "市辖区", "pid": 150800, "id": 150801 }, { "name": "临河区", "pid": 150800, "id": 150802 }, { "name": "五原县", "pid": 150800, "id": 150821 }, { "name": "磴口县", "pid": 150800, "id": 150822 }, { "name": "乌拉特前旗", "pid": 150800, "id": 150823 }, { "name": "乌拉特中旗", "pid": 150800, "id": 150824 }, { "name": "乌拉特后旗", "pid": 150800, "id": 150825 }, { "name": "杭锦后旗", "pid": 150800, "id": 150826 }], "name": "巴彦淖尔市", "pid": 150000, "id": 150800 }, { "districtList": [{ "name": "市辖区", "pid": 150900, "id": 150901 }, { "name": "集宁区", "pid": 150900, "id": 150902 }, { "name": "卓资县", "pid": 150900, "id": 150921 }, { "name": "化德县", "pid": 150900, "id": 150922 }, { "name": "商都县", "pid": 150900, "id": 150923 }, { "name": "兴和县", "pid": 150900, "id": 150924 }, { "name": "凉城县", "pid": 150900, "id": 150925 }, { "name": "察哈尔右翼前旗", "pid": 150900, "id": 150926 }, { "name": "察哈尔右翼中旗", "pid": 150900, "id": 150927 }, { "name": "察哈尔右翼后旗", "pid": 150900, "id": 150928 }, { "name": "四子王旗", "pid": 150900, "id": 150929 }, { "name": "丰镇市", "pid": 150900, "id": 150981 }], "name": "乌兰察布市", "pid": 150000, "id": 150900 }, { "districtList": [{ "name": "乌兰浩特市", "pid": 152200, "id": 152201 }, { "name": "阿尔山市", "pid": 152200, "id": 152202 }, { "name": "科尔沁右翼前旗", "pid": 152200, "id": 152221 }, { "name": "科尔沁右翼中旗", "pid": 152200, "id": 152222 }, { "name": "扎赉特旗", "pid": 152200, "id": 152223 }, { "name": "突泉县", "pid": 152200, "id": 152224 }], "name": "兴安盟", "pid": 150000, "id": 152200 }, { "districtList": [{ "name": "二连浩特市", "pid": 152500, "id": 152501 }, { "name": "锡林浩特市", "pid": 152500, "id": 152502 }, { "name": "阿巴嘎旗", "pid": 152500, "id": 152522 }, { "name": "苏尼特左旗", "pid": 152500, "id": 152523 }, { "name": "苏尼特右旗", "pid": 152500, "id": 152524 }, { "name": "东乌珠穆沁旗", "pid": 152500, "id": 152525 }, { "name": "西乌珠穆沁旗", "pid": 152500, "id": 152526 }, { "name": "太仆寺旗", "pid": 152500, "id": 152527 }, { "name": "镶黄旗", "pid": 152500, "id": 152528 }, { "name": "正镶白旗", "pid": 152500, "id": 152529 }, { "name": "正蓝旗", "pid": 152500, "id": 152530 }, { "name": "多伦县", "pid": 152500, "id": 152531 }], "name": "锡林郭勒盟", "pid": 150000, "id": 152500 }, { "districtList": [{ "name": "阿拉善左旗", "pid": 152900, "id": 152921 }, { "name": "阿拉善右旗", "pid": 152900, "id": 152922 }, { "name": "额济纳旗", "pid": 152900, "id": 152923 }], "name": "阿拉善盟", "pid": 150000, "id": 152900 }] }, { "name": "辽宁省", "id": 210000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 210100, "id": 210101 }, { "name": "和平区", "pid": 210100, "id": 210102 }, { "name": "沈河区", "pid": 210100, "id": 210103 }, { "name": "大东区", "pid": 210100, "id": 210104 }, { "name": "皇姑区", "pid": 210100, "id": 210105 }, { "name": "铁西区", "pid": 210100, "id": 210106 }, { "name": "苏家屯区", "pid": 210100, "id": 210111 }, { "name": "东陵区", "pid": 210100, "id": 210112 }, { "name": "沈北新区", "pid": 210100, "id": 210113 }, { "name": "于洪区", "pid": 210100, "id": 210114 }, { "name": "辽中县", "pid": 210100, "id": 210122 }, { "name": "康平县", "pid": 210100, "id": 210123 }, { "name": "法库县", "pid": 210100, "id": 210124 }, { "name": "新民市", "pid": 210100, "id": 210181 }], "name": "沈阳市", "pid": 210000, "id": 210100 }, { "districtList": [{ "name": "市辖区", "pid": 210200, "id": 210201 }, { "name": "中山区", "pid": 210200, "id": 210202 }, { "name": "西岗区", "pid": 210200, "id": 210203 }, { "name": "沙河口区", "pid": 210200, "id": 210204 }, { "name": "甘井子区", "pid": 210200, "id": 210211 }, { "name": "旅顺口区", "pid": 210200, "id": 210212 }, { "name": "金州区", "pid": 210200, "id": 210213 }, { "name": "长海县", "pid": 210200, "id": 210224 }, { "name": "瓦房店市", "pid": 210200, "id": 210281 }, { "name": "普兰店市", "pid": 210200, "id": 210282 }, { "name": "庄河市", "pid": 210200, "id": 210283 }], "name": "大连市", "pid": 210000, "id": 210200 }, { "districtList": [{ "name": "市辖区", "pid": 210300, "id": 210301 }, { "name": "铁东区", "pid": 210300, "id": 210302 }, { "name": "铁西区", "pid": 210300, "id": 210303 }, { "name": "立山区", "pid": 210300, "id": 210304 }, { "name": "千山区", "pid": 210300, "id": 210311 }, { "name": "台安县", "pid": 210300, "id": 210321 }, { "name": "岫岩满族自治县", "pid": 210300, "id": 210323 }, { "name": "海城市", "pid": 210300, "id": 210381 }], "name": "鞍山市", "pid": 210000, "id": 210300 }, { "districtList": [{ "name": "市辖区", "pid": 210400, "id": 210401 }, { "name": "新抚区", "pid": 210400, "id": 210402 }, { "name": "东洲区", "pid": 210400, "id": 210403 }, { "name": "望花区", "pid": 210400, "id": 210404 }, { "name": "顺城区", "pid": 210400, "id": 210411 }, { "name": "抚顺县", "pid": 210400, "id": 210421 }, { "name": "新宾满族自治县", "pid": 210400, "id": 210422 }, { "name": "清原满族自治县", "pid": 210400, "id": 210423 }], "name": "抚顺市", "pid": 210000, "id": 210400 }, { "districtList": [{ "name": "市辖区", "pid": 210500, "id": 210501 }, { "name": "平山区", "pid": 210500, "id": 210502 }, { "name": "溪湖区", "pid": 210500, "id": 210503 }, { "name": "明山区", "pid": 210500, "id": 210504 }, { "name": "南芬区", "pid": 210500, "id": 210505 }, { "name": "本溪满族自治县", "pid": 210500, "id": 210521 }, { "name": "桓仁满族自治县", "pid": 210500, "id": 210522 }], "name": "本溪市", "pid": 210000, "id": 210500 }, { "districtList": [{ "name": "市辖区", "pid": 210600, "id": 210601 }, { "name": "元宝区", "pid": 210600, "id": 210602 }, { "name": "振兴区", "pid": 210600, "id": 210603 }, { "name": "振安区", "pid": 210600, "id": 210604 }, { "name": "宽甸满族自治县", "pid": 210600, "id": 210624 }, { "name": "东港市", "pid": 210600, "id": 210681 }, { "name": "凤城市", "pid": 210600, "id": 210682 }], "name": "丹东市", "pid": 210000, "id": 210600 }, { "districtList": [{ "name": "市辖区", "pid": 210700, "id": 210701 }, { "name": "古塔区", "pid": 210700, "id": 210702 }, { "name": "凌河区", "pid": 210700, "id": 210703 }, { "name": "太和区", "pid": 210700, "id": 210711 }, { "name": "黑山县", "pid": 210700, "id": 210726 }, { "name": "义县", "pid": 210700, "id": 210727 }, { "name": "凌海市", "pid": 210700, "id": 210781 }, { "name": "北镇市", "pid": 210700, "id": 210782 }], "name": "锦州市", "pid": 210000, "id": 210700 }, { "districtList": [{ "name": "市辖区", "pid": 210800, "id": 210801 }, { "name": "站前区", "pid": 210800, "id": 210802 }, { "name": "西市区", "pid": 210800, "id": 210803 }, { "name": "鲅鱼圈区", "pid": 210800, "id": 210804 }, { "name": "老边区", "pid": 210800, "id": 210811 }, { "name": "盖州市", "pid": 210800, "id": 210881 }, { "name": "大石桥市", "pid": 210800, "id": 210882 }], "name": "营口市", "pid": 210000, "id": 210800 }, { "districtList": [{ "name": "市辖区", "pid": 210900, "id": 210901 }, { "name": "海州区", "pid": 210900, "id": 210902 }, { "name": "新邱区", "pid": 210900, "id": 210903 }, { "name": "太平区", "pid": 210900, "id": 210904 }, { "name": "清河门区", "pid": 210900, "id": 210905 }, { "name": "细河区", "pid": 210900, "id": 210911 }, { "name": "阜新蒙古族自治县", "pid": 210900, "id": 210921 }, { "name": "彰武县", "pid": 210900, "id": 210922 }], "name": "阜新市", "pid": 210000, "id": 210900 }, { "districtList": [{ "name": "市辖区", "pid": 211000, "id": 211001 }, { "name": "白塔区", "pid": 211000, "id": 211002 }, { "name": "文圣区", "pid": 211000, "id": 211003 }, { "name": "宏伟区", "pid": 211000, "id": 211004 }, { "name": "弓长岭区", "pid": 211000, "id": 211005 }, { "name": "太子河区", "pid": 211000, "id": 211011 }, { "name": "辽阳县", "pid": 211000, "id": 211021 }, { "name": "灯塔市", "pid": 211000, "id": 211081 }], "name": "辽阳市", "pid": 210000, "id": 211000 }, { "districtList": [{ "name": "市辖区", "pid": 211100, "id": 211101 }, { "name": "双台子区", "pid": 211100, "id": 211102 }, { "name": "兴隆台区", "pid": 211100, "id": 211103 }, { "name": "大洼县", "pid": 211100, "id": 211121 }, { "name": "盘山县", "pid": 211100, "id": 211122 }], "name": "盘锦市", "pid": 210000, "id": 211100 }, { "districtList": [{ "name": "市辖区", "pid": 211200, "id": 211201 }, { "name": "银州区", "pid": 211200, "id": 211202 }, { "name": "清河区", "pid": 211200, "id": 211204 }, { "name": "铁岭县", "pid": 211200, "id": 211221 }, { "name": "西丰县", "pid": 211200, "id": 211223 }, { "name": "昌图县", "pid": 211200, "id": 211224 }, { "name": "调兵山市", "pid": 211200, "id": 211281 }, { "name": "开原市", "pid": 211200, "id": 211282 }], "name": "铁岭市", "pid": 210000, "id": 211200 }, { "districtList": [{ "name": "市辖区", "pid": 211300, "id": 211301 }, { "name": "双塔区", "pid": 211300, "id": 211302 }, { "name": "龙城区", "pid": 211300, "id": 211303 }, { "name": "朝阳县", "pid": 211300, "id": 211321 }, { "name": "建平县", "pid": 211300, "id": 211322 }, { "name": "喀喇沁左翼蒙古族自治县", "pid": 211300, "id": 211324 }, { "name": "北票市", "pid": 211300, "id": 211381 }, { "name": "凌源市", "pid": 211300, "id": 211382 }], "name": "朝阳市", "pid": 210000, "id": 211300 }, { "districtList": [{ "name": "市辖区", "pid": 211400, "id": 211401 }, { "name": "连山区", "pid": 211400, "id": 211402 }, { "name": "龙港区", "pid": 211400, "id": 211403 }, { "name": "南票区", "pid": 211400, "id": 211404 }, { "name": "绥中县", "pid": 211400, "id": 211421 }, { "name": "建昌县", "pid": 211400, "id": 211422 }, { "name": "兴城市", "pid": 211400, "id": 211481 }], "name": "葫芦岛市", "pid": 210000, "id": 211400 }] }, { "name": "吉林省", "id": 220000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 220100, "id": 220101 }, { "name": "南关区", "pid": 220100, "id": 220102 }, { "name": "宽城区", "pid": 220100, "id": 220103 }, { "name": "朝阳区", "pid": 220100, "id": 220104 }, { "name": "二道区", "pid": 220100, "id": 220105 }, { "name": "绿园区", "pid": 220100, "id": 220106 }, { "name": "双阳区", "pid": 220100, "id": 220112 }, { "name": "农安县", "pid": 220100, "id": 220122 }, { "name": "九台市", "pid": 220100, "id": 220181 }, { "name": "榆树市", "pid": 220100, "id": 220182 }, { "name": "德惠市", "pid": 220100, "id": 220183 }], "name": "长春市", "pid": 220000, "id": 220100 }, { "districtList": [{ "name": "市辖区", "pid": 220200, "id": 220201 }, { "name": "昌邑区", "pid": 220200, "id": 220202 }, { "name": "龙潭区", "pid": 220200, "id": 220203 }, { "name": "船营区", "pid": 220200, "id": 220204 }, { "name": "丰满区", "pid": 220200, "id": 220211 }, { "name": "永吉县", "pid": 220200, "id": 220221 }, { "name": "蛟河市", "pid": 220200, "id": 220281 }, { "name": "桦甸市", "pid": 220200, "id": 220282 }, { "name": "舒兰市", "pid": 220200, "id": 220283 }, { "name": "磐石市", "pid": 220200, "id": 220284 }], "name": "吉林市", "pid": 220000, "id": 220200 }, { "districtList": [{ "name": "市辖区", "pid": 220300, "id": 220301 }, { "name": "铁西区", "pid": 220300, "id": 220302 }, { "name": "铁东区", "pid": 220300, "id": 220303 }, { "name": "梨树县", "pid": 220300, "id": 220322 }, { "name": "伊通满族自治县", "pid": 220300, "id": 220323 }, { "name": "公主岭市", "pid": 220300, "id": 220381 }, { "name": "双辽市", "pid": 220300, "id": 220382 }], "name": "四平市", "pid": 220000, "id": 220300 }, { "districtList": [{ "name": "市辖区", "pid": 220400, "id": 220401 }, { "name": "龙山区", "pid": 220400, "id": 220402 }, { "name": "西安区", "pid": 220400, "id": 220403 }, { "name": "东丰县", "pid": 220400, "id": 220421 }, { "name": "东辽县", "pid": 220400, "id": 220422 }], "name": "辽源市", "pid": 220000, "id": 220400 }, { "districtList": [{ "name": "市辖区", "pid": 220500, "id": 220501 }, { "name": "东昌区", "pid": 220500, "id": 220502 }, { "name": "二道江区", "pid": 220500, "id": 220503 }, { "name": "通化县", "pid": 220500, "id": 220521 }, { "name": "辉南县", "pid": 220500, "id": 220523 }, { "name": "柳河县", "pid": 220500, "id": 220524 }, { "name": "梅河口市", "pid": 220500, "id": 220581 }, { "name": "集安市", "pid": 220500, "id": 220582 }], "name": "通化市", "pid": 220000, "id": 220500 }, { "districtList": [{ "name": "市辖区", "pid": 220600, "id": 220601 }, { "name": "浑江区", "pid": 220600, "id": 220602 }, { "name": "江源区", "pid": 220600, "id": 220605 }, { "name": "抚松县", "pid": 220600, "id": 220621 }, { "name": "靖宇县", "pid": 220600, "id": 220622 }, { "name": "长白朝鲜族自治县", "pid": 220600, "id": 220623 }, { "name": "临江市", "pid": 220600, "id": 220681 }], "name": "白山市", "pid": 220000, "id": 220600 }, { "districtList": [{ "name": "市辖区", "pid": 220700, "id": 220701 }, { "name": "宁江区", "pid": 220700, "id": 220702 }, { "name": "前郭尔罗斯蒙古族自治县", "pid": 220700, "id": 220721 }, { "name": "长岭县", "pid": 220700, "id": 220722 }, { "name": "乾安县", "pid": 220700, "id": 220723 }, { "name": "扶余市", "pid": 220700, "id": 220781 }], "name": "松原市", "pid": 220000, "id": 220700 }, { "districtList": [{ "name": "市辖区", "pid": 220800, "id": 220801 }, { "name": "洮北区", "pid": 220800, "id": 220802 }, { "name": "镇赉县", "pid": 220800, "id": 220821 }, { "name": "通榆县", "pid": 220800, "id": 220822 }, { "name": "洮南市", "pid": 220800, "id": 220881 }, { "name": "大安市", "pid": 220800, "id": 220882 }], "name": "白城市", "pid": 220000, "id": 220800 }, { "districtList": [{ "name": "延吉市", "pid": 222400, "id": 222401 }, { "name": "图们市", "pid": 222400, "id": 222402 }, { "name": "敦化市", "pid": 222400, "id": 222403 }, { "name": "珲春市", "pid": 222400, "id": 222404 }, { "name": "龙井市", "pid": 222400, "id": 222405 }, { "name": "和龙市", "pid": 222400, "id": 222406 }, { "name": "汪清县", "pid": 222400, "id": 222424 }, { "name": "安图县", "pid": 222400, "id": 222426 }], "name": "延边朝鲜族自治州", "pid": 220000, "id": 222400 }] }, { "name": "黑龙江省", "id": 230000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 230100, "id": 230101 }, { "name": "道里区", "pid": 230100, "id": 230102 }, { "name": "南岗区", "pid": 230100, "id": 230103 }, { "name": "道外区", "pid": 230100, "id": 230104 }, { "name": "平房区", "pid": 230100, "id": 230108 }, { "name": "松北区", "pid": 230100, "id": 230109 }, { "name": "香坊区", "pid": 230100, "id": 230110 }, { "name": "呼兰区", "pid": 230100, "id": 230111 }, { "name": "阿城区", "pid": 230100, "id": 230112 }, { "name": "依兰县", "pid": 230100, "id": 230123 }, { "name": "方正县", "pid": 230100, "id": 230124 }, { "name": "宾县", "pid": 230100, "id": 230125 }, { "name": "巴彦县", "pid": 230100, "id": 230126 }, { "name": "木兰县", "pid": 230100, "id": 230127 }, { "name": "通河县", "pid": 230100, "id": 230128 }, { "name": "延寿县", "pid": 230100, "id": 230129 }, { "name": "双城市", "pid": 230100, "id": 230182 }, { "name": "尚志市", "pid": 230100, "id": 230183 }, { "name": "五常市", "pid": 230100, "id": 230184 }], "name": "哈尔滨市", "pid": 230000, "id": 230100 }, { "districtList": [{ "name": "市辖区", "pid": 230200, "id": 230201 }, { "name": "龙沙区", "pid": 230200, "id": 230202 }, { "name": "建华区", "pid": 230200, "id": 230203 }, { "name": "铁锋区", "pid": 230200, "id": 230204 }, { "name": "昂昂溪区", "pid": 230200, "id": 230205 }, { "name": "富拉尔基区", "pid": 230200, "id": 230206 }, { "name": "碾子山区", "pid": 230200, "id": 230207 }, { "name": "梅里斯达斡尔族区", "pid": 230200, "id": 230208 }, { "name": "龙江县", "pid": 230200, "id": 230221 }, { "name": "依安县", "pid": 230200, "id": 230223 }, { "name": "泰来县", "pid": 230200, "id": 230224 }, { "name": "甘南县", "pid": 230200, "id": 230225 }, { "name": "富裕县", "pid": 230200, "id": 230227 }, { "name": "克山县", "pid": 230200, "id": 230229 }, { "name": "克东县", "pid": 230200, "id": 230230 }, { "name": "拜泉县", "pid": 230200, "id": 230231 }, { "name": "讷河市", "pid": 230200, "id": 230281 }], "name": "齐齐哈尔市", "pid": 230000, "id": 230200 }, { "districtList": [{ "name": "市辖区", "pid": 230300, "id": 230301 }, { "name": "鸡冠区", "pid": 230300, "id": 230302 }, { "name": "恒山区", "pid": 230300, "id": 230303 }, { "name": "滴道区", "pid": 230300, "id": 230304 }, { "name": "梨树区", "pid": 230300, "id": 230305 }, { "name": "城子河区", "pid": 230300, "id": 230306 }, { "name": "麻山区", "pid": 230300, "id": 230307 }, { "name": "鸡东县", "pid": 230300, "id": 230321 }, { "name": "虎林市", "pid": 230300, "id": 230381 }, { "name": "密山市", "pid": 230300, "id": 230382 }], "name": "鸡西市", "pid": 230000, "id": 230300 }, { "districtList": [{ "name": "市辖区", "pid": 230400, "id": 230401 }, { "name": "向阳区", "pid": 230400, "id": 230402 }, { "name": "工农区", "pid": 230400, "id": 230403 }, { "name": "南山区", "pid": 230400, "id": 230404 }, { "name": "兴安区", "pid": 230400, "id": 230405 }, { "name": "东山区", "pid": 230400, "id": 230406 }, { "name": "兴山区", "pid": 230400, "id": 230407 }, { "name": "萝北县", "pid": 230400, "id": 230421 }, { "name": "绥滨县", "pid": 230400, "id": 230422 }], "name": "鹤岗市", "pid": 230000, "id": 230400 }, { "districtList": [{ "name": "市辖区", "pid": 230500, "id": 230501 }, { "name": "尖山区", "pid": 230500, "id": 230502 }, { "name": "岭东区", "pid": 230500, "id": 230503 }, { "name": "四方台区", "pid": 230500, "id": 230505 }, { "name": "宝山区", "pid": 230500, "id": 230506 }, { "name": "集贤县", "pid": 230500, "id": 230521 }, { "name": "友谊县", "pid": 230500, "id": 230522 }, { "name": "宝清县", "pid": 230500, "id": 230523 }, { "name": "饶河县", "pid": 230500, "id": 230524 }], "name": "双鸭山市", "pid": 230000, "id": 230500 }, { "districtList": [{ "name": "市辖区", "pid": 230600, "id": 230601 }, { "name": "萨尔图区", "pid": 230600, "id": 230602 }, { "name": "龙凤区", "pid": 230600, "id": 230603 }, { "name": "让胡路区", "pid": 230600, "id": 230604 }, { "name": "红岗区", "pid": 230600, "id": 230605 }, { "name": "大同区", "pid": 230600, "id": 230606 }, { "name": "肇州县", "pid": 230600, "id": 230621 }, { "name": "肇源县", "pid": 230600, "id": 230622 }, { "name": "林甸县", "pid": 230600, "id": 230623 }, { "name": "杜尔伯特蒙古族自治县", "pid": 230600, "id": 230624 }], "name": "大庆市", "pid": 230000, "id": 230600 }, { "districtList": [{ "name": "市辖区", "pid": 230700, "id": 230701 }, { "name": "伊春区", "pid": 230700, "id": 230702 }, { "name": "南岔区", "pid": 230700, "id": 230703 }, { "name": "友好区", "pid": 230700, "id": 230704 }, { "name": "西林区", "pid": 230700, "id": 230705 }, { "name": "翠峦区", "pid": 230700, "id": 230706 }, { "name": "新青区", "pid": 230700, "id": 230707 }, { "name": "美溪区", "pid": 230700, "id": 230708 }, { "name": "金山屯区", "pid": 230700, "id": 230709 }, { "name": "五营区", "pid": 230700, "id": 230710 }, { "name": "乌马河区", "pid": 230700, "id": 230711 }, { "name": "汤旺河区", "pid": 230700, "id": 230712 }, { "name": "带岭区", "pid": 230700, "id": 230713 }, { "name": "乌伊岭区", "pid": 230700, "id": 230714 }, { "name": "红星区", "pid": 230700, "id": 230715 }, { "name": "上甘岭区", "pid": 230700, "id": 230716 }, { "name": "嘉荫县", "pid": 230700, "id": 230722 }, { "name": "铁力市", "pid": 230700, "id": 230781 }], "name": "伊春市", "pid": 230000, "id": 230700 }, { "districtList": [{ "name": "市辖区", "pid": 230800, "id": 230801 }, { "name": "向阳区", "pid": 230800, "id": 230803 }, { "name": "前进区", "pid": 230800, "id": 230804 }, { "name": "东风区", "pid": 230800, "id": 230805 }, { "name": "郊区", "pid": 230800, "id": 230811 }, { "name": "桦南县", "pid": 230800, "id": 230822 }, { "name": "桦川县", "pid": 230800, "id": 230826 }, { "name": "汤原县", "pid": 230800, "id": 230828 }, { "name": "抚远县", "pid": 230800, "id": 230833 }, { "name": "同江市", "pid": 230800, "id": 230881 }, { "name": "富锦市", "pid": 230800, "id": 230882 }], "name": "佳木斯市", "pid": 230000, "id": 230800 }, { "districtList": [{ "name": "市辖区", "pid": 230900, "id": 230901 }, { "name": "新兴区", "pid": 230900, "id": 230902 }, { "name": "桃山区", "pid": 230900, "id": 230903 }, { "name": "茄子河区", "pid": 230900, "id": 230904 }, { "name": "勃利县", "pid": 230900, "id": 230921 }], "name": "七台河市", "pid": 230000, "id": 230900 }, { "districtList": [{ "name": "市辖区", "pid": 231000, "id": 231001 }, { "name": "东安区", "pid": 231000, "id": 231002 }, { "name": "阳明区", "pid": 231000, "id": 231003 }, { "name": "爱民区", "pid": 231000, "id": 231004 }, { "name": "西安区", "pid": 231000, "id": 231005 }, { "name": "东宁县", "pid": 231000, "id": 231024 }, { "name": "林口县", "pid": 231000, "id": 231025 }, { "name": "绥芬河市", "pid": 231000, "id": 231081 }, { "name": "海林市", "pid": 231000, "id": 231083 }, { "name": "宁安市", "pid": 231000, "id": 231084 }, { "name": "穆棱市", "pid": 231000, "id": 231085 }], "name": "牡丹江市", "pid": 230000, "id": 231000 }, { "districtList": [{ "name": "市辖区", "pid": 231100, "id": 231101 }, { "name": "爱辉区", "pid": 231100, "id": 231102 }, { "name": "嫩江县", "pid": 231100, "id": 231121 }, { "name": "逊克县", "pid": 231100, "id": 231123 }, { "name": "孙吴县", "pid": 231100, "id": 231124 }, { "name": "北安市", "pid": 231100, "id": 231181 }, { "name": "五大连池市", "pid": 231100, "id": 231182 }], "name": "黑河市", "pid": 230000, "id": 231100 }, { "districtList": [{ "name": "市辖区", "pid": 231200, "id": 231201 }, { "name": "北林区", "pid": 231200, "id": 231202 }, { "name": "望奎县", "pid": 231200, "id": 231221 }, { "name": "兰西县", "pid": 231200, "id": 231222 }, { "name": "青冈县", "pid": 231200, "id": 231223 }, { "name": "庆安县", "pid": 231200, "id": 231224 }, { "name": "明水县", "pid": 231200, "id": 231225 }, { "name": "绥棱县", "pid": 231200, "id": 231226 }, { "name": "安达市", "pid": 231200, "id": 231281 }, { "name": "肇东市", "pid": 231200, "id": 231282 }, { "name": "海伦市", "pid": 231200, "id": 231283 }], "name": "绥化市", "pid": 230000, "id": 231200 }, { "districtList": [{ "name": "呼玛县", "pid": 232700, "id": 232721 }, { "name": "塔河县", "pid": 232700, "id": 232722 }, { "name": "漠河县", "pid": 232700, "id": 232723 }], "name": "大兴安岭地区", "pid": 230000, "id": 232700 }] }, { "name": "上海市", "id": 310000, "cityList": [{ "districtList": [], "name": "黄浦区", "pid": 310000, "id": 310101 }, { "districtList": [], "name": "徐汇区", "pid": 310000, "id": 310104 }, { "districtList": [], "name": "长宁区", "pid": 310000, "id": 310105 }, { "districtList": [], "name": "静安区", "pid": 310000, "id": 310106 }, { "districtList": [], "name": "普陀区", "pid": 310000, "id": 310107 }, { "districtList": [], "name": "闸北区", "pid": 310000, "id": 310108 }, { "districtList": [], "name": "虹口区", "pid": 310000, "id": 310109 }, { "districtList": [], "name": "杨浦区", "pid": 310000, "id": 310110 }, { "districtList": [], "name": "闵行区", "pid": 310000, "id": 310112 }, { "districtList": [], "name": "宝山区", "pid": 310000, "id": 310113 }, { "districtList": [], "name": "嘉定区", "pid": 310000, "id": 310114 }, { "districtList": [], "name": "浦东新区", "pid": 310000, "id": 310115 }, { "districtList": [], "name": "金山区", "pid": 310000, "id": 310116 }, { "districtList": [], "name": "松江区", "pid": 310000, "id": 310117 }, { "districtList": [], "name": "青浦区", "pid": 310000, "id": 310118 }, { "districtList": [], "name": "奉贤区", "pid": 310000, "id": 310120 }, { "districtList": [], "name": "崇明县", "pid": 310000, "id": 310230 }] }, { "name": "江苏省", "id": 320000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 320100, "id": 320101 }, { "name": "玄武区", "pid": 320100, "id": 320102 }, { "name": "秦淮区", "pid": 320100, "id": 320104 }, { "name": "建邺区", "pid": 320100, "id": 320105 }, { "name": "鼓楼区", "pid": 320100, "id": 320106 }, { "name": "浦口区", "pid": 320100, "id": 320111 }, { "name": "栖霞区", "pid": 320100, "id": 320113 }, { "name": "雨花台区", "pid": 320100, "id": 320114 }, { "name": "江宁区", "pid": 320100, "id": 320115 }, { "name": "六合区", "pid": 320100, "id": 320116 }, { "name": "溧水区", "pid": 320100, "id": 320117 }, { "name": "高淳区", "pid": 320100, "id": 320118 }], "name": "南京市", "pid": 320000, "id": 320100 }, { "districtList": [{ "name": "市辖区", "pid": 320200, "id": 320201 }, { "name": "崇安区", "pid": 320200, "id": 320202 }, { "name": "南长区", "pid": 320200, "id": 320203 }, { "name": "北塘区", "pid": 320200, "id": 320204 }, { "name": "锡山区", "pid": 320200, "id": 320205 }, { "name": "惠山区", "pid": 320200, "id": 320206 }, { "name": "滨湖区", "pid": 320200, "id": 320211 }, { "name": "江阴市", "pid": 320200, "id": 320281 }, { "name": "宜兴市", "pid": 320200, "id": 320282 }], "name": "无锡市", "pid": 320000, "id": 320200 }, { "districtList": [{ "name": "市辖区", "pid": 320300, "id": 320301 }, { "name": "鼓楼区", "pid": 320300, "id": 320302 }, { "name": "云龙区", "pid": 320300, "id": 320303 }, { "name": "贾汪区", "pid": 320300, "id": 320305 }, { "name": "泉山区", "pid": 320300, "id": 320311 }, { "name": "铜山区", "pid": 320300, "id": 320312 }, { "name": "丰县", "pid": 320300, "id": 320321 }, { "name": "沛县", "pid": 320300, "id": 320322 }, { "name": "睢宁县", "pid": 320300, "id": 320324 }, { "name": "新沂市", "pid": 320300, "id": 320381 }, { "name": "邳州市", "pid": 320300, "id": 320382 }], "name": "徐州市", "pid": 320000, "id": 320300 }, { "districtList": [{ "name": "市辖区", "pid": 320400, "id": 320401 }, { "name": "天宁区", "pid": 320400, "id": 320402 }, { "name": "钟楼区", "pid": 320400, "id": 320404 }, { "name": "戚墅堰区", "pid": 320400, "id": 320405 }, { "name": "新北区", "pid": 320400, "id": 320411 }, { "name": "武进区", "pid": 320400, "id": 320412 }, { "name": "溧阳市", "pid": 320400, "id": 320481 }, { "name": "金坛市", "pid": 320400, "id": 320482 }], "name": "常州市", "pid": 320000, "id": 320400 }, { "districtList": [{ "name": "市辖区", "pid": 320500, "id": 320501 }, { "name": "虎丘区", "pid": 320500, "id": 320505 }, { "name": "吴中区", "pid": 320500, "id": 320506 }, { "name": "相城区", "pid": 320500, "id": 320507 }, { "name": "姑苏区", "pid": 320500, "id": 320508 }, { "name": "吴江区", "pid": 320500, "id": 320509 }, { "name": "常熟市", "pid": 320500, "id": 320581 }, { "name": "张家港市", "pid": 320500, "id": 320582 }, { "name": "昆山市", "pid": 320500, "id": 320583 }, { "name": "太仓市", "pid": 320500, "id": 320585 }], "name": "苏州市", "pid": 320000, "id": 320500 }, { "districtList": [{ "name": "市辖区", "pid": 320600, "id": 320601 }, { "name": "崇川区", "pid": 320600, "id": 320602 }, { "name": "港闸区", "pid": 320600, "id": 320611 }, { "name": "通州区", "pid": 320600, "id": 320612 }, { "name": "海安县", "pid": 320600, "id": 320621 }, { "name": "如东县", "pid": 320600, "id": 320623 }, { "name": "启东市", "pid": 320600, "id": 320681 }, { "name": "如皋市", "pid": 320600, "id": 320682 }, { "name": "海门市", "pid": 320600, "id": 320684 }], "name": "南通市", "pid": 320000, "id": 320600 }, { "districtList": [{ "name": "市辖区", "pid": 320700, "id": 320701 }, { "name": "连云区", "pid": 320700, "id": 320703 }, { "name": "新浦区", "pid": 320700, "id": 320705 }, { "name": "海州区", "pid": 320700, "id": 320706 }, { "name": "赣榆县", "pid": 320700, "id": 320721 }, { "name": "东海县", "pid": 320700, "id": 320722 }, { "name": "灌云县", "pid": 320700, "id": 320723 }, { "name": "灌南县", "pid": 320700, "id": 320724 }], "name": "连云港市", "pid": 320000, "id": 320700 }, { "districtList": [{ "name": "市辖区", "pid": 320800, "id": 320801 }, { "name": "清河区", "pid": 320800, "id": 320802 }, { "name": "淮安区", "pid": 320800, "id": 320803 }, { "name": "淮阴区", "pid": 320800, "id": 320804 }, { "name": "清浦区", "pid": 320800, "id": 320811 }, { "name": "涟水县", "pid": 320800, "id": 320826 }, { "name": "洪泽县", "pid": 320800, "id": 320829 }, { "name": "盱眙县", "pid": 320800, "id": 320830 }, { "name": "金湖县", "pid": 320800, "id": 320831 }], "name": "淮安市", "pid": 320000, "id": 320800 }, { "districtList": [{ "name": "市辖区", "pid": 320900, "id": 320901 }, { "name": "亭湖区", "pid": 320900, "id": 320902 }, { "name": "盐都区", "pid": 320900, "id": 320903 }, { "name": "响水县", "pid": 320900, "id": 320921 }, { "name": "滨海县", "pid": 320900, "id": 320922 }, { "name": "阜宁县", "pid": 320900, "id": 320923 }, { "name": "射阳县", "pid": 320900, "id": 320924 }, { "name": "建湖县", "pid": 320900, "id": 320925 }, { "name": "东台市", "pid": 320900, "id": 320981 }, { "name": "大丰市", "pid": 320900, "id": 320982 }], "name": "盐城市", "pid": 320000, "id": 320900 }, { "districtList": [{ "name": "市辖区", "pid": 321000, "id": 321001 }, { "name": "广陵区", "pid": 321000, "id": 321002 }, { "name": "邗江区", "pid": 321000, "id": 321003 }, { "name": "江都区", "pid": 321000, "id": 321012 }, { "name": "宝应县", "pid": 321000, "id": 321023 }, { "name": "仪征市", "pid": 321000, "id": 321081 }, { "name": "高邮市", "pid": 321000, "id": 321084 }], "name": "扬州市", "pid": 320000, "id": 321000 }, { "districtList": [{ "name": "市辖区", "pid": 321100, "id": 321101 }, { "name": "京口区", "pid": 321100, "id": 321102 }, { "name": "润州区", "pid": 321100, "id": 321111 }, { "name": "丹徒区", "pid": 321100, "id": 321112 }, { "name": "丹阳市", "pid": 321100, "id": 321181 }, { "name": "扬中市", "pid": 321100, "id": 321182 }, { "name": "句容市", "pid": 321100, "id": 321183 }], "name": "镇江市", "pid": 320000, "id": 321100 }, { "districtList": [{ "name": "市辖区", "pid": 321200, "id": 321201 }, { "name": "海陵区", "pid": 321200, "id": 321202 }, { "name": "高港区", "pid": 321200, "id": 321203 }, { "name": "姜堰区", "pid": 321200, "id": 321204 }, { "name": "兴化市", "pid": 321200, "id": 321281 }, { "name": "靖江市", "pid": 321200, "id": 321282 }, { "name": "泰兴市", "pid": 321200, "id": 321283 }], "name": "泰州市", "pid": 320000, "id": 321200 }, { "districtList": [{ "name": "市辖区", "pid": 321300, "id": 321301 }, { "name": "宿城区", "pid": 321300, "id": 321302 }, { "name": "宿豫区", "pid": 321300, "id": 321311 }, { "name": "沭阳县", "pid": 321300, "id": 321322 }, { "name": "泗阳县", "pid": 321300, "id": 321323 }, { "name": "泗洪县", "pid": 321300, "id": 321324 }], "name": "宿迁市", "pid": 320000, "id": 321300 }] }, { "name": "浙江省", "id": 330000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 330100, "id": 330101 }, { "name": "上城区", "pid": 330100, "id": 330102 }, { "name": "下城区", "pid": 330100, "id": 330103 }, { "name": "江干区", "pid": 330100, "id": 330104 }, { "name": "拱墅区", "pid": 330100, "id": 330105 }, { "name": "西湖区", "pid": 330100, "id": 330106 }, { "name": "滨江区", "pid": 330100, "id": 330108 }, { "name": "萧山区", "pid": 330100, "id": 330109 }, { "name": "余杭区", "pid": 330100, "id": 330110 }, { "name": "桐庐县", "pid": 330100, "id": 330122 }, { "name": "淳安县", "pid": 330100, "id": 330127 }, { "name": "建德市", "pid": 330100, "id": 330182 }, { "name": "富阳市", "pid": 330100, "id": 330183 }, { "name": "临安市", "pid": 330100, "id": 330185 }], "name": "杭州市", "pid": 330000, "id": 330100 }, { "districtList": [{ "name": "市辖区", "pid": 330200, "id": 330201 }, { "name": "海曙区", "pid": 330200, "id": 330203 }, { "name": "江东区", "pid": 330200, "id": 330204 }, { "name": "江北区", "pid": 330200, "id": 330205 }, { "name": "北仑区", "pid": 330200, "id": 330206 }, { "name": "镇海区", "pid": 330200, "id": 330211 }, { "name": "鄞州区", "pid": 330200, "id": 330212 }, { "name": "象山县", "pid": 330200, "id": 330225 }, { "name": "宁海县", "pid": 330200, "id": 330226 }, { "name": "余姚市", "pid": 330200, "id": 330281 }, { "name": "慈溪市", "pid": 330200, "id": 330282 }, { "name": "奉化市", "pid": 330200, "id": 330283 }], "name": "宁波市", "pid": 330000, "id": 330200 }, { "districtList": [{ "name": "市辖区", "pid": 330300, "id": 330301 }, { "name": "鹿城区", "pid": 330300, "id": 330302 }, { "name": "龙湾区", "pid": 330300, "id": 330303 }, { "name": "瓯海区", "pid": 330300, "id": 330304 }, { "name": "洞头县", "pid": 330300, "id": 330322 }, { "name": "永嘉县", "pid": 330300, "id": 330324 }, { "name": "平阳县", "pid": 330300, "id": 330326 }, { "name": "苍南县", "pid": 330300, "id": 330327 }, { "name": "文成县", "pid": 330300, "id": 330328 }, { "name": "泰顺县", "pid": 330300, "id": 330329 }, { "name": "瑞安市", "pid": 330300, "id": 330381 }, { "name": "乐清市", "pid": 330300, "id": 330382 }], "name": "温州市", "pid": 330000, "id": 330300 }, { "districtList": [{ "name": "市辖区", "pid": 330400, "id": 330401 }, { "name": "南湖区", "pid": 330400, "id": 330402 }, { "name": "秀洲区", "pid": 330400, "id": 330411 }, { "name": "嘉善县", "pid": 330400, "id": 330421 }, { "name": "海盐县", "pid": 330400, "id": 330424 }, { "name": "海宁市", "pid": 330400, "id": 330481 }, { "name": "平湖市", "pid": 330400, "id": 330482 }, { "name": "桐乡市", "pid": 330400, "id": 330483 }], "name": "嘉兴市", "pid": 330000, "id": 330400 }, { "districtList": [{ "name": "市辖区", "pid": 330500, "id": 330501 }, { "name": "吴兴区", "pid": 330500, "id": 330502 }, { "name": "南浔区", "pid": 330500, "id": 330503 }, { "name": "德清县", "pid": 330500, "id": 330521 }, { "name": "长兴县", "pid": 330500, "id": 330522 }, { "name": "安吉县", "pid": 330500, "id": 330523 }], "name": "湖州市", "pid": 330000, "id": 330500 }, { "districtList": [{ "name": "市辖区", "pid": 330600, "id": 330601 }, { "name": "越城区", "pid": 330600, "id": 330602 }, { "name": "绍兴县", "pid": 330600, "id": 330621 }, { "name": "新昌县", "pid": 330600, "id": 330624 }, { "name": "诸暨市", "pid": 330600, "id": 330681 }, { "name": "上虞市", "pid": 330600, "id": 330682 }, { "name": "嵊州市", "pid": 330600, "id": 330683 }], "name": "绍兴市", "pid": 330000, "id": 330600 }, { "districtList": [{ "name": "市辖区", "pid": 330700, "id": 330701 }, { "name": "婺城区", "pid": 330700, "id": 330702 }, { "name": "金东区", "pid": 330700, "id": 330703 }, { "name": "武义县", "pid": 330700, "id": 330723 }, { "name": "浦江县", "pid": 330700, "id": 330726 }, { "name": "磐安县", "pid": 330700, "id": 330727 }, { "name": "兰溪市", "pid": 330700, "id": 330781 }, { "name": "义乌市", "pid": 330700, "id": 330782 }, { "name": "东阳市", "pid": 330700, "id": 330783 }, { "name": "永康市", "pid": 330700, "id": 330784 }], "name": "金华市", "pid": 330000, "id": 330700 }, { "districtList": [{ "name": "市辖区", "pid": 330800, "id": 330801 }, { "name": "柯城区", "pid": 330800, "id": 330802 }, { "name": "衢江区", "pid": 330800, "id": 330803 }, { "name": "常山县", "pid": 330800, "id": 330822 }, { "name": "开化县", "pid": 330800, "id": 330824 }, { "name": "龙游县", "pid": 330800, "id": 330825 }, { "name": "江山市", "pid": 330800, "id": 330881 }], "name": "衢州市", "pid": 330000, "id": 330800 }, { "districtList": [{ "name": "市辖区", "pid": 330900, "id": 330901 }, { "name": "定海区", "pid": 330900, "id": 330902 }, { "name": "普陀区", "pid": 330900, "id": 330903 }, { "name": "岱山县", "pid": 330900, "id": 330921 }, { "name": "嵊泗县", "pid": 330900, "id": 330922 }], "name": "舟山市", "pid": 330000, "id": 330900 }, { "districtList": [{ "name": "市辖区", "pid": 331000, "id": 331001 }, { "name": "椒江区", "pid": 331000, "id": 331002 }, { "name": "黄岩区", "pid": 331000, "id": 331003 }, { "name": "路桥区", "pid": 331000, "id": 331004 }, { "name": "玉环县", "pid": 331000, "id": 331021 }, { "name": "三门县", "pid": 331000, "id": 331022 }, { "name": "天台县", "pid": 331000, "id": 331023 }, { "name": "仙居县", "pid": 331000, "id": 331024 }, { "name": "温岭市", "pid": 331000, "id": 331081 }, { "name": "临海市", "pid": 331000, "id": 331082 }], "name": "台州市", "pid": 330000, "id": 331000 }, { "districtList": [{ "name": "市辖区", "pid": 331100, "id": 331101 }, { "name": "莲都区", "pid": 331100, "id": 331102 }, { "name": "青田县", "pid": 331100, "id": 331121 }, { "name": "缙云县", "pid": 331100, "id": 331122 }, { "name": "遂昌县", "pid": 331100, "id": 331123 }, { "name": "松阳县", "pid": 331100, "id": 331124 }, { "name": "云和县", "pid": 331100, "id": 331125 }, { "name": "庆元县", "pid": 331100, "id": 331126 }, { "name": "景宁畲族自治县", "pid": 331100, "id": 331127 }, { "name": "龙泉市", "pid": 331100, "id": 331181 }], "name": "丽水市", "pid": 330000, "id": 331100 }] }, { "name": "安徽省", "id": 340000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 340100, "id": 340101 }, { "name": "瑶海区", "pid": 340100, "id": 340102 }, { "name": "庐阳区", "pid": 340100, "id": 340103 }, { "name": "蜀山区", "pid": 340100, "id": 340104 }, { "name": "包河区", "pid": 340100, "id": 340111 }, { "name": "长丰县", "pid": 340100, "id": 340121 }, { "name": "肥东县", "pid": 340100, "id": 340122 }, { "name": "肥西县", "pid": 340100, "id": 340123 }, { "name": "庐江县", "pid": 340100, "id": 340124 }, { "name": "巢湖市", "pid": 340100, "id": 340181 }], "name": "合肥市", "pid": 340000, "id": 340100 }, { "districtList": [{ "name": "市辖区", "pid": 340200, "id": 340201 }, { "name": "镜湖区", "pid": 340200, "id": 340202 }, { "name": "弋江区", "pid": 340200, "id": 340203 }, { "name": "鸠江区", "pid": 340200, "id": 340207 }, { "name": "三山区", "pid": 340200, "id": 340208 }, { "name": "芜湖县", "pid": 340200, "id": 340221 }, { "name": "繁昌县", "pid": 340200, "id": 340222 }, { "name": "南陵县", "pid": 340200, "id": 340223 }, { "name": "无为县", "pid": 340200, "id": 340225 }], "name": "芜湖市", "pid": 340000, "id": 340200 }, { "districtList": [{ "name": "市辖区", "pid": 340300, "id": 340301 }, { "name": "龙子湖区", "pid": 340300, "id": 340302 }, { "name": "蚌山区", "pid": 340300, "id": 340303 }, { "name": "禹会区", "pid": 340300, "id": 340304 }, { "name": "淮上区", "pid": 340300, "id": 340311 }, { "name": "怀远县", "pid": 340300, "id": 340321 }, { "name": "五河县", "pid": 340300, "id": 340322 }, { "name": "固镇县", "pid": 340300, "id": 340323 }], "name": "蚌埠市", "pid": 340000, "id": 340300 }, { "districtList": [{ "name": "市辖区", "pid": 340400, "id": 340401 }, { "name": "大通区", "pid": 340400, "id": 340402 }, { "name": "田家庵区", "pid": 340400, "id": 340403 }, { "name": "谢家集区", "pid": 340400, "id": 340404 }, { "name": "八公山区", "pid": 340400, "id": 340405 }, { "name": "潘集区", "pid": 340400, "id": 340406 }, { "name": "凤台县", "pid": 340400, "id": 340421 }], "name": "淮南市", "pid": 340000, "id": 340400 }, { "districtList": [{ "name": "市辖区", "pid": 340500, "id": 340501 }, { "name": "花山区", "pid": 340500, "id": 340503 }, { "name": "雨山区", "pid": 340500, "id": 340504 }, { "name": "博望区", "pid": 340500, "id": 340506 }, { "name": "当涂县", "pid": 340500, "id": 340521 }, { "name": "含山县", "pid": 340500, "id": 340522 }, { "name": "和县", "pid": 340500, "id": 340523 }], "name": "马鞍山市", "pid": 340000, "id": 340500 }, { "districtList": [{ "name": "市辖区", "pid": 340600, "id": 340601 }, { "name": "杜集区", "pid": 340600, "id": 340602 }, { "name": "相山区", "pid": 340600, "id": 340603 }, { "name": "烈山区", "pid": 340600, "id": 340604 }, { "name": "濉溪县", "pid": 340600, "id": 340621 }], "name": "淮北市", "pid": 340000, "id": 340600 }, { "districtList": [{ "name": "市辖区", "pid": 340700, "id": 340701 }, { "name": "铜官山区", "pid": 340700, "id": 340702 }, { "name": "狮子山区", "pid": 340700, "id": 340703 }, { "name": "郊区", "pid": 340700, "id": 340711 }, { "name": "铜陵县", "pid": 340700, "id": 340721 }], "name": "铜陵市", "pid": 340000, "id": 340700 }, { "districtList": [{ "name": "市辖区", "pid": 340800, "id": 340801 }, { "name": "迎江区", "pid": 340800, "id": 340802 }, { "name": "大观区", "pid": 340800, "id": 340803 }, { "name": "宜秀区", "pid": 340800, "id": 340811 }, { "name": "怀宁县", "pid": 340800, "id": 340822 }, { "name": "枞阳县", "pid": 340800, "id": 340823 }, { "name": "潜山县", "pid": 340800, "id": 340824 }, { "name": "太湖县", "pid": 340800, "id": 340825 }, { "name": "宿松县", "pid": 340800, "id": 340826 }, { "name": "望江县", "pid": 340800, "id": 340827 }, { "name": "岳西县", "pid": 340800, "id": 340828 }, { "name": "桐城市", "pid": 340800, "id": 340881 }], "name": "安庆市", "pid": 340000, "id": 340800 }, { "districtList": [{ "name": "市辖区", "pid": 341000, "id": 341001 }, { "name": "屯溪区", "pid": 341000, "id": 341002 }, { "name": "黄山区", "pid": 341000, "id": 341003 }, { "name": "徽州区", "pid": 341000, "id": 341004 }, { "name": "歙县", "pid": 341000, "id": 341021 }, { "name": "休宁县", "pid": 341000, "id": 341022 }, { "name": "黟县", "pid": 341000, "id": 341023 }, { "name": "祁门县", "pid": 341000, "id": 341024 }], "name": "黄山市", "pid": 340000, "id": 341000 }, { "districtList": [{ "name": "市辖区", "pid": 341100, "id": 341101 }, { "name": "琅琊区", "pid": 341100, "id": 341102 }, { "name": "南谯区", "pid": 341100, "id": 341103 }, { "name": "来安县", "pid": 341100, "id": 341122 }, { "name": "全椒县", "pid": 341100, "id": 341124 }, { "name": "定远县", "pid": 341100, "id": 341125 }, { "name": "凤阳县", "pid": 341100, "id": 341126 }, { "name": "天长市", "pid": 341100, "id": 341181 }, { "name": "明光市", "pid": 341100, "id": 341182 }], "name": "滁州市", "pid": 340000, "id": 341100 }, { "districtList": [{ "name": "市辖区", "pid": 341200, "id": 341201 }, { "name": "颍州区", "pid": 341200, "id": 341202 }, { "name": "颍东区", "pid": 341200, "id": 341203 }, { "name": "颍泉区", "pid": 341200, "id": 341204 }, { "name": "临泉县", "pid": 341200, "id": 341221 }, { "name": "太和县", "pid": 341200, "id": 341222 }, { "name": "阜南县", "pid": 341200, "id": 341225 }, { "name": "颍上县", "pid": 341200, "id": 341226 }, { "name": "界首市", "pid": 341200, "id": 341282 }], "name": "阜阳市", "pid": 340000, "id": 341200 }, { "districtList": [{ "name": "市辖区", "pid": 341300, "id": 341301 }, { "name": "埇桥区", "pid": 341300, "id": 341302 }, { "name": "砀山县", "pid": 341300, "id": 341321 }, { "name": "萧县", "pid": 341300, "id": 341322 }, { "name": "灵璧县", "pid": 341300, "id": 341323 }, { "name": "泗县", "pid": 341300, "id": 341324 }], "name": "宿州市", "pid": 340000, "id": 341300 }, { "districtList": [{ "name": "市辖区", "pid": 341500, "id": 341501 }, { "name": "金安区", "pid": 341500, "id": 341502 }, { "name": "裕安区", "pid": 341500, "id": 341503 }, { "name": "寿县", "pid": 341500, "id": 341521 }, { "name": "霍邱县", "pid": 341500, "id": 341522 }, { "name": "舒城县", "pid": 341500, "id": 341523 }, { "name": "金寨县", "pid": 341500, "id": 341524 }, { "name": "霍山县", "pid": 341500, "id": 341525 }], "name": "六安市", "pid": 340000, "id": 341500 }, { "districtList": [{ "name": "市辖区", "pid": 341600, "id": 341601 }, { "name": "谯城区", "pid": 341600, "id": 341602 }, { "name": "涡阳县", "pid": 341600, "id": 341621 }, { "name": "蒙城县", "pid": 341600, "id": 341622 }, { "name": "利辛县", "pid": 341600, "id": 341623 }], "name": "亳州市", "pid": 340000, "id": 341600 }, { "districtList": [{ "name": "市辖区", "pid": 341700, "id": 341701 }, { "name": "贵池区", "pid": 341700, "id": 341702 }, { "name": "东至县", "pid": 341700, "id": 341721 }, { "name": "石台县", "pid": 341700, "id": 341722 }, { "name": "青阳县", "pid": 341700, "id": 341723 }], "name": "池州市", "pid": 340000, "id": 341700 }, { "districtList": [{ "name": "市辖区", "pid": 341800, "id": 341801 }, { "name": "宣州区", "pid": 341800, "id": 341802 }, { "name": "郎溪县", "pid": 341800, "id": 341821 }, { "name": "广德县", "pid": 341800, "id": 341822 }, { "name": "泾县", "pid": 341800, "id": 341823 }, { "name": "绩溪县", "pid": 341800, "id": 341824 }, { "name": "旌德县", "pid": 341800, "id": 341825 }, { "name": "宁国市", "pid": 341800, "id": 341881 }], "name": "宣城市", "pid": 340000, "id": 341800 }] }, { "name": "福建省", "id": 350000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 350100, "id": 350101 }, { "name": "鼓楼区", "pid": 350100, "id": 350102 }, { "name": "台江区", "pid": 350100, "id": 350103 }, { "name": "仓山区", "pid": 350100, "id": 350104 }, { "name": "马尾区", "pid": 350100, "id": 350105 }, { "name": "晋安区", "pid": 350100, "id": 350111 }, { "name": "闽侯县", "pid": 350100, "id": 350121 }, { "name": "连江县", "pid": 350100, "id": 350122 }, { "name": "罗源县", "pid": 350100, "id": 350123 }, { "name": "闽清县", "pid": 350100, "id": 350124 }, { "name": "永泰县", "pid": 350100, "id": 350125 }, { "name": "平潭县", "pid": 350100, "id": 350128 }, { "name": "福清市", "pid": 350100, "id": 350181 }, { "name": "长乐市", "pid": 350100, "id": 350182 }], "name": "福州市", "pid": 350000, "id": 350100 }, { "districtList": [{ "name": "市辖区", "pid": 350200, "id": 350201 }, { "name": "思明区", "pid": 350200, "id": 350203 }, { "name": "海沧区", "pid": 350200, "id": 350205 }, { "name": "湖里区", "pid": 350200, "id": 350206 }, { "name": "集美区", "pid": 350200, "id": 350211 }, { "name": "同安区", "pid": 350200, "id": 350212 }, { "name": "翔安区", "pid": 350200, "id": 350213 }], "name": "厦门市", "pid": 350000, "id": 350200 }, { "districtList": [{ "name": "市辖区", "pid": 350300, "id": 350301 }, { "name": "城厢区", "pid": 350300, "id": 350302 }, { "name": "涵江区", "pid": 350300, "id": 350303 }, { "name": "荔城区", "pid": 350300, "id": 350304 }, { "name": "秀屿区", "pid": 350300, "id": 350305 }, { "name": "仙游县", "pid": 350300, "id": 350322 }], "name": "莆田市", "pid": 350000, "id": 350300 }, { "districtList": [{ "name": "市辖区", "pid": 350400, "id": 350401 }, { "name": "梅列区", "pid": 350400, "id": 350402 }, { "name": "三元区", "pid": 350400, "id": 350403 }, { "name": "明溪县", "pid": 350400, "id": 350421 }, { "name": "清流县", "pid": 350400, "id": 350423 }, { "name": "宁化县", "pid": 350400, "id": 350424 }, { "name": "大田县", "pid": 350400, "id": 350425 }, { "name": "尤溪县", "pid": 350400, "id": 350426 }, { "name": "沙县", "pid": 350400, "id": 350427 }, { "name": "将乐县", "pid": 350400, "id": 350428 }, { "name": "泰宁县", "pid": 350400, "id": 350429 }, { "name": "建宁县", "pid": 350400, "id": 350430 }, { "name": "永安市", "pid": 350400, "id": 350481 }], "name": "三明市", "pid": 350000, "id": 350400 }, { "districtList": [{ "name": "市辖区", "pid": 350500, "id": 350501 }, { "name": "鲤城区", "pid": 350500, "id": 350502 }, { "name": "丰泽区", "pid": 350500, "id": 350503 }, { "name": "洛江区", "pid": 350500, "id": 350504 }, { "name": "泉港区", "pid": 350500, "id": 350505 }, { "name": "惠安县", "pid": 350500, "id": 350521 }, { "name": "安溪县", "pid": 350500, "id": 350524 }, { "name": "永春县", "pid": 350500, "id": 350525 }, { "name": "德化县", "pid": 350500, "id": 350526 }, { "name": "金门县", "pid": 350500, "id": 350527 }, { "name": "石狮市", "pid": 350500, "id": 350581 }, { "name": "晋江市", "pid": 350500, "id": 350582 }, { "name": "南安市", "pid": 350500, "id": 350583 }], "name": "泉州市", "pid": 350000, "id": 350500 }, { "districtList": [{ "name": "市辖区", "pid": 350600, "id": 350601 }, { "name": "芗城区", "pid": 350600, "id": 350602 }, { "name": "龙文区", "pid": 350600, "id": 350603 }, { "name": "云霄县", "pid": 350600, "id": 350622 }, { "name": "漳浦县", "pid": 350600, "id": 350623 }, { "name": "诏安县", "pid": 350600, "id": 350624 }, { "name": "长泰县", "pid": 350600, "id": 350625 }, { "name": "东山县", "pid": 350600, "id": 350626 }, { "name": "南靖县", "pid": 350600, "id": 350627 }, { "name": "平和县", "pid": 350600, "id": 350628 }, { "name": "华安县", "pid": 350600, "id": 350629 }, { "name": "龙海市", "pid": 350600, "id": 350681 }], "name": "漳州市", "pid": 350000, "id": 350600 }, { "districtList": [{ "name": "市辖区", "pid": 350700, "id": 350701 }, { "name": "延平区", "pid": 350700, "id": 350702 }, { "name": "顺昌县", "pid": 350700, "id": 350721 }, { "name": "浦城县", "pid": 350700, "id": 350722 }, { "name": "光泽县", "pid": 350700, "id": 350723 }, { "name": "松溪县", "pid": 350700, "id": 350724 }, { "name": "政和县", "pid": 350700, "id": 350725 }, { "name": "邵武市", "pid": 350700, "id": 350781 }, { "name": "武夷山市", "pid": 350700, "id": 350782 }, { "name": "建瓯市", "pid": 350700, "id": 350783 }, { "name": "建阳市", "pid": 350700, "id": 350784 }], "name": "南平市", "pid": 350000, "id": 350700 }, { "districtList": [{ "name": "市辖区", "pid": 350800, "id": 350801 }, { "name": "新罗区", "pid": 350800, "id": 350802 }, { "name": "长汀县", "pid": 350800, "id": 350821 }, { "name": "永定县", "pid": 350800, "id": 350822 }, { "name": "上杭县", "pid": 350800, "id": 350823 }, { "name": "武平县", "pid": 350800, "id": 350824 }, { "name": "连城县", "pid": 350800, "id": 350825 }, { "name": "漳平市", "pid": 350800, "id": 350881 }], "name": "龙岩市", "pid": 350000, "id": 350800 }, { "districtList": [{ "name": "市辖区", "pid": 350900, "id": 350901 }, { "name": "蕉城区", "pid": 350900, "id": 350902 }, { "name": "霞浦县", "pid": 350900, "id": 350921 }, { "name": "古田县", "pid": 350900, "id": 350922 }, { "name": "屏南县", "pid": 350900, "id": 350923 }, { "name": "寿宁县", "pid": 350900, "id": 350924 }, { "name": "周宁县", "pid": 350900, "id": 350925 }, { "name": "柘荣县", "pid": 350900, "id": 350926 }, { "name": "福安市", "pid": 350900, "id": 350981 }, { "name": "福鼎市", "pid": 350900, "id": 350982 }], "name": "宁德市", "pid": 350000, "id": 350900 }] }, { "name": "江西省", "id": 360000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 360100, "id": 360101 }, { "name": "东湖区", "pid": 360100, "id": 360102 }, { "name": "西湖区", "pid": 360100, "id": 360103 }, { "name": "青云谱区", "pid": 360100, "id": 360104 }, { "name": "湾里区", "pid": 360100, "id": 360105 }, { "name": "青山湖区", "pid": 360100, "id": 360111 }, { "name": "南昌县", "pid": 360100, "id": 360121 }, { "name": "新建县", "pid": 360100, "id": 360122 }, { "name": "安义县", "pid": 360100, "id": 360123 }, { "name": "进贤县", "pid": 360100, "id": 360124 }], "name": "南昌市", "pid": 360000, "id": 360100 }, { "districtList": [{ "name": "市辖区", "pid": 360200, "id": 360201 }, { "name": "昌江区", "pid": 360200, "id": 360202 }, { "name": "珠山区", "pid": 360200, "id": 360203 }, { "name": "浮梁县", "pid": 360200, "id": 360222 }, { "name": "乐平市", "pid": 360200, "id": 360281 }], "name": "景德镇市", "pid": 360000, "id": 360200 }, { "districtList": [{ "name": "市辖区", "pid": 360300, "id": 360301 }, { "name": "安源区", "pid": 360300, "id": 360302 }, { "name": "湘东区", "pid": 360300, "id": 360313 }, { "name": "莲花县", "pid": 360300, "id": 360321 }, { "name": "上栗县", "pid": 360300, "id": 360322 }, { "name": "芦溪县", "pid": 360300, "id": 360323 }], "name": "萍乡市", "pid": 360000, "id": 360300 }, { "districtList": [{ "name": "市辖区", "pid": 360400, "id": 360401 }, { "name": "庐山区", "pid": 360400, "id": 360402 }, { "name": "浔阳区", "pid": 360400, "id": 360403 }, { "name": "九江县", "pid": 360400, "id": 360421 }, { "name": "武宁县", "pid": 360400, "id": 360423 }, { "name": "修水县", "pid": 360400, "id": 360424 }, { "name": "永修县", "pid": 360400, "id": 360425 }, { "name": "德安县", "pid": 360400, "id": 360426 }, { "name": "星子县", "pid": 360400, "id": 360427 }, { "name": "都昌县", "pid": 360400, "id": 360428 }, { "name": "湖口县", "pid": 360400, "id": 360429 }, { "name": "彭泽县", "pid": 360400, "id": 360430 }, { "name": "瑞昌市", "pid": 360400, "id": 360481 }, { "name": "共青城市", "pid": 360400, "id": 360482 }], "name": "九江市", "pid": 360000, "id": 360400 }, { "districtList": [{ "name": "市辖区", "pid": 360500, "id": 360501 }, { "name": "渝水区", "pid": 360500, "id": 360502 }, { "name": "分宜县", "pid": 360500, "id": 360521 }], "name": "新余市", "pid": 360000, "id": 360500 }, { "districtList": [{ "name": "市辖区", "pid": 360600, "id": 360601 }, { "name": "月湖区", "pid": 360600, "id": 360602 }, { "name": "余江县", "pid": 360600, "id": 360622 }, { "name": "贵溪市", "pid": 360600, "id": 360681 }], "name": "鹰潭市", "pid": 360000, "id": 360600 }, { "districtList": [{ "name": "市辖区", "pid": 360700, "id": 360701 }, { "name": "章贡区", "pid": 360700, "id": 360702 }, { "name": "赣县", "pid": 360700, "id": 360721 }, { "name": "信丰县", "pid": 360700, "id": 360722 }, { "name": "大余县", "pid": 360700, "id": 360723 }, { "name": "上犹县", "pid": 360700, "id": 360724 }, { "name": "崇义县", "pid": 360700, "id": 360725 }, { "name": "安远县", "pid": 360700, "id": 360726 }, { "name": "龙南县", "pid": 360700, "id": 360727 }, { "name": "定南县", "pid": 360700, "id": 360728 }, { "name": "全南县", "pid": 360700, "id": 360729 }, { "name": "宁都县", "pid": 360700, "id": 360730 }, { "name": "于都县", "pid": 360700, "id": 360731 }, { "name": "兴国县", "pid": 360700, "id": 360732 }, { "name": "会昌县", "pid": 360700, "id": 360733 }, { "name": "寻乌县", "pid": 360700, "id": 360734 }, { "name": "石城县", "pid": 360700, "id": 360735 }, { "name": "瑞金市", "pid": 360700, "id": 360781 }, { "name": "南康市", "pid": 360700, "id": 360782 }], "name": "赣州市", "pid": 360000, "id": 360700 }, { "districtList": [{ "name": "市辖区", "pid": 360800, "id": 360801 }, { "name": "吉州区", "pid": 360800, "id": 360802 }, { "name": "青原区", "pid": 360800, "id": 360803 }, { "name": "吉安县", "pid": 360800, "id": 360821 }, { "name": "吉水县", "pid": 360800, "id": 360822 }, { "name": "峡江县", "pid": 360800, "id": 360823 }, { "name": "新干县", "pid": 360800, "id": 360824 }, { "name": "永丰县", "pid": 360800, "id": 360825 }, { "name": "泰和县", "pid": 360800, "id": 360826 }, { "name": "遂川县", "pid": 360800, "id": 360827 }, { "name": "万安县", "pid": 360800, "id": 360828 }, { "name": "安福县", "pid": 360800, "id": 360829 }, { "name": "永新县", "pid": 360800, "id": 360830 }, { "name": "井冈山市", "pid": 360800, "id": 360881 }], "name": "吉安市", "pid": 360000, "id": 360800 }, { "districtList": [{ "name": "市辖区", "pid": 360900, "id": 360901 }, { "name": "袁州区", "pid": 360900, "id": 360902 }, { "name": "奉新县", "pid": 360900, "id": 360921 }, { "name": "万载县", "pid": 360900, "id": 360922 }, { "name": "上高县", "pid": 360900, "id": 360923 }, { "name": "宜丰县", "pid": 360900, "id": 360924 }, { "name": "靖安县", "pid": 360900, "id": 360925 }, { "name": "铜鼓县", "pid": 360900, "id": 360926 }, { "name": "丰城市", "pid": 360900, "id": 360981 }, { "name": "樟树市", "pid": 360900, "id": 360982 }, { "name": "高安市", "pid": 360900, "id": 360983 }], "name": "宜春市", "pid": 360000, "id": 360900 }, { "districtList": [{ "name": "市辖区", "pid": 361000, "id": 361001 }, { "name": "临川区", "pid": 361000, "id": 361002 }, { "name": "南城县", "pid": 361000, "id": 361021 }, { "name": "黎川县", "pid": 361000, "id": 361022 }, { "name": "南丰县", "pid": 361000, "id": 361023 }, { "name": "崇仁县", "pid": 361000, "id": 361024 }, { "name": "乐安县", "pid": 361000, "id": 361025 }, { "name": "宜黄县", "pid": 361000, "id": 361026 }, { "name": "金溪县", "pid": 361000, "id": 361027 }, { "name": "资溪县", "pid": 361000, "id": 361028 }, { "name": "东乡县", "pid": 361000, "id": 361029 }, { "name": "广昌县", "pid": 361000, "id": 361030 }], "name": "抚州市", "pid": 360000, "id": 361000 }, { "districtList": [{ "name": "市辖区", "pid": 361100, "id": 361101 }, { "name": "信州区", "pid": 361100, "id": 361102 }, { "name": "上饶县", "pid": 361100, "id": 361121 }, { "name": "广丰县", "pid": 361100, "id": 361122 }, { "name": "玉山县", "pid": 361100, "id": 361123 }, { "name": "铅山县", "pid": 361100, "id": 361124 }, { "name": "横峰县", "pid": 361100, "id": 361125 }, { "name": "弋阳县", "pid": 361100, "id": 361126 }, { "name": "余干县", "pid": 361100, "id": 361127 }, { "name": "鄱阳县", "pid": 361100, "id": 361128 }, { "name": "万年县", "pid": 361100, "id": 361129 }, { "name": "婺源县", "pid": 361100, "id": 361130 }, { "name": "德兴市", "pid": 361100, "id": 361181 }], "name": "上饶市", "pid": 360000, "id": 361100 }] }, { "name": "山东省", "id": 370000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 370100, "id": 370101 }, { "name": "历下区", "pid": 370100, "id": 370102 }, { "name": "市中区", "pid": 370100, "id": 370103 }, { "name": "槐荫区", "pid": 370100, "id": 370104 }, { "name": "天桥区", "pid": 370100, "id": 370105 }, { "name": "历城区", "pid": 370100, "id": 370112 }, { "name": "长清区", "pid": 370100, "id": 370113 }, { "name": "平阴县", "pid": 370100, "id": 370124 }, { "name": "济阳县", "pid": 370100, "id": 370125 }, { "name": "商河县", "pid": 370100, "id": 370126 }, { "name": "章丘市", "pid": 370100, "id": 370181 }], "name": "济南市", "pid": 370000, "id": 370100 }, { "districtList": [{ "name": "市辖区", "pid": 370200, "id": 370201 }, { "name": "市南区", "pid": 370200, "id": 370202 }, { "name": "市北区", "pid": 370200, "id": 370203 }, { "name": "黄岛区", "pid": 370200, "id": 370211 }, { "name": "崂山区", "pid": 370200, "id": 370212 }, { "name": "李沧区", "pid": 370200, "id": 370213 }, { "name": "城阳区", "pid": 370200, "id": 370214 }, { "name": "胶州市", "pid": 370200, "id": 370281 }, { "name": "即墨市", "pid": 370200, "id": 370282 }, { "name": "平度市", "pid": 370200, "id": 370283 }, { "name": "莱西市", "pid": 370200, "id": 370285 }], "name": "青岛市", "pid": 370000, "id": 370200 }, { "districtList": [{ "name": "市辖区", "pid": 370300, "id": 370301 }, { "name": "淄川区", "pid": 370300, "id": 370302 }, { "name": "张店区", "pid": 370300, "id": 370303 }, { "name": "博山区", "pid": 370300, "id": 370304 }, { "name": "临淄区", "pid": 370300, "id": 370305 }, { "name": "周村区", "pid": 370300, "id": 370306 }, { "name": "桓台县", "pid": 370300, "id": 370321 }, { "name": "高青县", "pid": 370300, "id": 370322 }, { "name": "沂源县", "pid": 370300, "id": 370323 }], "name": "淄博市", "pid": 370000, "id": 370300 }, { "districtList": [{ "name": "市辖区", "pid": 370400, "id": 370401 }, { "name": "市中区", "pid": 370400, "id": 370402 }, { "name": "薛城区", "pid": 370400, "id": 370403 }, { "name": "峄城区", "pid": 370400, "id": 370404 }, { "name": "台儿庄区", "pid": 370400, "id": 370405 }, { "name": "山亭区", "pid": 370400, "id": 370406 }, { "name": "滕州市", "pid": 370400, "id": 370481 }], "name": "枣庄市", "pid": 370000, "id": 370400 }, { "districtList": [{ "name": "市辖区", "pid": 370500, "id": 370501 }, { "name": "东营区", "pid": 370500, "id": 370502 }, { "name": "河口区", "pid": 370500, "id": 370503 }, { "name": "垦利县", "pid": 370500, "id": 370521 }, { "name": "利津县", "pid": 370500, "id": 370522 }, { "name": "广饶县", "pid": 370500, "id": 370523 }], "name": "东营市", "pid": 370000, "id": 370500 }, { "districtList": [{ "name": "市辖区", "pid": 370600, "id": 370601 }, { "name": "芝罘区", "pid": 370600, "id": 370602 }, { "name": "福山区", "pid": 370600, "id": 370611 }, { "name": "牟平区", "pid": 370600, "id": 370612 }, { "name": "莱山区", "pid": 370600, "id": 370613 }, { "name": "长岛县", "pid": 370600, "id": 370634 }, { "name": "龙口市", "pid": 370600, "id": 370681 }, { "name": "莱阳市", "pid": 370600, "id": 370682 }, { "name": "莱州市", "pid": 370600, "id": 370683 }, { "name": "蓬莱市", "pid": 370600, "id": 370684 }, { "name": "招远市", "pid": 370600, "id": 370685 }, { "name": "栖霞市", "pid": 370600, "id": 370686 }, { "name": "海阳市", "pid": 370600, "id": 370687 }], "name": "烟台市", "pid": 370000, "id": 370600 }, { "districtList": [{ "name": "市辖区", "pid": 370700, "id": 370701 }, { "name": "潍城区", "pid": 370700, "id": 370702 }, { "name": "寒亭区", "pid": 370700, "id": 370703 }, { "name": "坊子区", "pid": 370700, "id": 370704 }, { "name": "奎文区", "pid": 370700, "id": 370705 }, { "name": "临朐县", "pid": 370700, "id": 370724 }, { "name": "昌乐县", "pid": 370700, "id": 370725 }, { "name": "青州市", "pid": 370700, "id": 370781 }, { "name": "诸城市", "pid": 370700, "id": 370782 }, { "name": "寿光市", "pid": 370700, "id": 370783 }, { "name": "安丘市", "pid": 370700, "id": 370784 }, { "name": "高密市", "pid": 370700, "id": 370785 }, { "name": "昌邑市", "pid": 370700, "id": 370786 }], "name": "潍坊市", "pid": 370000, "id": 370700 }, { "districtList": [{ "name": "市辖区", "pid": 370800, "id": 370801 }, { "name": "市中区", "pid": 370800, "id": 370802 }, { "name": "任城区", "pid": 370800, "id": 370811 }, { "name": "微山县", "pid": 370800, "id": 370826 }, { "name": "鱼台县", "pid": 370800, "id": 370827 }, { "name": "金乡县", "pid": 370800, "id": 370828 }, { "name": "嘉祥县", "pid": 370800, "id": 370829 }, { "name": "汶上县", "pid": 370800, "id": 370830 }, { "name": "泗水县", "pid": 370800, "id": 370831 }, { "name": "梁山县", "pid": 370800, "id": 370832 }, { "name": "曲阜市", "pid": 370800, "id": 370881 }, { "name": "兖州市", "pid": 370800, "id": 370882 }, { "name": "邹城市", "pid": 370800, "id": 370883 }], "name": "济宁市", "pid": 370000, "id": 370800 }, { "districtList": [{ "name": "市辖区", "pid": 370900, "id": 370901 }, { "name": "泰山区", "pid": 370900, "id": 370902 }, { "name": "岱岳区", "pid": 370900, "id": 370911 }, { "name": "宁阳县", "pid": 370900, "id": 370921 }, { "name": "东平县", "pid": 370900, "id": 370923 }, { "name": "新泰市", "pid": 370900, "id": 370982 }, { "name": "肥城市", "pid": 370900, "id": 370983 }], "name": "泰安市", "pid": 370000, "id": 370900 }, { "districtList": [{ "name": "市辖区", "pid": 371000, "id": 371001 }, { "name": "环翠区", "pid": 371000, "id": 371002 }, { "name": "文登市", "pid": 371000, "id": 371081 }, { "name": "荣成市", "pid": 371000, "id": 371082 }, { "name": "乳山市", "pid": 371000, "id": 371083 }], "name": "威海市", "pid": 370000, "id": 371000 }, { "districtList": [{ "name": "市辖区", "pid": 371100, "id": 371101 }, { "name": "东港区", "pid": 371100, "id": 371102 }, { "name": "岚山区", "pid": 371100, "id": 371103 }, { "name": "五莲县", "pid": 371100, "id": 371121 }, { "name": "莒县", "pid": 371100, "id": 371122 }], "name": "日照市", "pid": 370000, "id": 371100 }, { "districtList": [{ "name": "市辖区", "pid": 371200, "id": 371201 }, { "name": "莱城区", "pid": 371200, "id": 371202 }, { "name": "钢城区", "pid": 371200, "id": 371203 }], "name": "莱芜市", "pid": 370000, "id": 371200 }, { "districtList": [{ "name": "市辖区", "pid": 371300, "id": 371301 }, { "name": "兰山区", "pid": 371300, "id": 371302 }, { "name": "罗庄区", "pid": 371300, "id": 371311 }, { "name": "河东区", "pid": 371300, "id": 371312 }, { "name": "沂南县", "pid": 371300, "id": 371321 }, { "name": "郯城县", "pid": 371300, "id": 371322 }, { "name": "沂水县", "pid": 371300, "id": 371323 }, { "name": "苍山县", "pid": 371300, "id": 371324 }, { "name": "费县", "pid": 371300, "id": 371325 }, { "name": "平邑县", "pid": 371300, "id": 371326 }, { "name": "莒南县", "pid": 371300, "id": 371327 }, { "name": "蒙阴县", "pid": 371300, "id": 371328 }, { "name": "临沭县", "pid": 371300, "id": 371329 }], "name": "临沂市", "pid": 370000, "id": 371300 }, { "districtList": [{ "name": "市辖区", "pid": 371400, "id": 371401 }, { "name": "德城区", "pid": 371400, "id": 371402 }, { "name": "陵县", "pid": 371400, "id": 371421 }, { "name": "宁津县", "pid": 371400, "id": 371422 }, { "name": "庆云县", "pid": 371400, "id": 371423 }, { "name": "临邑县", "pid": 371400, "id": 371424 }, { "name": "齐河县", "pid": 371400, "id": 371425 }, { "name": "平原县", "pid": 371400, "id": 371426 }, { "name": "夏津县", "pid": 371400, "id": 371427 }, { "name": "武城县", "pid": 371400, "id": 371428 }, { "name": "乐陵市", "pid": 371400, "id": 371481 }, { "name": "禹城市", "pid": 371400, "id": 371482 }], "name": "德州市", "pid": 370000, "id": 371400 }, { "districtList": [{ "name": "市辖区", "pid": 371500, "id": 371501 }, { "name": "东昌府区", "pid": 371500, "id": 371502 }, { "name": "阳谷县", "pid": 371500, "id": 371521 }, { "name": "莘县", "pid": 371500, "id": 371522 }, { "name": "茌平县", "pid": 371500, "id": 371523 }, { "name": "东阿县", "pid": 371500, "id": 371524 }, { "name": "冠县", "pid": 371500, "id": 371525 }, { "name": "高唐县", "pid": 371500, "id": 371526 }, { "name": "临清市", "pid": 371500, "id": 371581 }], "name": "聊城市", "pid": 370000, "id": 371500 }, { "districtList": [{ "name": "市辖区", "pid": 371600, "id": 371601 }, { "name": "滨城区", "pid": 371600, "id": 371602 }, { "name": "惠民县", "pid": 371600, "id": 371621 }, { "name": "阳信县", "pid": 371600, "id": 371622 }, { "name": "无棣县", "pid": 371600, "id": 371623 }, { "name": "沾化县", "pid": 371600, "id": 371624 }, { "name": "博兴县", "pid": 371600, "id": 371625 }, { "name": "邹平县", "pid": 371600, "id": 371626 }], "name": "滨州市", "pid": 370000, "id": 371600 }, { "districtList": [{ "name": "市辖区", "pid": 371700, "id": 371701 }, { "name": "牡丹区", "pid": 371700, "id": 371702 }, { "name": "曹县", "pid": 371700, "id": 371721 }, { "name": "单县", "pid": 371700, "id": 371722 }, { "name": "成武县", "pid": 371700, "id": 371723 }, { "name": "巨野县", "pid": 371700, "id": 371724 }, { "name": "郓城县", "pid": 371700, "id": 371725 }, { "name": "鄄城县", "pid": 371700, "id": 371726 }, { "name": "定陶县", "pid": 371700, "id": 371727 }, { "name": "东明县", "pid": 371700, "id": 371728 }], "name": "菏泽市", "pid": 370000, "id": 371700 }] }, { "name": "河南省", "id": 410000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 410100, "id": 410101 }, { "name": "中原区", "pid": 410100, "id": 410102 }, { "name": "二七区", "pid": 410100, "id": 410103 }, { "name": "管城回族区", "pid": 410100, "id": 410104 }, { "name": "金水区", "pid": 410100, "id": 410105 }, { "name": "上街区", "pid": 410100, "id": 410106 }, { "name": "惠济区", "pid": 410100, "id": 410108 }, { "name": "中牟县", "pid": 410100, "id": 410122 }, { "name": "巩义市", "pid": 410100, "id": 410181 }, { "name": "荥阳市", "pid": 410100, "id": 410182 }, { "name": "新密市", "pid": 410100, "id": 410183 }, { "name": "新郑市", "pid": 410100, "id": 410184 }, { "name": "登封市", "pid": 410100, "id": 410185 }], "name": "郑州市", "pid": 410000, "id": 410100 }, { "districtList": [{ "name": "市辖区", "pid": 410200, "id": 410201 }, { "name": "龙亭区", "pid": 410200, "id": 410202 }, { "name": "顺河回族区", "pid": 410200, "id": 410203 }, { "name": "鼓楼区", "pid": 410200, "id": 410204 }, { "name": "禹王台区", "pid": 410200, "id": 410205 }, { "name": "金明区", "pid": 410200, "id": 410211 }, { "name": "杞县", "pid": 410200, "id": 410221 }, { "name": "通许县", "pid": 410200, "id": 410222 }, { "name": "尉氏县", "pid": 410200, "id": 410223 }, { "name": "开封县", "pid": 410200, "id": 410224 }, { "name": "兰考县", "pid": 410200, "id": 410225 }], "name": "开封市", "pid": 410000, "id": 410200 }, { "districtList": [{ "name": "市辖区", "pid": 410300, "id": 410301 }, { "name": "老城区", "pid": 410300, "id": 410302 }, { "name": "西工区", "pid": 410300, "id": 410303 }, { "name": "瀍河回族区", "pid": 410300, "id": 410304 }, { "name": "涧西区", "pid": 410300, "id": 410305 }, { "name": "吉利区", "pid": 410300, "id": 410306 }, { "name": "洛龙区", "pid": 410300, "id": 410311 }, { "name": "孟津县", "pid": 410300, "id": 410322 }, { "name": "新安县", "pid": 410300, "id": 410323 }, { "name": "栾川县", "pid": 410300, "id": 410324 }, { "name": "嵩县", "pid": 410300, "id": 410325 }, { "name": "汝阳县", "pid": 410300, "id": 410326 }, { "name": "宜阳县", "pid": 410300, "id": 410327 }, { "name": "洛宁县", "pid": 410300, "id": 410328 }, { "name": "伊川县", "pid": 410300, "id": 410329 }, { "name": "偃师市", "pid": 410300, "id": 410381 }], "name": "洛阳市", "pid": 410000, "id": 410300 }, { "districtList": [{ "name": "市辖区", "pid": 410400, "id": 410401 }, { "name": "新华区", "pid": 410400, "id": 410402 }, { "name": "卫东区", "pid": 410400, "id": 410403 }, { "name": "石龙区", "pid": 410400, "id": 410404 }, { "name": "湛河区", "pid": 410400, "id": 410411 }, { "name": "宝丰县", "pid": 410400, "id": 410421 }, { "name": "叶县", "pid": 410400, "id": 410422 }, { "name": "鲁山县", "pid": 410400, "id": 410423 }, { "name": "郏县", "pid": 410400, "id": 410425 }, { "name": "舞钢市", "pid": 410400, "id": 410481 }, { "name": "汝州市", "pid": 410400, "id": 410482 }], "name": "平顶山市", "pid": 410000, "id": 410400 }, { "districtList": [{ "name": "市辖区", "pid": 410500, "id": 410501 }, { "name": "文峰区", "pid": 410500, "id": 410502 }, { "name": "北关区", "pid": 410500, "id": 410503 }, { "name": "殷都区", "pid": 410500, "id": 410505 }, { "name": "龙安区", "pid": 410500, "id": 410506 }, { "name": "安阳县", "pid": 410500, "id": 410522 }, { "name": "汤阴县", "pid": 410500, "id": 410523 }, { "name": "滑县", "pid": 410500, "id": 410526 }, { "name": "内黄县", "pid": 410500, "id": 410527 }, { "name": "林州市", "pid": 410500, "id": 410581 }], "name": "安阳市", "pid": 410000, "id": 410500 }, { "districtList": [{ "name": "市辖区", "pid": 410600, "id": 410601 }, { "name": "鹤山区", "pid": 410600, "id": 410602 }, { "name": "山城区", "pid": 410600, "id": 410603 }, { "name": "淇滨区", "pid": 410600, "id": 410611 }, { "name": "浚县", "pid": 410600, "id": 410621 }, { "name": "淇县", "pid": 410600, "id": 410622 }], "name": "鹤壁市", "pid": 410000, "id": 410600 }, { "districtList": [{ "name": "市辖区", "pid": 410700, "id": 410701 }, { "name": "红旗区", "pid": 410700, "id": 410702 }, { "name": "卫滨区", "pid": 410700, "id": 410703 }, { "name": "凤泉区", "pid": 410700, "id": 410704 }, { "name": "牧野区", "pid": 410700, "id": 410711 }, { "name": "新乡县", "pid": 410700, "id": 410721 }, { "name": "获嘉县", "pid": 410700, "id": 410724 }, { "name": "原阳县", "pid": 410700, "id": 410725 }, { "name": "延津县", "pid": 410700, "id": 410726 }, { "name": "封丘县", "pid": 410700, "id": 410727 }, { "name": "长垣县", "pid": 410700, "id": 410728 }, { "name": "卫辉市", "pid": 410700, "id": 410781 }, { "name": "辉县市", "pid": 410700, "id": 410782 }], "name": "新乡市", "pid": 410000, "id": 410700 }, { "districtList": [{ "name": "市辖区", "pid": 410800, "id": 410801 }, { "name": "解放区", "pid": 410800, "id": 410802 }, { "name": "中站区", "pid": 410800, "id": 410803 }, { "name": "马村区", "pid": 410800, "id": 410804 }, { "name": "山阳区", "pid": 410800, "id": 410811 }, { "name": "修武县", "pid": 410800, "id": 410821 }, { "name": "博爱县", "pid": 410800, "id": 410822 }, { "name": "武陟县", "pid": 410800, "id": 410823 }, { "name": "温县", "pid": 410800, "id": 410825 }, { "name": "沁阳市", "pid": 410800, "id": 410882 }, { "name": "孟州市", "pid": 410800, "id": 410883 }], "name": "焦作市", "pid": 410000, "id": 410800 }, { "districtList": [{ "name": "市辖区", "pid": 410900, "id": 410901 }, { "name": "华龙区", "pid": 410900, "id": 410902 }, { "name": "清丰县", "pid": 410900, "id": 410922 }, { "name": "南乐县", "pid": 410900, "id": 410923 }, { "name": "范县", "pid": 410900, "id": 410926 }, { "name": "台前县", "pid": 410900, "id": 410927 }, { "name": "濮阳县", "pid": 410900, "id": 410928 }], "name": "濮阳市", "pid": 410000, "id": 410900 }, { "districtList": [{ "name": "市辖区", "pid": 411000, "id": 411001 }, { "name": "魏都区", "pid": 411000, "id": 411002 }, { "name": "许昌县", "pid": 411000, "id": 411023 }, { "name": "鄢陵县", "pid": 411000, "id": 411024 }, { "name": "襄城县", "pid": 411000, "id": 411025 }, { "name": "禹州市", "pid": 411000, "id": 411081 }, { "name": "长葛市", "pid": 411000, "id": 411082 }], "name": "许昌市", "pid": 410000, "id": 411000 }, { "districtList": [{ "name": "市辖区", "pid": 411100, "id": 411101 }, { "name": "源汇区", "pid": 411100, "id": 411102 }, { "name": "郾城区", "pid": 411100, "id": 411103 }, { "name": "召陵区", "pid": 411100, "id": 411104 }, { "name": "舞阳县", "pid": 411100, "id": 411121 }, { "name": "临颍县", "pid": 411100, "id": 411122 }], "name": "漯河市", "pid": 410000, "id": 411100 }, { "districtList": [{ "name": "市辖区", "pid": 411200, "id": 411201 }, { "name": "湖滨区", "pid": 411200, "id": 411202 }, { "name": "渑池县", "pid": 411200, "id": 411221 }, { "name": "陕县", "pid": 411200, "id": 411222 }, { "name": "卢氏县", "pid": 411200, "id": 411224 }, { "name": "义马市", "pid": 411200, "id": 411281 }, { "name": "灵宝市", "pid": 411200, "id": 411282 }], "name": "三门峡市", "pid": 410000, "id": 411200 }, { "districtList": [{ "name": "市辖区", "pid": 411300, "id": 411301 }, { "name": "宛城区", "pid": 411300, "id": 411302 }, { "name": "卧龙区", "pid": 411300, "id": 411303 }, { "name": "南召县", "pid": 411300, "id": 411321 }, { "name": "方城县", "pid": 411300, "id": 411322 }, { "name": "西峡县", "pid": 411300, "id": 411323 }, { "name": "镇平县", "pid": 411300, "id": 411324 }, { "name": "内乡县", "pid": 411300, "id": 411325 }, { "name": "淅川县", "pid": 411300, "id": 411326 }, { "name": "社旗县", "pid": 411300, "id": 411327 }, { "name": "唐河县", "pid": 411300, "id": 411328 }, { "name": "新野县", "pid": 411300, "id": 411329 }, { "name": "桐柏县", "pid": 411300, "id": 411330 }, { "name": "邓州市", "pid": 411300, "id": 411381 }], "name": "南阳市", "pid": 410000, "id": 411300 }, { "districtList": [{ "name": "市辖区", "pid": 411400, "id": 411401 }, { "name": "梁园区", "pid": 411400, "id": 411402 }, { "name": "睢阳区", "pid": 411400, "id": 411403 }, { "name": "民权县", "pid": 411400, "id": 411421 }, { "name": "睢县", "pid": 411400, "id": 411422 }, { "name": "宁陵县", "pid": 411400, "id": 411423 }, { "name": "柘城县", "pid": 411400, "id": 411424 }, { "name": "虞城县", "pid": 411400, "id": 411425 }, { "name": "夏邑县", "pid": 411400, "id": 411426 }, { "name": "永城市", "pid": 411400, "id": 411481 }], "name": "商丘市", "pid": 410000, "id": 411400 }, { "districtList": [{ "name": "市辖区", "pid": 411500, "id": 411501 }, { "name": "浉河区", "pid": 411500, "id": 411502 }, { "name": "平桥区", "pid": 411500, "id": 411503 }, { "name": "罗山县", "pid": 411500, "id": 411521 }, { "name": "光山县", "pid": 411500, "id": 411522 }, { "name": "新县", "pid": 411500, "id": 411523 }, { "name": "商城县", "pid": 411500, "id": 411524 }, { "name": "固始县", "pid": 411500, "id": 411525 }, { "name": "潢川县", "pid": 411500, "id": 411526 }, { "name": "淮滨县", "pid": 411500, "id": 411527 }, { "name": "息县", "pid": 411500, "id": 411528 }], "name": "信阳市", "pid": 410000, "id": 411500 }, { "districtList": [{ "name": "市辖区", "pid": 411600, "id": 411601 }, { "name": "川汇区", "pid": 411600, "id": 411602 }, { "name": "扶沟县", "pid": 411600, "id": 411621 }, { "name": "西华县", "pid": 411600, "id": 411622 }, { "name": "商水县", "pid": 411600, "id": 411623 }, { "name": "沈丘县", "pid": 411600, "id": 411624 }, { "name": "郸城县", "pid": 411600, "id": 411625 }, { "name": "淮阳县", "pid": 411600, "id": 411626 }, { "name": "太康县", "pid": 411600, "id": 411627 }, { "name": "鹿邑县", "pid": 411600, "id": 411628 }, { "name": "项城市", "pid": 411600, "id": 411681 }], "name": "周口市", "pid": 410000, "id": 411600 }, { "districtList": [{ "name": "市辖区", "pid": 411700, "id": 411701 }, { "name": "驿城区", "pid": 411700, "id": 411702 }, { "name": "西平县", "pid": 411700, "id": 411721 }, { "name": "上蔡县", "pid": 411700, "id": 411722 }, { "name": "平舆县", "pid": 411700, "id": 411723 }, { "name": "正阳县", "pid": 411700, "id": 411724 }, { "name": "确山县", "pid": 411700, "id": 411725 }, { "name": "泌阳县", "pid": 411700, "id": 411726 }, { "name": "汝南县", "pid": 411700, "id": 411727 }, { "name": "遂平县", "pid": 411700, "id": 411728 }, { "name": "新蔡县", "pid": 411700, "id": 411729 }], "name": "驻马店市", "pid": 410000, "id": 411700 }, { "districtList": [{ "name": "济源市", "pid": 419000, "id": 419001 }], "name": "省直辖县级行政区划", "pid": 410000, "id": 419000 }] }, { "name": "湖北省", "id": 420000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 420100, "id": 420101 }, { "name": "江岸区", "pid": 420100, "id": 420102 }, { "name": "江汉区", "pid": 420100, "id": 420103 }, { "name": "硚口区", "pid": 420100, "id": 420104 }, { "name": "汉阳区", "pid": 420100, "id": 420105 }, { "name": "武昌区", "pid": 420100, "id": 420106 }, { "name": "青山区", "pid": 420100, "id": 420107 }, { "name": "洪山区", "pid": 420100, "id": 420111 }, { "name": "东西湖区", "pid": 420100, "id": 420112 }, { "name": "汉南区", "pid": 420100, "id": 420113 }, { "name": "蔡甸区", "pid": 420100, "id": 420114 }, { "name": "江夏区", "pid": 420100, "id": 420115 }, { "name": "黄陂区", "pid": 420100, "id": 420116 }, { "name": "新洲区", "pid": 420100, "id": 420117 }], "name": "武汉市", "pid": 420000, "id": 420100 }, { "districtList": [{ "name": "市辖区", "pid": 420200, "id": 420201 }, { "name": "黄石港区", "pid": 420200, "id": 420202 }, { "name": "西塞山区", "pid": 420200, "id": 420203 }, { "name": "下陆区", "pid": 420200, "id": 420204 }, { "name": "铁山区", "pid": 420200, "id": 420205 }, { "name": "阳新县", "pid": 420200, "id": 420222 }, { "name": "大冶市", "pid": 420200, "id": 420281 }], "name": "黄石市", "pid": 420000, "id": 420200 }, { "districtList": [{ "name": "市辖区", "pid": 420300, "id": 420301 }, { "name": "茅箭区", "pid": 420300, "id": 420302 }, { "name": "张湾区", "pid": 420300, "id": 420303 }, { "name": "郧县", "pid": 420300, "id": 420321 }, { "name": "郧西县", "pid": 420300, "id": 420322 }, { "name": "竹山县", "pid": 420300, "id": 420323 }, { "name": "竹溪县", "pid": 420300, "id": 420324 }, { "name": "房县", "pid": 420300, "id": 420325 }, { "name": "丹江口市", "pid": 420300, "id": 420381 }], "name": "十堰市", "pid": 420000, "id": 420300 }, { "districtList": [{ "name": "市辖区", "pid": 420500, "id": 420501 }, { "name": "西陵区", "pid": 420500, "id": 420502 }, { "name": "伍家岗区", "pid": 420500, "id": 420503 }, { "name": "点军区", "pid": 420500, "id": 420504 }, { "name": "猇亭区", "pid": 420500, "id": 420505 }, { "name": "夷陵区", "pid": 420500, "id": 420506 }, { "name": "远安县", "pid": 420500, "id": 420525 }, { "name": "兴山县", "pid": 420500, "id": 420526 }, { "name": "秭归县", "pid": 420500, "id": 420527 }, { "name": "长阳土家族自治县", "pid": 420500, "id": 420528 }, { "name": "五峰土家族自治县", "pid": 420500, "id": 420529 }, { "name": "宜都市", "pid": 420500, "id": 420581 }, { "name": "当阳市", "pid": 420500, "id": 420582 }, { "name": "枝江市", "pid": 420500, "id": 420583 }], "name": "宜昌市", "pid": 420000, "id": 420500 }, { "districtList": [{ "name": "市辖区", "pid": 420600, "id": 420601 }, { "name": "襄城区", "pid": 420600, "id": 420602 }, { "name": "樊城区", "pid": 420600, "id": 420606 }, { "name": "襄州区", "pid": 420600, "id": 420607 }, { "name": "南漳县", "pid": 420600, "id": 420624 }, { "name": "谷城县", "pid": 420600, "id": 420625 }, { "name": "保康县", "pid": 420600, "id": 420626 }, { "name": "老河口市", "pid": 420600, "id": 420682 }, { "name": "枣阳市", "pid": 420600, "id": 420683 }, { "name": "宜城市", "pid": 420600, "id": 420684 }], "name": "襄阳市", "pid": 420000, "id": 420600 }, { "districtList": [{ "name": "市辖区", "pid": 420700, "id": 420701 }, { "name": "梁子湖区", "pid": 420700, "id": 420702 }, { "name": "华容区", "pid": 420700, "id": 420703 }, { "name": "鄂城区", "pid": 420700, "id": 420704 }], "name": "鄂州市", "pid": 420000, "id": 420700 }, { "districtList": [{ "name": "市辖区", "pid": 420800, "id": 420801 }, { "name": "东宝区", "pid": 420800, "id": 420802 }, { "name": "掇刀区", "pid": 420800, "id": 420804 }, { "name": "京山县", "pid": 420800, "id": 420821 }, { "name": "沙洋县", "pid": 420800, "id": 420822 }, { "name": "钟祥市", "pid": 420800, "id": 420881 }], "name": "荆门市", "pid": 420000, "id": 420800 }, { "districtList": [{ "name": "市辖区", "pid": 420900, "id": 420901 }, { "name": "孝南区", "pid": 420900, "id": 420902 }, { "name": "孝昌县", "pid": 420900, "id": 420921 }, { "name": "大悟县", "pid": 420900, "id": 420922 }, { "name": "云梦县", "pid": 420900, "id": 420923 }, { "name": "应城市", "pid": 420900, "id": 420981 }, { "name": "安陆市", "pid": 420900, "id": 420982 }, { "name": "汉川市", "pid": 420900, "id": 420984 }], "name": "孝感市", "pid": 420000, "id": 420900 }, { "districtList": [{ "name": "市辖区", "pid": 421000, "id": 421001 }, { "name": "沙市区", "pid": 421000, "id": 421002 }, { "name": "荆州区", "pid": 421000, "id": 421003 }, { "name": "公安县", "pid": 421000, "id": 421022 }, { "name": "监利县", "pid": 421000, "id": 421023 }, { "name": "江陵县", "pid": 421000, "id": 421024 }, { "name": "石首市", "pid": 421000, "id": 421081 }, { "name": "洪湖市", "pid": 421000, "id": 421083 }, { "name": "松滋市", "pid": 421000, "id": 421087 }], "name": "荆州市", "pid": 420000, "id": 421000 }, { "districtList": [{ "name": "市辖区", "pid": 421100, "id": 421101 }, { "name": "黄州区", "pid": 421100, "id": 421102 }, { "name": "团风县", "pid": 421100, "id": 421121 }, { "name": "红安县", "pid": 421100, "id": 421122 }, { "name": "罗田县", "pid": 421100, "id": 421123 }, { "name": "英山县", "pid": 421100, "id": 421124 }, { "name": "浠水县", "pid": 421100, "id": 421125 }, { "name": "蕲春县", "pid": 421100, "id": 421126 }, { "name": "黄梅县", "pid": 421100, "id": 421127 }, { "name": "麻城市", "pid": 421100, "id": 421181 }, { "name": "武穴市", "pid": 421100, "id": 421182 }], "name": "黄冈市", "pid": 420000, "id": 421100 }, { "districtList": [{ "name": "市辖区", "pid": 421200, "id": 421201 }, { "name": "咸安区", "pid": 421200, "id": 421202 }, { "name": "嘉鱼县", "pid": 421200, "id": 421221 }, { "name": "通城县", "pid": 421200, "id": 421222 }, { "name": "崇阳县", "pid": 421200, "id": 421223 }, { "name": "通山县", "pid": 421200, "id": 421224 }, { "name": "赤壁市", "pid": 421200, "id": 421281 }], "name": "咸宁市", "pid": 420000, "id": 421200 }, { "districtList": [{ "name": "市辖区", "pid": 421300, "id": 421301 }, { "name": "曾都区", "pid": 421300, "id": 421303 }, { "name": "随县", "pid": 421300, "id": 421321 }, { "name": "广水市", "pid": 421300, "id": 421381 }], "name": "随州市", "pid": 420000, "id": 421300 }, { "districtList": [{ "name": "恩施市", "pid": 422800, "id": 422801 }, { "name": "利川市", "pid": 422800, "id": 422802 }, { "name": "建始县", "pid": 422800, "id": 422822 }, { "name": "巴东县", "pid": 422800, "id": 422823 }, { "name": "宣恩县", "pid": 422800, "id": 422825 }, { "name": "咸丰县", "pid": 422800, "id": 422826 }, { "name": "来凤县", "pid": 422800, "id": 422827 }, { "name": "鹤峰县", "pid": 422800, "id": 422828 }], "name": "恩施土家族苗族自治州", "pid": 420000, "id": 422800 }, { "districtList": [{ "name": "仙桃市", "pid": 429000, "id": 429004 }, { "name": "潜江市", "pid": 429000, "id": 429005 }, { "name": "天门市", "pid": 429000, "id": 429006 }, { "name": "神农架林区", "pid": 429000, "id": 429021 }], "name": "省直辖县级行政区划", "pid": 420000, "id": 429000 }] }, { "name": "湖南省", "id": 430000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 430100, "id": 430101 }, { "name": "芙蓉区", "pid": 430100, "id": 430102 }, { "name": "天心区", "pid": 430100, "id": 430103 }, { "name": "岳麓区", "pid": 430100, "id": 430104 }, { "name": "开福区", "pid": 430100, "id": 430105 }, { "name": "雨花区", "pid": 430100, "id": 430111 }, { "name": "望城区", "pid": 430100, "id": 430112 }, { "name": "长沙县", "pid": 430100, "id": 430121 }, { "name": "宁乡县", "pid": 430100, "id": 430124 }, { "name": "浏阳市", "pid": 430100, "id": 430181 }], "name": "长沙市", "pid": 430000, "id": 430100 }, { "districtList": [{ "name": "市辖区", "pid": 430200, "id": 430201 }, { "name": "荷塘区", "pid": 430200, "id": 430202 }, { "name": "芦淞区", "pid": 430200, "id": 430203 }, { "name": "石峰区", "pid": 430200, "id": 430204 }, { "name": "天元区", "pid": 430200, "id": 430211 }, { "name": "株洲县", "pid": 430200, "id": 430221 }, { "name": "攸县", "pid": 430200, "id": 430223 }, { "name": "茶陵县", "pid": 430200, "id": 430224 }, { "name": "炎陵县", "pid": 430200, "id": 430225 }, { "name": "醴陵市", "pid": 430200, "id": 430281 }], "name": "株洲市", "pid": 430000, "id": 430200 }, { "districtList": [{ "name": "市辖区", "pid": 430300, "id": 430301 }, { "name": "雨湖区", "pid": 430300, "id": 430302 }, { "name": "岳塘区", "pid": 430300, "id": 430304 }, { "name": "湘潭县", "pid": 430300, "id": 430321 }, { "name": "湘乡市", "pid": 430300, "id": 430381 }, { "name": "韶山市", "pid": 430300, "id": 430382 }], "name": "湘潭市", "pid": 430000, "id": 430300 }, { "districtList": [{ "name": "市辖区", "pid": 430400, "id": 430401 }, { "name": "珠晖区", "pid": 430400, "id": 430405 }, { "name": "雁峰区", "pid": 430400, "id": 430406 }, { "name": "石鼓区", "pid": 430400, "id": 430407 }, { "name": "蒸湘区", "pid": 430400, "id": 430408 }, { "name": "南岳区", "pid": 430400, "id": 430412 }, { "name": "衡阳县", "pid": 430400, "id": 430421 }, { "name": "衡南县", "pid": 430400, "id": 430422 }, { "name": "衡山县", "pid": 430400, "id": 430423 }, { "name": "衡东县", "pid": 430400, "id": 430424 }, { "name": "祁东县", "pid": 430400, "id": 430426 }, { "name": "耒阳市", "pid": 430400, "id": 430481 }, { "name": "常宁市", "pid": 430400, "id": 430482 }], "name": "衡阳市", "pid": 430000, "id": 430400 }, { "districtList": [{ "name": "市辖区", "pid": 430500, "id": 430501 }, { "name": "双清区", "pid": 430500, "id": 430502 }, { "name": "大祥区", "pid": 430500, "id": 430503 }, { "name": "北塔区", "pid": 430500, "id": 430511 }, { "name": "邵东县", "pid": 430500, "id": 430521 }, { "name": "新邵县", "pid": 430500, "id": 430522 }, { "name": "邵阳县", "pid": 430500, "id": 430523 }, { "name": "隆回县", "pid": 430500, "id": 430524 }, { "name": "洞口县", "pid": 430500, "id": 430525 }, { "name": "绥宁县", "pid": 430500, "id": 430527 }, { "name": "新宁县", "pid": 430500, "id": 430528 }, { "name": "城步苗族自治县", "pid": 430500, "id": 430529 }, { "name": "武冈市", "pid": 430500, "id": 430581 }], "name": "邵阳市", "pid": 430000, "id": 430500 }, { "districtList": [{ "name": "市辖区", "pid": 430600, "id": 430601 }, { "name": "岳阳楼区", "pid": 430600, "id": 430602 }, { "name": "云溪区", "pid": 430600, "id": 430603 }, { "name": "君山区", "pid": 430600, "id": 430611 }, { "name": "岳阳县", "pid": 430600, "id": 430621 }, { "name": "华容县", "pid": 430600, "id": 430623 }, { "name": "湘阴县", "pid": 430600, "id": 430624 }, { "name": "平江县", "pid": 430600, "id": 430626 }, { "name": "汨罗市", "pid": 430600, "id": 430681 }, { "name": "临湘市", "pid": 430600, "id": 430682 }], "name": "岳阳市", "pid": 430000, "id": 430600 }, { "districtList": [{ "name": "市辖区", "pid": 430700, "id": 430701 }, { "name": "武陵区", "pid": 430700, "id": 430702 }, { "name": "鼎城区", "pid": 430700, "id": 430703 }, { "name": "安乡县", "pid": 430700, "id": 430721 }, { "name": "汉寿县", "pid": 430700, "id": 430722 }, { "name": "澧县", "pid": 430700, "id": 430723 }, { "name": "临澧县", "pid": 430700, "id": 430724 }, { "name": "桃源县", "pid": 430700, "id": 430725 }, { "name": "石门县", "pid": 430700, "id": 430726 }, { "name": "津市市", "pid": 430700, "id": 430781 }], "name": "常德市", "pid": 430000, "id": 430700 }, { "districtList": [{ "name": "市辖区", "pid": 430800, "id": 430801 }, { "name": "永定区", "pid": 430800, "id": 430802 }, { "name": "武陵源区", "pid": 430800, "id": 430811 }, { "name": "慈利县", "pid": 430800, "id": 430821 }, { "name": "桑植县", "pid": 430800, "id": 430822 }], "name": "张家界市", "pid": 430000, "id": 430800 }, { "districtList": [{ "name": "市辖区", "pid": 430900, "id": 430901 }, { "name": "资阳区", "pid": 430900, "id": 430902 }, { "name": "赫山区", "pid": 430900, "id": 430903 }, { "name": "南县", "pid": 430900, "id": 430921 }, { "name": "桃江县", "pid": 430900, "id": 430922 }, { "name": "安化县", "pid": 430900, "id": 430923 }, { "name": "沅江市", "pid": 430900, "id": 430981 }], "name": "益阳市", "pid": 430000, "id": 430900 }, { "districtList": [{ "name": "市辖区", "pid": 431000, "id": 431001 }, { "name": "北湖区", "pid": 431000, "id": 431002 }, { "name": "苏仙区", "pid": 431000, "id": 431003 }, { "name": "桂阳县", "pid": 431000, "id": 431021 }, { "name": "宜章县", "pid": 431000, "id": 431022 }, { "name": "永兴县", "pid": 431000, "id": 431023 }, { "name": "嘉禾县", "pid": 431000, "id": 431024 }, { "name": "临武县", "pid": 431000, "id": 431025 }, { "name": "汝城县", "pid": 431000, "id": 431026 }, { "name": "桂东县", "pid": 431000, "id": 431027 }, { "name": "安仁县", "pid": 431000, "id": 431028 }, { "name": "资兴市", "pid": 431000, "id": 431081 }], "name": "郴州市", "pid": 430000, "id": 431000 }, { "districtList": [{ "name": "市辖区", "pid": 431100, "id": 431101 }, { "name": "零陵区", "pid": 431100, "id": 431102 }, { "name": "冷水滩区", "pid": 431100, "id": 431103 }, { "name": "祁阳县", "pid": 431100, "id": 431121 }, { "name": "东安县", "pid": 431100, "id": 431122 }, { "name": "双牌县", "pid": 431100, "id": 431123 }, { "name": "道县", "pid": 431100, "id": 431124 }, { "name": "江永县", "pid": 431100, "id": 431125 }, { "name": "宁远县", "pid": 431100, "id": 431126 }, { "name": "蓝山县", "pid": 431100, "id": 431127 }, { "name": "新田县", "pid": 431100, "id": 431128 }, { "name": "江华瑶族自治县", "pid": 431100, "id": 431129 }], "name": "永州市", "pid": 430000, "id": 431100 }, { "districtList": [{ "name": "市辖区", "pid": 431200, "id": 431201 }, { "name": "鹤城区", "pid": 431200, "id": 431202 }, { "name": "中方县", "pid": 431200, "id": 431221 }, { "name": "沅陵县", "pid": 431200, "id": 431222 }, { "name": "辰溪县", "pid": 431200, "id": 431223 }, { "name": "溆浦县", "pid": 431200, "id": 431224 }, { "name": "会同县", "pid": 431200, "id": 431225 }, { "name": "麻阳苗族自治县", "pid": 431200, "id": 431226 }, { "name": "新晃侗族自治县", "pid": 431200, "id": 431227 }, { "name": "芷江侗族自治县", "pid": 431200, "id": 431228 }, { "name": "靖州苗族侗族自治县", "pid": 431200, "id": 431229 }, { "name": "通道侗族自治县", "pid": 431200, "id": 431230 }, { "name": "洪江市", "pid": 431200, "id": 431281 }], "name": "怀化市", "pid": 430000, "id": 431200 }, { "districtList": [{ "name": "市辖区", "pid": 431300, "id": 431301 }, { "name": "娄星区", "pid": 431300, "id": 431302 }, { "name": "双峰县", "pid": 431300, "id": 431321 }, { "name": "新化县", "pid": 431300, "id": 431322 }, { "name": "冷水江市", "pid": 431300, "id": 431381 }, { "name": "涟源市", "pid": 431300, "id": 431382 }], "name": "娄底市", "pid": 430000, "id": 431300 }, { "districtList": [{ "name": "吉首市", "pid": 433100, "id": 433101 }, { "name": "泸溪县", "pid": 433100, "id": 433122 }, { "name": "凤凰县", "pid": 433100, "id": 433123 }, { "name": "花垣县", "pid": 433100, "id": 433124 }, { "name": "保靖县", "pid": 433100, "id": 433125 }, { "name": "古丈县", "pid": 433100, "id": 433126 }, { "name": "永顺县", "pid": 433100, "id": 433127 }, { "name": "龙山县", "pid": 433100, "id": 433130 }], "name": "湘西土家族苗族自治州", "pid": 430000, "id": 433100 }] }, { "name": "广东省", "id": 440000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 440100, "id": 440101 }, { "name": "荔湾区", "pid": 440100, "id": 440103 }, { "name": "越秀区", "pid": 440100, "id": 440104 }, { "name": "海珠区", "pid": 440100, "id": 440105 }, { "name": "天河区", "pid": 440100, "id": 440106 }, { "name": "白云区", "pid": 440100, "id": 440111 }, { "name": "黄埔区", "pid": 440100, "id": 440112 }, { "name": "番禺区", "pid": 440100, "id": 440113 }, { "name": "花都区", "pid": 440100, "id": 440114 }, { "name": "南沙区", "pid": 440100, "id": 440115 }, { "name": "萝岗区", "pid": 440100, "id": 440116 }, { "name": "增城市", "pid": 440100, "id": 440183 }, { "name": "从化市", "pid": 440100, "id": 440184 }], "name": "广州市", "pid": 440000, "id": 440100 }, { "districtList": [{ "name": "市辖区", "pid": 440200, "id": 440201 }, { "name": "武江区", "pid": 440200, "id": 440203 }, { "name": "浈江区", "pid": 440200, "id": 440204 }, { "name": "曲江区", "pid": 440200, "id": 440205 }, { "name": "始兴县", "pid": 440200, "id": 440222 }, { "name": "仁化县", "pid": 440200, "id": 440224 }, { "name": "翁源县", "pid": 440200, "id": 440229 }, { "name": "乳源瑶族自治县", "pid": 440200, "id": 440232 }, { "name": "新丰县", "pid": 440200, "id": 440233 }, { "name": "乐昌市", "pid": 440200, "id": 440281 }, { "name": "南雄市", "pid": 440200, "id": 440282 }], "name": "韶关市", "pid": 440000, "id": 440200 }, { "districtList": [{ "name": "市辖区", "pid": 440300, "id": 440301 }, { "name": "罗湖区", "pid": 440300, "id": 440303 }, { "name": "福田区", "pid": 440300, "id": 440304 }, { "name": "南山区", "pid": 440300, "id": 440305 }, { "name": "宝安区", "pid": 440300, "id": 440306 }, { "name": "龙岗区", "pid": 440300, "id": 440307 }, { "name": "盐田区", "pid": 440300, "id": 440308 }], "name": "深圳市", "pid": 440000, "id": 440300 }, { "districtList": [{ "name": "市辖区", "pid": 440400, "id": 440401 }, { "name": "香洲区", "pid": 440400, "id": 440402 }, { "name": "斗门区", "pid": 440400, "id": 440403 }, { "name": "金湾区", "pid": 440400, "id": 440404 }], "name": "珠海市", "pid": 440000, "id": 440400 }, { "districtList": [{ "name": "市辖区", "pid": 440500, "id": 440501 }, { "name": "龙湖区", "pid": 440500, "id": 440507 }, { "name": "金平区", "pid": 440500, "id": 440511 }, { "name": "濠江区", "pid": 440500, "id": 440512 }, { "name": "潮阳区", "pid": 440500, "id": 440513 }, { "name": "潮南区", "pid": 440500, "id": 440514 }, { "name": "澄海区", "pid": 440500, "id": 440515 }, { "name": "南澳县", "pid": 440500, "id": 440523 }], "name": "汕头市", "pid": 440000, "id": 440500 }, { "districtList": [{ "name": "市辖区", "pid": 440600, "id": 440601 }, { "name": "禅城区", "pid": 440600, "id": 440604 }, { "name": "南海区", "pid": 440600, "id": 440605 }, { "name": "顺德区", "pid": 440600, "id": 440606 }, { "name": "三水区", "pid": 440600, "id": 440607 }, { "name": "高明区", "pid": 440600, "id": 440608 }], "name": "佛山市", "pid": 440000, "id": 440600 }, { "districtList": [{ "name": "市辖区", "pid": 440700, "id": 440701 }, { "name": "蓬江区", "pid": 440700, "id": 440703 }, { "name": "江海区", "pid": 440700, "id": 440704 }, { "name": "新会区", "pid": 440700, "id": 440705 }, { "name": "台山市", "pid": 440700, "id": 440781 }, { "name": "开平市", "pid": 440700, "id": 440783 }, { "name": "鹤山市", "pid": 440700, "id": 440784 }, { "name": "恩平市", "pid": 440700, "id": 440785 }], "name": "江门市", "pid": 440000, "id": 440700 }, { "districtList": [{ "name": "市辖区", "pid": 440800, "id": 440801 }, { "name": "赤坎区", "pid": 440800, "id": 440802 }, { "name": "霞山区", "pid": 440800, "id": 440803 }, { "name": "坡头区", "pid": 440800, "id": 440804 }, { "name": "麻章区", "pid": 440800, "id": 440811 }, { "name": "遂溪县", "pid": 440800, "id": 440823 }, { "name": "徐闻县", "pid": 440800, "id": 440825 }, { "name": "廉江市", "pid": 440800, "id": 440881 }, { "name": "雷州市", "pid": 440800, "id": 440882 }, { "name": "吴川市", "pid": 440800, "id": 440883 }], "name": "湛江市", "pid": 440000, "id": 440800 }, { "districtList": [{ "name": "市辖区", "pid": 440900, "id": 440901 }, { "name": "茂南区", "pid": 440900, "id": 440902 }, { "name": "茂港区", "pid": 440900, "id": 440903 }, { "name": "电白县", "pid": 440900, "id": 440923 }, { "name": "高州市", "pid": 440900, "id": 440981 }, { "name": "化州市", "pid": 440900, "id": 440982 }, { "name": "信宜市", "pid": 440900, "id": 440983 }], "name": "茂名市", "pid": 440000, "id": 440900 }, { "districtList": [{ "name": "市辖区", "pid": 441200, "id": 441201 }, { "name": "端州区", "pid": 441200, "id": 441202 }, { "name": "鼎湖区", "pid": 441200, "id": 441203 }, { "name": "广宁县", "pid": 441200, "id": 441223 }, { "name": "怀集县", "pid": 441200, "id": 441224 }, { "name": "封开县", "pid": 441200, "id": 441225 }, { "name": "德庆县", "pid": 441200, "id": 441226 }, { "name": "高要市", "pid": 441200, "id": 441283 }, { "name": "四会市", "pid": 441200, "id": 441284 }], "name": "肇庆市", "pid": 440000, "id": 441200 }, { "districtList": [{ "name": "市辖区", "pid": 441300, "id": 441301 }, { "name": "惠城区", "pid": 441300, "id": 441302 }, { "name": "惠阳区", "pid": 441300, "id": 441303 }, { "name": "博罗县", "pid": 441300, "id": 441322 }, { "name": "惠东县", "pid": 441300, "id": 441323 }, { "name": "龙门县", "pid": 441300, "id": 441324 }], "name": "惠州市", "pid": 440000, "id": 441300 }, { "districtList": [{ "name": "市辖区", "pid": 441400, "id": 441401 }, { "name": "梅江区", "pid": 441400, "id": 441402 }, { "name": "梅县", "pid": 441400, "id": 441421 }, { "name": "大埔县", "pid": 441400, "id": 441422 }, { "name": "丰顺县", "pid": 441400, "id": 441423 }, { "name": "五华县", "pid": 441400, "id": 441424 }, { "name": "平远县", "pid": 441400, "id": 441426 }, { "name": "蕉岭县", "pid": 441400, "id": 441427 }, { "name": "兴宁市", "pid": 441400, "id": 441481 }], "name": "梅州市", "pid": 440000, "id": 441400 }, { "districtList": [{ "name": "市辖区", "pid": 441500, "id": 441501 }, { "name": "城区", "pid": 441500, "id": 441502 }, { "name": "海丰县", "pid": 441500, "id": 441521 }, { "name": "陆河县", "pid": 441500, "id": 441523 }, { "name": "陆丰市", "pid": 441500, "id": 441581 }], "name": "汕尾市", "pid": 440000, "id": 441500 }, { "districtList": [{ "name": "市辖区", "pid": 441600, "id": 441601 }, { "name": "源城区", "pid": 441600, "id": 441602 }, { "name": "紫金县", "pid": 441600, "id": 441621 }, { "name": "龙川县", "pid": 441600, "id": 441622 }, { "name": "连平县", "pid": 441600, "id": 441623 }, { "name": "和平县", "pid": 441600, "id": 441624 }, { "name": "东源县", "pid": 441600, "id": 441625 }], "name": "河源市", "pid": 440000, "id": 441600 }, { "districtList": [{ "name": "市辖区", "pid": 441700, "id": 441701 }, { "name": "江城区", "pid": 441700, "id": 441702 }, { "name": "阳西县", "pid": 441700, "id": 441721 }, { "name": "阳东县", "pid": 441700, "id": 441723 }, { "name": "阳春市", "pid": 441700, "id": 441781 }], "name": "阳江市", "pid": 440000, "id": 441700 }, { "districtList": [{ "name": "市辖区", "pid": 441800, "id": 441801 }, { "name": "清城区", "pid": 441800, "id": 441802 }, { "name": "清新区", "pid": 441800, "id": 441803 }, { "name": "佛冈县", "pid": 441800, "id": 441821 }, { "name": "阳山县", "pid": 441800, "id": 441823 }, { "name": "连山壮族瑶族自治县", "pid": 441800, "id": 441825 }, { "name": "连南瑶族自治县", "pid": 441800, "id": 441826 }, { "name": "英德市", "pid": 441800, "id": 441881 }, { "name": "连州市", "pid": 441800, "id": 441882 }], "name": "清远市", "pid": 440000, "id": 441800 }, { "districtList": [], "name": "东莞市", "pid": 440000, "id": 441900 }, { "districtList": [], "name": "中山市", "pid": 440000, "id": 442000 }, { "districtList": [{ "name": "市辖区", "pid": 445100, "id": 445101 }, { "name": "湘桥区", "pid": 445100, "id": 445102 }, { "name": "潮安区", "pid": 445100, "id": 445103 }, { "name": "饶平县", "pid": 445100, "id": 445122 }], "name": "潮州市", "pid": 440000, "id": 445100 }, { "districtList": [{ "name": "市辖区", "pid": 445200, "id": 445201 }, { "name": "榕城区", "pid": 445200, "id": 445202 }, { "name": "揭东区", "pid": 445200, "id": 445203 }, { "name": "揭西县", "pid": 445200, "id": 445222 }, { "name": "惠来县", "pid": 445200, "id": 445224 }, { "name": "普宁市", "pid": 445200, "id": 445281 }], "name": "揭阳市", "pid": 440000, "id": 445200 }, { "districtList": [{ "name": "市辖区", "pid": 445300, "id": 445301 }, { "name": "云城区", "pid": 445300, "id": 445302 }, { "name": "新兴县", "pid": 445300, "id": 445321 }, { "name": "郁南县", "pid": 445300, "id": 445322 }, { "name": "云安县", "pid": 445300, "id": 445323 }, { "name": "罗定市", "pid": 445300, "id": 445381 }], "name": "云浮市", "pid": 440000, "id": 445300 }] }, { "name": "广西壮族自治区", "id": 450000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 450100, "id": 450101 }, { "name": "兴宁区", "pid": 450100, "id": 450102 }, { "name": "青秀区", "pid": 450100, "id": 450103 }, { "name": "江南区", "pid": 450100, "id": 450105 }, { "name": "西乡塘区", "pid": 450100, "id": 450107 }, { "name": "良庆区", "pid": 450100, "id": 450108 }, { "name": "邕宁区", "pid": 450100, "id": 450109 }, { "name": "武鸣县", "pid": 450100, "id": 450122 }, { "name": "隆安县", "pid": 450100, "id": 450123 }, { "name": "马山县", "pid": 450100, "id": 450124 }, { "name": "上林县", "pid": 450100, "id": 450125 }, { "name": "宾阳县", "pid": 450100, "id": 450126 }, { "name": "横县", "pid": 450100, "id": 450127 }], "name": "南宁市", "pid": 450000, "id": 450100 }, { "districtList": [{ "name": "市辖区", "pid": 450200, "id": 450201 }, { "name": "城中区", "pid": 450200, "id": 450202 }, { "name": "鱼峰区", "pid": 450200, "id": 450203 }, { "name": "柳南区", "pid": 450200, "id": 450204 }, { "name": "柳北区", "pid": 450200, "id": 450205 }, { "name": "柳江县", "pid": 450200, "id": 450221 }, { "name": "柳城县", "pid": 450200, "id": 450222 }, { "name": "鹿寨县", "pid": 450200, "id": 450223 }, { "name": "融安县", "pid": 450200, "id": 450224 }, { "name": "融水苗族自治县", "pid": 450200, "id": 450225 }, { "name": "三江侗族自治县", "pid": 450200, "id": 450226 }], "name": "柳州市", "pid": 450000, "id": 450200 }, { "districtList": [{ "name": "市辖区", "pid": 450300, "id": 450301 }, { "name": "秀峰区", "pid": 450300, "id": 450302 }, { "name": "叠彩区", "pid": 450300, "id": 450303 }, { "name": "象山区", "pid": 450300, "id": 450304 }, { "name": "七星区", "pid": 450300, "id": 450305 }, { "name": "雁山区", "pid": 450300, "id": 450311 }, { "name": "临桂区", "pid": 450300, "id": 450312 }, { "name": "阳朔县", "pid": 450300, "id": 450321 }, { "name": "灵川县", "pid": 450300, "id": 450323 }, { "name": "全州县", "pid": 450300, "id": 450324 }, { "name": "兴安县", "pid": 450300, "id": 450325 }, { "name": "永福县", "pid": 450300, "id": 450326 }, { "name": "灌阳县", "pid": 450300, "id": 450327 }, { "name": "龙胜各族自治县", "pid": 450300, "id": 450328 }, { "name": "资源县", "pid": 450300, "id": 450329 }, { "name": "平乐县", "pid": 450300, "id": 450330 }, { "name": "荔浦县", "pid": 450300, "id": 450331 }, { "name": "恭城瑶族自治县", "pid": 450300, "id": 450332 }], "name": "桂林市", "pid": 450000, "id": 450300 }, { "districtList": [{ "name": "市辖区", "pid": 450400, "id": 450401 }, { "name": "万秀区", "pid": 450400, "id": 450403 }, { "name": "长洲区", "pid": 450400, "id": 450405 }, { "name": "龙圩区", "pid": 450400, "id": 450406 }, { "name": "苍梧县", "pid": 450400, "id": 450421 }, { "name": "藤县", "pid": 450400, "id": 450422 }, { "name": "蒙山县", "pid": 450400, "id": 450423 }, { "name": "岑溪市", "pid": 450400, "id": 450481 }], "name": "梧州市", "pid": 450000, "id": 450400 }, { "districtList": [{ "name": "市辖区", "pid": 450500, "id": 450501 }, { "name": "海城区", "pid": 450500, "id": 450502 }, { "name": "银海区", "pid": 450500, "id": 450503 }, { "name": "铁山港区", "pid": 450500, "id": 450512 }, { "name": "合浦县", "pid": 450500, "id": 450521 }], "name": "北海市", "pid": 450000, "id": 450500 }, { "districtList": [{ "name": "市辖区", "pid": 450600, "id": 450601 }, { "name": "港口区", "pid": 450600, "id": 450602 }, { "name": "防城区", "pid": 450600, "id": 450603 }, { "name": "上思县", "pid": 450600, "id": 450621 }, { "name": "东兴市", "pid": 450600, "id": 450681 }], "name": "防城港市", "pid": 450000, "id": 450600 }, { "districtList": [{ "name": "市辖区", "pid": 450700, "id": 450701 }, { "name": "钦南区", "pid": 450700, "id": 450702 }, { "name": "钦北区", "pid": 450700, "id": 450703 }, { "name": "灵山县", "pid": 450700, "id": 450721 }, { "name": "浦北县", "pid": 450700, "id": 450722 }], "name": "钦州市", "pid": 450000, "id": 450700 }, { "districtList": [{ "name": "市辖区", "pid": 450800, "id": 450801 }, { "name": "港北区", "pid": 450800, "id": 450802 }, { "name": "港南区", "pid": 450800, "id": 450803 }, { "name": "覃塘区", "pid": 450800, "id": 450804 }, { "name": "平南县", "pid": 450800, "id": 450821 }, { "name": "桂平市", "pid": 450800, "id": 450881 }], "name": "贵港市", "pid": 450000, "id": 450800 }, { "districtList": [{ "name": "市辖区", "pid": 450900, "id": 450901 }, { "name": "玉州区", "pid": 450900, "id": 450902 }, { "name": "福绵区", "pid": 450900, "id": 450903 }, { "name": "容县", "pid": 450900, "id": 450921 }, { "name": "陆川县", "pid": 450900, "id": 450922 }, { "name": "博白县", "pid": 450900, "id": 450923 }, { "name": "兴业县", "pid": 450900, "id": 450924 }, { "name": "北流市", "pid": 450900, "id": 450981 }], "name": "玉林市", "pid": 450000, "id": 450900 }, { "districtList": [{ "name": "市辖区", "pid": 451000, "id": 451001 }, { "name": "右江区", "pid": 451000, "id": 451002 }, { "name": "田阳县", "pid": 451000, "id": 451021 }, { "name": "田东县", "pid": 451000, "id": 451022 }, { "name": "平果县", "pid": 451000, "id": 451023 }, { "name": "德保县", "pid": 451000, "id": 451024 }, { "name": "靖西县", "pid": 451000, "id": 451025 }, { "name": "那坡县", "pid": 451000, "id": 451026 }, { "name": "凌云县", "pid": 451000, "id": 451027 }, { "name": "乐业县", "pid": 451000, "id": 451028 }, { "name": "田林县", "pid": 451000, "id": 451029 }, { "name": "西林县", "pid": 451000, "id": 451030 }, { "name": "隆林各族自治县", "pid": 451000, "id": 451031 }], "name": "百色市", "pid": 450000, "id": 451000 }, { "districtList": [{ "name": "市辖区", "pid": 451100, "id": 451101 }, { "name": "八步区", "pid": 451100, "id": 451102 }, { "name": "昭平县", "pid": 451100, "id": 451121 }, { "name": "钟山县", "pid": 451100, "id": 451122 }, { "name": "富川瑶族自治县", "pid": 451100, "id": 451123 }], "name": "贺州市", "pid": 450000, "id": 451100 }, { "districtList": [{ "name": "市辖区", "pid": 451200, "id": 451201 }, { "name": "金城江区", "pid": 451200, "id": 451202 }, { "name": "南丹县", "pid": 451200, "id": 451221 }, { "name": "天峨县", "pid": 451200, "id": 451222 }, { "name": "凤山县", "pid": 451200, "id": 451223 }, { "name": "东兰县", "pid": 451200, "id": 451224 }, { "name": "罗城仫佬族自治县", "pid": 451200, "id": 451225 }, { "name": "环江毛南族自治县", "pid": 451200, "id": 451226 }, { "name": "巴马瑶族自治县", "pid": 451200, "id": 451227 }, { "name": "都安瑶族自治县", "pid": 451200, "id": 451228 }, { "name": "大化瑶族自治县", "pid": 451200, "id": 451229 }, { "name": "宜州市", "pid": 451200, "id": 451281 }], "name": "河池市", "pid": 450000, "id": 451200 }, { "districtList": [{ "name": "市辖区", "pid": 451300, "id": 451301 }, { "name": "兴宾区", "pid": 451300, "id": 451302 }, { "name": "忻城县", "pid": 451300, "id": 451321 }, { "name": "象州县", "pid": 451300, "id": 451322 }, { "name": "武宣县", "pid": 451300, "id": 451323 }, { "name": "金秀瑶族自治县", "pid": 451300, "id": 451324 }, { "name": "合山市", "pid": 451300, "id": 451381 }], "name": "来宾市", "pid": 450000, "id": 451300 }, { "districtList": [{ "name": "市辖区", "pid": 451400, "id": 451401 }, { "name": "江州区", "pid": 451400, "id": 451402 }, { "name": "扶绥县", "pid": 451400, "id": 451421 }, { "name": "宁明县", "pid": 451400, "id": 451422 }, { "name": "龙州县", "pid": 451400, "id": 451423 }, { "name": "大新县", "pid": 451400, "id": 451424 }, { "name": "天等县", "pid": 451400, "id": 451425 }, { "name": "凭祥市", "pid": 451400, "id": 451481 }], "name": "崇左市", "pid": 450000, "id": 451400 }] }, { "name": "海南省", "id": 460000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 460100, "id": 460101 }, { "name": "秀英区", "pid": 460100, "id": 460105 }, { "name": "龙华区", "pid": 460100, "id": 460106 }, { "name": "琼山区", "pid": 460100, "id": 460107 }, { "name": "美兰区", "pid": 460100, "id": 460108 }], "name": "海口市", "pid": 460000, "id": 460100 }, { "districtList": [{ "name": "市辖区", "pid": 460200, "id": 460201 }], "name": "三亚市", "pid": 460000, "id": 460200 }, { "districtList": [{ "name": "西沙群岛", "pid": 460300, "id": 460321 }, { "name": "南沙群岛", "pid": 460300, "id": 460322 }, { "name": "中沙群岛的岛礁及其海域", "pid": 460300, "id": 460323 }], "name": "三沙市", "pid": 460000, "id": 460300 }, { "districtList": [{ "name": "五指山市", "pid": 469000, "id": 469001 }, { "name": "琼海市", "pid": 469000, "id": 469002 }, { "name": "儋州市", "pid": 469000, "id": 469003 }, { "name": "文昌市", "pid": 469000, "id": 469005 }, { "name": "万宁市", "pid": 469000, "id": 469006 }, { "name": "东方市", "pid": 469000, "id": 469007 }, { "name": "定安县", "pid": 469000, "id": 469021 }, { "name": "屯昌县", "pid": 469000, "id": 469022 }, { "name": "澄迈县", "pid": 469000, "id": 469023 }, { "name": "临高县", "pid": 469000, "id": 469024 }, { "name": "白沙黎族自治县", "pid": 469000, "id": 469025 }, { "name": "昌江黎族自治县", "pid": 469000, "id": 469026 }, { "name": "乐东黎族自治县", "pid": 469000, "id": 469027 }, { "name": "陵水黎族自治县", "pid": 469000, "id": 469028 }, { "name": "保亭黎族苗族自治县", "pid": 469000, "id": 469029 }, { "name": "琼中黎族苗族自治县", "pid": 469000, "id": 469030 }], "name": "省直辖县级行政区划", "pid": 460000, "id": 469000 }] }, { "name": "重庆市", "id": 500000, "cityList": [{ "districtList": [], "name": "万州区", "pid": 500000, "id": 500101 }, { "districtList": [], "name": "涪陵区", "pid": 500000, "id": 500102 }, { "districtList": [], "name": "渝中区", "pid": 500000, "id": 500103 }, { "districtList": [], "name": "大渡口区", "pid": 500000, "id": 500104 }, { "districtList": [], "name": "江北区", "pid": 500000, "id": 500105 }, { "districtList": [], "name": "沙坪坝区", "pid": 500000, "id": 500106 }, { "districtList": [], "name": "九龙坡区", "pid": 500000, "id": 500107 }, { "districtList": [], "name": "南岸区", "pid": 500000, "id": 500108 }, { "districtList": [], "name": "北碚区", "pid": 500000, "id": 500109 }, { "districtList": [], "name": "綦江区", "pid": 500000, "id": 500110 }, { "districtList": [], "name": "大足区", "pid": 500000, "id": 500111 }, { "districtList": [], "name": "渝北区", "pid": 500000, "id": 500112 }, { "districtList": [], "name": "巴南区", "pid": 500000, "id": 500113 }, { "districtList": [], "name": "黔江区", "pid": 500000, "id": 500114 }, { "districtList": [], "name": "长寿区", "pid": 500000, "id": 500115 }, { "districtList": [], "name": "江津区", "pid": 500000, "id": 500116 }, { "districtList": [], "name": "合川区", "pid": 500000, "id": 500117 }, { "districtList": [], "name": "永川区", "pid": 500000, "id": 500118 }, { "districtList": [], "name": "南川区", "pid": 500000, "id": 500119 }, { "districtList": [], "name": "潼南县", "pid": 500000, "id": 500223 }, { "districtList": [], "name": "铜梁县", "pid": 500000, "id": 500224 }, { "districtList": [], "name": "荣昌县", "pid": 500000, "id": 500226 }, { "districtList": [], "name": "璧山县", "pid": 500000, "id": 500227 }, { "districtList": [], "name": "梁平县", "pid": 500000, "id": 500228 }, { "districtList": [], "name": "城口县", "pid": 500000, "id": 500229 }, { "districtList": [], "name": "丰都县", "pid": 500000, "id": 500230 }, { "districtList": [], "name": "垫江县", "pid": 500000, "id": 500231 }, { "districtList": [], "name": "武隆县", "pid": 500000, "id": 500232 }, { "districtList": [], "name": "忠县", "pid": 500000, "id": 500233 }, { "districtList": [], "name": "开县", "pid": 500000, "id": 500234 }, { "districtList": [], "name": "云阳县", "pid": 500000, "id": 500235 }, { "districtList": [], "name": "奉节县", "pid": 500000, "id": 500236 }, { "districtList": [], "name": "巫山县", "pid": 500000, "id": 500237 }, { "districtList": [], "name": "巫溪县", "pid": 500000, "id": 500238 }, { "districtList": [], "name": "石柱土家族自治县", "pid": 500000, "id": 500240 }, { "districtList": [], "name": "秀山土家族苗族自治县", "pid": 500000, "id": 500241 }, { "districtList": [], "name": "酉阳土家族苗族自治县", "pid": 500000, "id": 500242 }, { "districtList": [], "name": "彭水苗族土家族自治县", "pid": 500000, "id": 500243 }] }, { "name": "四川省", "id": 510000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 510100, "id": 510101 }, { "name": "锦江区", "pid": 510100, "id": 510104 }, { "name": "青羊区", "pid": 510100, "id": 510105 }, { "name": "金牛区", "pid": 510100, "id": 510106 }, { "name": "武侯区", "pid": 510100, "id": 510107 }, { "name": "成华区", "pid": 510100, "id": 510108 }, { "name": "龙泉驿区", "pid": 510100, "id": 510112 }, { "name": "青白江区", "pid": 510100, "id": 510113 }, { "name": "新都区", "pid": 510100, "id": 510114 }, { "name": "温江区", "pid": 510100, "id": 510115 }, { "name": "金堂县", "pid": 510100, "id": 510121 }, { "name": "双流县", "pid": 510100, "id": 510122 }, { "name": "郫县", "pid": 510100, "id": 510124 }, { "name": "大邑县", "pid": 510100, "id": 510129 }, { "name": "蒲江县", "pid": 510100, "id": 510131 }, { "name": "新津县", "pid": 510100, "id": 510132 }, { "name": "都江堰市", "pid": 510100, "id": 510181 }, { "name": "彭州市", "pid": 510100, "id": 510182 }, { "name": "邛崃市", "pid": 510100, "id": 510183 }, { "name": "崇州市", "pid": 510100, "id": 510184 }], "name": "成都市", "pid": 510000, "id": 510100 }, { "districtList": [{ "name": "市辖区", "pid": 510300, "id": 510301 }, { "name": "自流井区", "pid": 510300, "id": 510302 }, { "name": "贡井区", "pid": 510300, "id": 510303 }, { "name": "大安区", "pid": 510300, "id": 510304 }, { "name": "沿滩区", "pid": 510300, "id": 510311 }, { "name": "荣县", "pid": 510300, "id": 510321 }, { "name": "富顺县", "pid": 510300, "id": 510322 }], "name": "自贡市", "pid": 510000, "id": 510300 }, { "districtList": [{ "name": "市辖区", "pid": 510400, "id": 510401 }, { "name": "东区", "pid": 510400, "id": 510402 }, { "name": "西区", "pid": 510400, "id": 510403 }, { "name": "仁和区", "pid": 510400, "id": 510411 }, { "name": "米易县", "pid": 510400, "id": 510421 }, { "name": "盐边县", "pid": 510400, "id": 510422 }], "name": "攀枝花市", "pid": 510000, "id": 510400 }, { "districtList": [{ "name": "市辖区", "pid": 510500, "id": 510501 }, { "name": "江阳区", "pid": 510500, "id": 510502 }, { "name": "纳溪区", "pid": 510500, "id": 510503 }, { "name": "龙马潭区", "pid": 510500, "id": 510504 }, { "name": "泸县", "pid": 510500, "id": 510521 }, { "name": "合江县", "pid": 510500, "id": 510522 }, { "name": "叙永县", "pid": 510500, "id": 510524 }, { "name": "古蔺县", "pid": 510500, "id": 510525 }], "name": "泸州市", "pid": 510000, "id": 510500 }, { "districtList": [{ "name": "市辖区", "pid": 510600, "id": 510601 }, { "name": "旌阳区", "pid": 510600, "id": 510603 }, { "name": "中江县", "pid": 510600, "id": 510623 }, { "name": "罗江县", "pid": 510600, "id": 510626 }, { "name": "广汉市", "pid": 510600, "id": 510681 }, { "name": "什邡市", "pid": 510600, "id": 510682 }, { "name": "绵竹市", "pid": 510600, "id": 510683 }], "name": "德阳市", "pid": 510000, "id": 510600 }, { "districtList": [{ "name": "市辖区", "pid": 510700, "id": 510701 }, { "name": "涪城区", "pid": 510700, "id": 510703 }, { "name": "游仙区", "pid": 510700, "id": 510704 }, { "name": "三台县", "pid": 510700, "id": 510722 }, { "name": "盐亭县", "pid": 510700, "id": 510723 }, { "name": "安县", "pid": 510700, "id": 510724 }, { "name": "梓潼县", "pid": 510700, "id": 510725 }, { "name": "北川羌族自治县", "pid": 510700, "id": 510726 }, { "name": "平武县", "pid": 510700, "id": 510727 }, { "name": "江油市", "pid": 510700, "id": 510781 }], "name": "绵阳市", "pid": 510000, "id": 510700 }, { "districtList": [{ "name": "市辖区", "pid": 510800, "id": 510801 }, { "name": "利州区", "pid": 510800, "id": 510802 }, { "name": "元坝区", "pid": 510800, "id": 510811 }, { "name": "朝天区", "pid": 510800, "id": 510812 }, { "name": "旺苍县", "pid": 510800, "id": 510821 }, { "name": "青川县", "pid": 510800, "id": 510822 }, { "name": "剑阁县", "pid": 510800, "id": 510823 }, { "name": "苍溪县", "pid": 510800, "id": 510824 }], "name": "广元市", "pid": 510000, "id": 510800 }, { "districtList": [{ "name": "市辖区", "pid": 510900, "id": 510901 }, { "name": "船山区", "pid": 510900, "id": 510903 }, { "name": "安居区", "pid": 510900, "id": 510904 }, { "name": "蓬溪县", "pid": 510900, "id": 510921 }, { "name": "射洪县", "pid": 510900, "id": 510922 }, { "name": "大英县", "pid": 510900, "id": 510923 }], "name": "遂宁市", "pid": 510000, "id": 510900 }, { "districtList": [{ "name": "市辖区", "pid": 511000, "id": 511001 }, { "name": "市中区", "pid": 511000, "id": 511002 }, { "name": "东兴区", "pid": 511000, "id": 511011 }, { "name": "威远县", "pid": 511000, "id": 511024 }, { "name": "资中县", "pid": 511000, "id": 511025 }, { "name": "隆昌县", "pid": 511000, "id": 511028 }], "name": "内江市", "pid": 510000, "id": 511000 }, { "districtList": [{ "name": "市辖区", "pid": 511100, "id": 511101 }, { "name": "市中区", "pid": 511100, "id": 511102 }, { "name": "沙湾区", "pid": 511100, "id": 511111 }, { "name": "五通桥区", "pid": 511100, "id": 511112 }, { "name": "金口河区", "pid": 511100, "id": 511113 }, { "name": "犍为县", "pid": 511100, "id": 511123 }, { "name": "井研县", "pid": 511100, "id": 511124 }, { "name": "夹江县", "pid": 511100, "id": 511126 }, { "name": "沐川县", "pid": 511100, "id": 511129 }, { "name": "峨边彝族自治县", "pid": 511100, "id": 511132 }, { "name": "马边彝族自治县", "pid": 511100, "id": 511133 }, { "name": "峨眉山市", "pid": 511100, "id": 511181 }], "name": "乐山市", "pid": 510000, "id": 511100 }, { "districtList": [{ "name": "市辖区", "pid": 511300, "id": 511301 }, { "name": "顺庆区", "pid": 511300, "id": 511302 }, { "name": "高坪区", "pid": 511300, "id": 511303 }, { "name": "嘉陵区", "pid": 511300, "id": 511304 }, { "name": "南部县", "pid": 511300, "id": 511321 }, { "name": "营山县", "pid": 511300, "id": 511322 }, { "name": "蓬安县", "pid": 511300, "id": 511323 }, { "name": "仪陇县", "pid": 511300, "id": 511324 }, { "name": "西充县", "pid": 511300, "id": 511325 }, { "name": "阆中市", "pid": 511300, "id": 511381 }], "name": "南充市", "pid": 510000, "id": 511300 }, { "districtList": [{ "name": "市辖区", "pid": 511400, "id": 511401 }, { "name": "东坡区", "pid": 511400, "id": 511402 }, { "name": "仁寿县", "pid": 511400, "id": 511421 }, { "name": "彭山县", "pid": 511400, "id": 511422 }, { "name": "洪雅县", "pid": 511400, "id": 511423 }, { "name": "丹棱县", "pid": 511400, "id": 511424 }, { "name": "青神县", "pid": 511400, "id": 511425 }], "name": "眉山市", "pid": 510000, "id": 511400 }, { "districtList": [{ "name": "市辖区", "pid": 511500, "id": 511501 }, { "name": "翠屏区", "pid": 511500, "id": 511502 }, { "name": "南溪区", "pid": 511500, "id": 511503 }, { "name": "宜宾县", "pid": 511500, "id": 511521 }, { "name": "江安县", "pid": 511500, "id": 511523 }, { "name": "长宁县", "pid": 511500, "id": 511524 }, { "name": "高县", "pid": 511500, "id": 511525 }, { "name": "珙县", "pid": 511500, "id": 511526 }, { "name": "筠连县", "pid": 511500, "id": 511527 }, { "name": "兴文县", "pid": 511500, "id": 511528 }, { "name": "屏山县", "pid": 511500, "id": 511529 }], "name": "宜宾市", "pid": 510000, "id": 511500 }, { "districtList": [{ "name": "市辖区", "pid": 511600, "id": 511601 }, { "name": "广安区", "pid": 511600, "id": 511602 }, { "name": "前锋区", "pid": 511600, "id": 511603 }, { "name": "岳池县", "pid": 511600, "id": 511621 }, { "name": "武胜县", "pid": 511600, "id": 511622 }, { "name": "邻水县", "pid": 511600, "id": 511623 }, { "name": "华蓥市", "pid": 511600, "id": 511681 }], "name": "广安市", "pid": 510000, "id": 511600 }, { "districtList": [{ "name": "市辖区", "pid": 511700, "id": 511701 }, { "name": "通川区", "pid": 511700, "id": 511702 }, { "name": "达川区", "pid": 511700, "id": 511703 }, { "name": "宣汉县", "pid": 511700, "id": 511722 }, { "name": "开江县", "pid": 511700, "id": 511723 }, { "name": "大竹县", "pid": 511700, "id": 511724 }, { "name": "渠县", "pid": 511700, "id": 511725 }, { "name": "万源市", "pid": 511700, "id": 511781 }], "name": "达州市", "pid": 510000, "id": 511700 }, { "districtList": [{ "name": "市辖区", "pid": 511800, "id": 511801 }, { "name": "雨城区", "pid": 511800, "id": 511802 }, { "name": "名山区", "pid": 511800, "id": 511803 }, { "name": "荥经县", "pid": 511800, "id": 511822 }, { "name": "汉源县", "pid": 511800, "id": 511823 }, { "name": "石棉县", "pid": 511800, "id": 511824 }, { "name": "天全县", "pid": 511800, "id": 511825 }, { "name": "芦山县", "pid": 511800, "id": 511826 }, { "name": "宝兴县", "pid": 511800, "id": 511827 }], "name": "雅安市", "pid": 510000, "id": 511800 }, { "districtList": [{ "name": "市辖区", "pid": 511900, "id": 511901 }, { "name": "巴州区", "pid": 511900, "id": 511902 }, { "name": "恩阳区", "pid": 511900, "id": 511903 }, { "name": "通江县", "pid": 511900, "id": 511921 }, { "name": "南江县", "pid": 511900, "id": 511922 }, { "name": "平昌县", "pid": 511900, "id": 511923 }], "name": "巴中市", "pid": 510000, "id": 511900 }, { "districtList": [{ "name": "市辖区", "pid": 512000, "id": 512001 }, { "name": "雁江区", "pid": 512000, "id": 512002 }, { "name": "安岳县", "pid": 512000, "id": 512021 }, { "name": "乐至县", "pid": 512000, "id": 512022 }, { "name": "简阳市", "pid": 512000, "id": 512081 }], "name": "资阳市", "pid": 510000, "id": 512000 }, { "districtList": [{ "name": "汶川县", "pid": 513200, "id": 513221 }, { "name": "理县", "pid": 513200, "id": 513222 }, { "name": "茂县", "pid": 513200, "id": 513223 }, { "name": "松潘县", "pid": 513200, "id": 513224 }, { "name": "九寨沟县", "pid": 513200, "id": 513225 }, { "name": "金川县", "pid": 513200, "id": 513226 }, { "name": "小金县", "pid": 513200, "id": 513227 }, { "name": "黑水县", "pid": 513200, "id": 513228 }, { "name": "马尔康县", "pid": 513200, "id": 513229 }, { "name": "壤塘县", "pid": 513200, "id": 513230 }, { "name": "阿坝县", "pid": 513200, "id": 513231 }, { "name": "若尔盖县", "pid": 513200, "id": 513232 }, { "name": "红原县", "pid": 513200, "id": 513233 }], "name": "阿坝藏族羌族自治州", "pid": 510000, "id": 513200 }, { "districtList": [{ "name": "康定县", "pid": 513300, "id": 513321 }, { "name": "泸定县", "pid": 513300, "id": 513322 }, { "name": "丹巴县", "pid": 513300, "id": 513323 }, { "name": "九龙县", "pid": 513300, "id": 513324 }, { "name": "雅江县", "pid": 513300, "id": 513325 }, { "name": "道孚县", "pid": 513300, "id": 513326 }, { "name": "炉霍县", "pid": 513300, "id": 513327 }, { "name": "甘孜县", "pid": 513300, "id": 513328 }, { "name": "新龙县", "pid": 513300, "id": 513329 }, { "name": "德格县", "pid": 513300, "id": 513330 }, { "name": "白玉县", "pid": 513300, "id": 513331 }, { "name": "石渠县", "pid": 513300, "id": 513332 }, { "name": "色达县", "pid": 513300, "id": 513333 }, { "name": "理塘县", "pid": 513300, "id": 513334 }, { "name": "巴塘县", "pid": 513300, "id": 513335 }, { "name": "乡城县", "pid": 513300, "id": 513336 }, { "name": "稻城县", "pid": 513300, "id": 513337 }, { "name": "得荣县", "pid": 513300, "id": 513338 }], "name": "甘孜藏族自治州", "pid": 510000, "id": 513300 }, { "districtList": [{ "name": "西昌市", "pid": 513400, "id": 513401 }, { "name": "木里藏族自治县", "pid": 513400, "id": 513422 }, { "name": "盐源县", "pid": 513400, "id": 513423 }, { "name": "德昌县", "pid": 513400, "id": 513424 }, { "name": "会理县", "pid": 513400, "id": 513425 }, { "name": "会东县", "pid": 513400, "id": 513426 }, { "name": "宁南县", "pid": 513400, "id": 513427 }, { "name": "普格县", "pid": 513400, "id": 513428 }, { "name": "布拖县", "pid": 513400, "id": 513429 }, { "name": "金阳县", "pid": 513400, "id": 513430 }, { "name": "昭觉县", "pid": 513400, "id": 513431 }, { "name": "喜德县", "pid": 513400, "id": 513432 }, { "name": "冕宁县", "pid": 513400, "id": 513433 }, { "name": "越西县", "pid": 513400, "id": 513434 }, { "name": "甘洛县", "pid": 513400, "id": 513435 }, { "name": "美姑县", "pid": 513400, "id": 513436 }, { "name": "雷波县", "pid": 513400, "id": 513437 }], "name": "凉山彝族自治州", "pid": 510000, "id": 513400 }] }, { "name": "贵州省", "id": 520000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 520100, "id": 520101 }, { "name": "南明区", "pid": 520100, "id": 520102 }, { "name": "云岩区", "pid": 520100, "id": 520103 }, { "name": "花溪区", "pid": 520100, "id": 520111 }, { "name": "乌当区", "pid": 520100, "id": 520112 }, { "name": "白云区", "pid": 520100, "id": 520113 }, { "name": "观山湖区", "pid": 520100, "id": 520115 }, { "name": "开阳县", "pid": 520100, "id": 520121 }, { "name": "息烽县", "pid": 520100, "id": 520122 }, { "name": "修文县", "pid": 520100, "id": 520123 }, { "name": "清镇市", "pid": 520100, "id": 520181 }], "name": "贵阳市", "pid": 520000, "id": 520100 }, { "districtList": [{ "name": "钟山区", "pid": 520200, "id": 520201 }, { "name": "六枝特区", "pid": 520200, "id": 520203 }, { "name": "水城县", "pid": 520200, "id": 520221 }, { "name": "盘县", "pid": 520200, "id": 520222 }], "name": "六盘水市", "pid": 520000, "id": 520200 }, { "districtList": [{ "name": "市辖区", "pid": 520300, "id": 520301 }, { "name": "红花岗区", "pid": 520300, "id": 520302 }, { "name": "汇川区", "pid": 520300, "id": 520303 }, { "name": "遵义县", "pid": 520300, "id": 520321 }, { "name": "桐梓县", "pid": 520300, "id": 520322 }, { "name": "绥阳县", "pid": 520300, "id": 520323 }, { "name": "正安县", "pid": 520300, "id": 520324 }, { "name": "道真仡佬族苗族自治县", "pid": 520300, "id": 520325 }, { "name": "务川仡佬族苗族自治县", "pid": 520300, "id": 520326 }, { "name": "凤冈县", "pid": 520300, "id": 520327 }, { "name": "湄潭县", "pid": 520300, "id": 520328 }, { "name": "余庆县", "pid": 520300, "id": 520329 }, { "name": "习水县", "pid": 520300, "id": 520330 }, { "name": "赤水市", "pid": 520300, "id": 520381 }, { "name": "仁怀市", "pid": 520300, "id": 520382 }], "name": "遵义市", "pid": 520000, "id": 520300 }, { "districtList": [{ "name": "市辖区", "pid": 520400, "id": 520401 }, { "name": "西秀区", "pid": 520400, "id": 520402 }, { "name": "平坝县", "pid": 520400, "id": 520421 }, { "name": "普定县", "pid": 520400, "id": 520422 }, { "name": "镇宁布依族苗族自治县", "pid": 520400, "id": 520423 }, { "name": "关岭布依族苗族自治县", "pid": 520400, "id": 520424 }, { "name": "紫云苗族布依族自治县", "pid": 520400, "id": 520425 }], "name": "安顺市", "pid": 520000, "id": 520400 }, { "districtList": [{ "name": "市辖区", "pid": 520500, "id": 520501 }, { "name": "七星关区", "pid": 520500, "id": 520502 }, { "name": "大方县", "pid": 520500, "id": 520521 }, { "name": "黔西县", "pid": 520500, "id": 520522 }, { "name": "金沙县", "pid": 520500, "id": 520523 }, { "name": "织金县", "pid": 520500, "id": 520524 }, { "name": "纳雍县", "pid": 520500, "id": 520525 }, { "name": "威宁彝族回族苗族自治县", "pid": 520500, "id": 520526 }, { "name": "赫章县", "pid": 520500, "id": 520527 }], "name": "毕节市", "pid": 520000, "id": 520500 }, { "districtList": [{ "name": "市辖区", "pid": 520600, "id": 520601 }, { "name": "碧江区", "pid": 520600, "id": 520602 }, { "name": "万山区", "pid": 520600, "id": 520603 }, { "name": "江口县", "pid": 520600, "id": 520621 }, { "name": "玉屏侗族自治县", "pid": 520600, "id": 520622 }, { "name": "石阡县", "pid": 520600, "id": 520623 }, { "name": "思南县", "pid": 520600, "id": 520624 }, { "name": "印江土家族苗族自治县", "pid": 520600, "id": 520625 }, { "name": "德江县", "pid": 520600, "id": 520626 }, { "name": "沿河土家族自治县", "pid": 520600, "id": 520627 }, { "name": "松桃苗族自治县", "pid": 520600, "id": 520628 }], "name": "铜仁市", "pid": 520000, "id": 520600 }, { "districtList": [{ "name": "兴义市", "pid": 522300, "id": 522301 }, { "name": "兴仁县", "pid": 522300, "id": 522322 }, { "name": "普安县", "pid": 522300, "id": 522323 }, { "name": "晴隆县", "pid": 522300, "id": 522324 }, { "name": "贞丰县", "pid": 522300, "id": 522325 }, { "name": "望谟县", "pid": 522300, "id": 522326 }, { "name": "册亨县", "pid": 522300, "id": 522327 }, { "name": "安龙县", "pid": 522300, "id": 522328 }], "name": "黔西南布依族苗族自治州", "pid": 520000, "id": 522300 }, { "districtList": [{ "name": "凯里市", "pid": 522600, "id": 522601 }, { "name": "黄平县", "pid": 522600, "id": 522622 }, { "name": "施秉县", "pid": 522600, "id": 522623 }, { "name": "三穗县", "pid": 522600, "id": 522624 }, { "name": "镇远县", "pid": 522600, "id": 522625 }, { "name": "岑巩县", "pid": 522600, "id": 522626 }, { "name": "天柱县", "pid": 522600, "id": 522627 }, { "name": "锦屏县", "pid": 522600, "id": 522628 }, { "name": "剑河县", "pid": 522600, "id": 522629 }, { "name": "台江县", "pid": 522600, "id": 522630 }, { "name": "黎平县", "pid": 522600, "id": 522631 }, { "name": "榕江县", "pid": 522600, "id": 522632 }, { "name": "从江县", "pid": 522600, "id": 522633 }, { "name": "雷山县", "pid": 522600, "id": 522634 }, { "name": "麻江县", "pid": 522600, "id": 522635 }, { "name": "丹寨县", "pid": 522600, "id": 522636 }], "name": "黔东南苗族侗族自治州", "pid": 520000, "id": 522600 }, { "districtList": [{ "name": "都匀市", "pid": 522700, "id": 522701 }, { "name": "福泉市", "pid": 522700, "id": 522702 }, { "name": "荔波县", "pid": 522700, "id": 522722 }, { "name": "贵定县", "pid": 522700, "id": 522723 }, { "name": "瓮安县", "pid": 522700, "id": 522725 }, { "name": "独山县", "pid": 522700, "id": 522726 }, { "name": "平塘县", "pid": 522700, "id": 522727 }, { "name": "罗甸县", "pid": 522700, "id": 522728 }, { "name": "长顺县", "pid": 522700, "id": 522729 }, { "name": "龙里县", "pid": 522700, "id": 522730 }, { "name": "惠水县", "pid": 522700, "id": 522731 }, { "name": "三都水族自治县", "pid": 522700, "id": 522732 }], "name": "黔南布依族苗族自治州", "pid": 520000, "id": 522700 }] }, { "name": "云南省", "id": 530000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 530100, "id": 530101 }, { "name": "五华区", "pid": 530100, "id": 530102 }, { "name": "盘龙区", "pid": 530100, "id": 530103 }, { "name": "官渡区", "pid": 530100, "id": 530111 }, { "name": "西山区", "pid": 530100, "id": 530112 }, { "name": "东川区", "pid": 530100, "id": 530113 }, { "name": "呈贡区", "pid": 530100, "id": 530114 }, { "name": "晋宁县", "pid": 530100, "id": 530122 }, { "name": "富民县", "pid": 530100, "id": 530124 }, { "name": "宜良县", "pid": 530100, "id": 530125 }, { "name": "石林彝族自治县", "pid": 530100, "id": 530126 }, { "name": "嵩明县", "pid": 530100, "id": 530127 }, { "name": "禄劝彝族苗族自治县", "pid": 530100, "id": 530128 }, { "name": "寻甸回族彝族自治县", "pid": 530100, "id": 530129 }, { "name": "安宁市", "pid": 530100, "id": 530181 }], "name": "昆明市", "pid": 530000, "id": 530100 }, { "districtList": [{ "name": "市辖区", "pid": 530300, "id": 530301 }, { "name": "麒麟区", "pid": 530300, "id": 530302 }, { "name": "马龙县", "pid": 530300, "id": 530321 }, { "name": "陆良县", "pid": 530300, "id": 530322 }, { "name": "师宗县", "pid": 530300, "id": 530323 }, { "name": "罗平县", "pid": 530300, "id": 530324 }, { "name": "富源县", "pid": 530300, "id": 530325 }, { "name": "会泽县", "pid": 530300, "id": 530326 }, { "name": "沾益县", "pid": 530300, "id": 530328 }, { "name": "宣威市", "pid": 530300, "id": 530381 }], "name": "曲靖市", "pid": 530000, "id": 530300 }, { "districtList": [{ "name": "市辖区", "pid": 530400, "id": 530401 }, { "name": "红塔区", "pid": 530400, "id": 530402 }, { "name": "江川县", "pid": 530400, "id": 530421 }, { "name": "澄江县", "pid": 530400, "id": 530422 }, { "name": "通海县", "pid": 530400, "id": 530423 }, { "name": "华宁县", "pid": 530400, "id": 530424 }, { "name": "易门县", "pid": 530400, "id": 530425 }, { "name": "峨山彝族自治县", "pid": 530400, "id": 530426 }, { "name": "新平彝族傣族自治县", "pid": 530400, "id": 530427 }, { "name": "元江哈尼族彝族傣族自治县", "pid": 530400, "id": 530428 }], "name": "玉溪市", "pid": 530000, "id": 530400 }, { "districtList": [{ "name": "市辖区", "pid": 530500, "id": 530501 }, { "name": "隆阳区", "pid": 530500, "id": 530502 }, { "name": "施甸县", "pid": 530500, "id": 530521 }, { "name": "腾冲县", "pid": 530500, "id": 530522 }, { "name": "龙陵县", "pid": 530500, "id": 530523 }, { "name": "昌宁县", "pid": 530500, "id": 530524 }], "name": "保山市", "pid": 530000, "id": 530500 }, { "districtList": [{ "name": "市辖区", "pid": 530600, "id": 530601 }, { "name": "昭阳区", "pid": 530600, "id": 530602 }, { "name": "鲁甸县", "pid": 530600, "id": 530621 }, { "name": "巧家县", "pid": 530600, "id": 530622 }, { "name": "盐津县", "pid": 530600, "id": 530623 }, { "name": "大关县", "pid": 530600, "id": 530624 }, { "name": "永善县", "pid": 530600, "id": 530625 }, { "name": "绥江县", "pid": 530600, "id": 530626 }, { "name": "镇雄县", "pid": 530600, "id": 530627 }, { "name": "彝良县", "pid": 530600, "id": 530628 }, { "name": "威信县", "pid": 530600, "id": 530629 }, { "name": "水富县", "pid": 530600, "id": 530630 }], "name": "昭通市", "pid": 530000, "id": 530600 }, { "districtList": [{ "name": "市辖区", "pid": 530700, "id": 530701 }, { "name": "古城区", "pid": 530700, "id": 530702 }, { "name": "玉龙纳西族自治县", "pid": 530700, "id": 530721 }, { "name": "永胜县", "pid": 530700, "id": 530722 }, { "name": "华坪县", "pid": 530700, "id": 530723 }, { "name": "宁蒗彝族自治县", "pid": 530700, "id": 530724 }], "name": "丽江市", "pid": 530000, "id": 530700 }, { "districtList": [{ "name": "市辖区", "pid": 530800, "id": 530801 }, { "name": "思茅区", "pid": 530800, "id": 530802 }, { "name": "宁洱哈尼族彝族自治县", "pid": 530800, "id": 530821 }, { "name": "墨江哈尼族自治县", "pid": 530800, "id": 530822 }, { "name": "景东彝族自治县", "pid": 530800, "id": 530823 }, { "name": "景谷傣族彝族自治县", "pid": 530800, "id": 530824 }, { "name": "镇沅彝族哈尼族拉祜族自治县", "pid": 530800, "id": 530825 }, { "name": "江城哈尼族彝族自治县", "pid": 530800, "id": 530826 }, { "name": "孟连傣族拉祜族佤族自治县", "pid": 530800, "id": 530827 }, { "name": "澜沧拉祜族自治县", "pid": 530800, "id": 530828 }, { "name": "西盟佤族自治县", "pid": 530800, "id": 530829 }], "name": "普洱市", "pid": 530000, "id": 530800 }, { "districtList": [{ "name": "市辖区", "pid": 530900, "id": 530901 }, { "name": "临翔区", "pid": 530900, "id": 530902 }, { "name": "凤庆县", "pid": 530900, "id": 530921 }, { "name": "云县", "pid": 530900, "id": 530922 }, { "name": "永德县", "pid": 530900, "id": 530923 }, { "name": "镇康县", "pid": 530900, "id": 530924 }, { "name": "双江拉祜族佤族布朗族傣族自治县", "pid": 530900, "id": 530925 }, { "name": "耿马傣族佤族自治县", "pid": 530900, "id": 530926 }, { "name": "沧源佤族自治县", "pid": 530900, "id": 530927 }], "name": "临沧市", "pid": 530000, "id": 530900 }, { "districtList": [{ "name": "楚雄市", "pid": 532300, "id": 532301 }, { "name": "双柏县", "pid": 532300, "id": 532322 }, { "name": "牟定县", "pid": 532300, "id": 532323 }, { "name": "南华县", "pid": 532300, "id": 532324 }, { "name": "姚安县", "pid": 532300, "id": 532325 }, { "name": "大姚县", "pid": 532300, "id": 532326 }, { "name": "永仁县", "pid": 532300, "id": 532327 }, { "name": "元谋县", "pid": 532300, "id": 532328 }, { "name": "武定县", "pid": 532300, "id": 532329 }, { "name": "禄丰县", "pid": 532300, "id": 532331 }], "name": "楚雄彝族自治州", "pid": 530000, "id": 532300 }, { "districtList": [{ "name": "个旧市", "pid": 532500, "id": 532501 }, { "name": "开远市", "pid": 532500, "id": 532502 }, { "name": "蒙自市", "pid": 532500, "id": 532503 }, { "name": "弥勒市", "pid": 532500, "id": 532504 }, { "name": "屏边苗族自治县", "pid": 532500, "id": 532523 }, { "name": "建水县", "pid": 532500, "id": 532524 }, { "name": "石屏县", "pid": 532500, "id": 532525 }, { "name": "泸西县", "pid": 532500, "id": 532527 }, { "name": "元阳县", "pid": 532500, "id": 532528 }, { "name": "红河县", "pid": 532500, "id": 532529 }, { "name": "金平苗族瑶族傣族自治县", "pid": 532500, "id": 532530 }, { "name": "绿春县", "pid": 532500, "id": 532531 }, { "name": "河口瑶族自治县", "pid": 532500, "id": 532532 }], "name": "红河哈尼族彝族自治州", "pid": 530000, "id": 532500 }, { "districtList": [{ "name": "文山市", "pid": 532600, "id": 532601 }, { "name": "砚山县", "pid": 532600, "id": 532622 }, { "name": "西畴县", "pid": 532600, "id": 532623 }, { "name": "麻栗坡县", "pid": 532600, "id": 532624 }, { "name": "马关县", "pid": 532600, "id": 532625 }, { "name": "丘北县", "pid": 532600, "id": 532626 }, { "name": "广南县", "pid": 532600, "id": 532627 }, { "name": "富宁县", "pid": 532600, "id": 532628 }], "name": "文山壮族苗族自治州", "pid": 530000, "id": 532600 }, { "districtList": [{ "name": "景洪市", "pid": 532800, "id": 532801 }, { "name": "勐海县", "pid": 532800, "id": 532822 }, { "name": "勐腊县", "pid": 532800, "id": 532823 }], "name": "西双版纳傣族自治州", "pid": 530000, "id": 532800 }, { "districtList": [{ "name": "大理市", "pid": 532900, "id": 532901 }, { "name": "漾濞彝族自治县", "pid": 532900, "id": 532922 }, { "name": "祥云县", "pid": 532900, "id": 532923 }, { "name": "宾川县", "pid": 532900, "id": 532924 }, { "name": "弥渡县", "pid": 532900, "id": 532925 }, { "name": "南涧彝族自治县", "pid": 532900, "id": 532926 }, { "name": "巍山彝族回族自治县", "pid": 532900, "id": 532927 }, { "name": "永平县", "pid": 532900, "id": 532928 }, { "name": "云龙县", "pid": 532900, "id": 532929 }, { "name": "洱源县", "pid": 532900, "id": 532930 }, { "name": "剑川县", "pid": 532900, "id": 532931 }, { "name": "鹤庆县", "pid": 532900, "id": 532932 }], "name": "大理白族自治州", "pid": 530000, "id": 532900 }, { "districtList": [{ "name": "瑞丽市", "pid": 533100, "id": 533102 }, { "name": "芒市", "pid": 533100, "id": 533103 }, { "name": "梁河县", "pid": 533100, "id": 533122 }, { "name": "盈江县", "pid": 533100, "id": 533123 }, { "name": "陇川县", "pid": 533100, "id": 533124 }], "name": "德宏傣族景颇族自治州", "pid": 530000, "id": 533100 }, { "districtList": [{ "name": "泸水县", "pid": 533300, "id": 533321 }, { "name": "福贡县", "pid": 533300, "id": 533323 }, { "name": "贡山独龙族怒族自治县", "pid": 533300, "id": 533324 }, { "name": "兰坪白族普米族自治县", "pid": 533300, "id": 533325 }], "name": "怒江傈僳族自治州", "pid": 530000, "id": 533300 }, { "districtList": [{ "name": "香格里拉县", "pid": 533400, "id": 533421 }, { "name": "德钦县", "pid": 533400, "id": 533422 }, { "name": "维西傈僳族自治县", "pid": 533400, "id": 533423 }], "name": "迪庆藏族自治州", "pid": 530000, "id": 533400 }] }, { "name": "西藏自治区", "id": 540000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 540100, "id": 540101 }, { "name": "城关区", "pid": 540100, "id": 540102 }, { "name": "林周县", "pid": 540100, "id": 540121 }, { "name": "当雄县", "pid": 540100, "id": 540122 }, { "name": "尼木县", "pid": 540100, "id": 540123 }, { "name": "曲水县", "pid": 540100, "id": 540124 }, { "name": "堆龙德庆县", "pid": 540100, "id": 540125 }, { "name": "达孜县", "pid": 540100, "id": 540126 }, { "name": "墨竹工卡县", "pid": 540100, "id": 540127 }], "name": "拉萨市", "pid": 540000, "id": 540100 }, { "districtList": [{ "name": "昌都县", "pid": 542100, "id": 542121 }, { "name": "江达县", "pid": 542100, "id": 542122 }, { "name": "贡觉县", "pid": 542100, "id": 542123 }, { "name": "类乌齐县", "pid": 542100, "id": 542124 }, { "name": "丁青县", "pid": 542100, "id": 542125 }, { "name": "察雅县", "pid": 542100, "id": 542126 }, { "name": "八宿县", "pid": 542100, "id": 542127 }, { "name": "左贡县", "pid": 542100, "id": 542128 }, { "name": "芒康县", "pid": 542100, "id": 542129 }, { "name": "洛隆县", "pid": 542100, "id": 542132 }, { "name": "边坝县", "pid": 542100, "id": 542133 }], "name": "昌都地区", "pid": 540000, "id": 542100 }, { "districtList": [{ "name": "乃东县", "pid": 542200, "id": 542221 }, { "name": "扎囊县", "pid": 542200, "id": 542222 }, { "name": "贡嘎县", "pid": 542200, "id": 542223 }, { "name": "桑日县", "pid": 542200, "id": 542224 }, { "name": "琼结县", "pid": 542200, "id": 542225 }, { "name": "曲松县", "pid": 542200, "id": 542226 }, { "name": "措美县", "pid": 542200, "id": 542227 }, { "name": "洛扎县", "pid": 542200, "id": 542228 }, { "name": "加查县", "pid": 542200, "id": 542229 }, { "name": "隆子县", "pid": 542200, "id": 542231 }, { "name": "错那县", "pid": 542200, "id": 542232 }, { "name": "浪卡子县", "pid": 542200, "id": 542233 }], "name": "山南地区", "pid": 540000, "id": 542200 }, { "districtList": [{ "name": "日喀则市", "pid": 542300, "id": 542301 }, { "name": "南木林县", "pid": 542300, "id": 542322 }, { "name": "江孜县", "pid": 542300, "id": 542323 }, { "name": "定日县", "pid": 542300, "id": 542324 }, { "name": "萨迦县", "pid": 542300, "id": 542325 }, { "name": "拉孜县", "pid": 542300, "id": 542326 }, { "name": "昂仁县", "pid": 542300, "id": 542327 }, { "name": "谢通门县", "pid": 542300, "id": 542328 }, { "name": "白朗县", "pid": 542300, "id": 542329 }, { "name": "仁布县", "pid": 542300, "id": 542330 }, { "name": "康马县", "pid": 542300, "id": 542331 }, { "name": "定结县", "pid": 542300, "id": 542332 }, { "name": "仲巴县", "pid": 542300, "id": 542333 }, { "name": "亚东县", "pid": 542300, "id": 542334 }, { "name": "吉隆县", "pid": 542300, "id": 542335 }, { "name": "聂拉木县", "pid": 542300, "id": 542336 }, { "name": "萨嘎县", "pid": 542300, "id": 542337 }, { "name": "岗巴县", "pid": 542300, "id": 542338 }], "name": "日喀则地区", "pid": 540000, "id": 542300 }, { "districtList": [{ "name": "那曲县", "pid": 542400, "id": 542421 }, { "name": "嘉黎县", "pid": 542400, "id": 542422 }, { "name": "比如县", "pid": 542400, "id": 542423 }, { "name": "聂荣县", "pid": 542400, "id": 542424 }, { "name": "安多县", "pid": 542400, "id": 542425 }, { "name": "申扎县", "pid": 542400, "id": 542426 }, { "name": "索县", "pid": 542400, "id": 542427 }, { "name": "班戈县", "pid": 542400, "id": 542428 }, { "name": "巴青县", "pid": 542400, "id": 542429 }, { "name": "尼玛县", "pid": 542400, "id": 542430 }, { "name": "双湖县", "pid": 542400, "id": 542431 }], "name": "那曲地区", "pid": 540000, "id": 542400 }, { "districtList": [{ "name": "普兰县", "pid": 542500, "id": 542521 }, { "name": "札达县", "pid": 542500, "id": 542522 }, { "name": "噶尔县", "pid": 542500, "id": 542523 }, { "name": "日土县", "pid": 542500, "id": 542524 }, { "name": "革吉县", "pid": 542500, "id": 542525 }, { "name": "改则县", "pid": 542500, "id": 542526 }, { "name": "措勤县", "pid": 542500, "id": 542527 }], "name": "阿里地区", "pid": 540000, "id": 542500 }, { "districtList": [{ "name": "林芝县", "pid": 542600, "id": 542621 }, { "name": "工布江达县", "pid": 542600, "id": 542622 }, { "name": "米林县", "pid": 542600, "id": 542623 }, { "name": "墨脱县", "pid": 542600, "id": 542624 }, { "name": "波密县", "pid": 542600, "id": 542625 }, { "name": "察隅县", "pid": 542600, "id": 542626 }, { "name": "朗县", "pid": 542600, "id": 542627 }], "name": "林芝地区", "pid": 540000, "id": 542600 }] }, { "name": "陕西省", "id": 610000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 610100, "id": 610101 }, { "name": "新城区", "pid": 610100, "id": 610102 }, { "name": "碑林区", "pid": 610100, "id": 610103 }, { "name": "莲湖区", "pid": 610100, "id": 610104 }, { "name": "灞桥区", "pid": 610100, "id": 610111 }, { "name": "未央区", "pid": 610100, "id": 610112 }, { "name": "雁塔区", "pid": 610100, "id": 610113 }, { "name": "阎良区", "pid": 610100, "id": 610114 }, { "name": "临潼区", "pid": 610100, "id": 610115 }, { "name": "长安区", "pid": 610100, "id": 610116 }, { "name": "蓝田县", "pid": 610100, "id": 610122 }, { "name": "周至县", "pid": 610100, "id": 610124 }, { "name": "户县", "pid": 610100, "id": 610125 }, { "name": "高陵县", "pid": 610100, "id": 610126 }], "name": "西安市", "pid": 610000, "id": 610100 }, { "districtList": [{ "name": "市辖区", "pid": 610200, "id": 610201 }, { "name": "王益区", "pid": 610200, "id": 610202 }, { "name": "印台区", "pid": 610200, "id": 610203 }, { "name": "耀州区", "pid": 610200, "id": 610204 }, { "name": "宜君县", "pid": 610200, "id": 610222 }], "name": "铜川市", "pid": 610000, "id": 610200 }, { "districtList": [{ "name": "市辖区", "pid": 610300, "id": 610301 }, { "name": "渭滨区", "pid": 610300, "id": 610302 }, { "name": "金台区", "pid": 610300, "id": 610303 }, { "name": "陈仓区", "pid": 610300, "id": 610304 }, { "name": "凤翔县", "pid": 610300, "id": 610322 }, { "name": "岐山县", "pid": 610300, "id": 610323 }, { "name": "扶风县", "pid": 610300, "id": 610324 }, { "name": "眉县", "pid": 610300, "id": 610326 }, { "name": "陇县", "pid": 610300, "id": 610327 }, { "name": "千阳县", "pid": 610300, "id": 610328 }, { "name": "麟游县", "pid": 610300, "id": 610329 }, { "name": "凤县", "pid": 610300, "id": 610330 }, { "name": "太白县", "pid": 610300, "id": 610331 }], "name": "宝鸡市", "pid": 610000, "id": 610300 }, { "districtList": [{ "name": "市辖区", "pid": 610400, "id": 610401 }, { "name": "秦都区", "pid": 610400, "id": 610402 }, { "name": "杨陵区", "pid": 610400, "id": 610403 }, { "name": "渭城区", "pid": 610400, "id": 610404 }, { "name": "三原县", "pid": 610400, "id": 610422 }, { "name": "泾阳县", "pid": 610400, "id": 610423 }, { "name": "乾县", "pid": 610400, "id": 610424 }, { "name": "礼泉县", "pid": 610400, "id": 610425 }, { "name": "永寿县", "pid": 610400, "id": 610426 }, { "name": "彬县", "pid": 610400, "id": 610427 }, { "name": "长武县", "pid": 610400, "id": 610428 }, { "name": "旬邑县", "pid": 610400, "id": 610429 }, { "name": "淳化县", "pid": 610400, "id": 610430 }, { "name": "武功县", "pid": 610400, "id": 610431 }, { "name": "兴平市", "pid": 610400, "id": 610481 }], "name": "咸阳市", "pid": 610000, "id": 610400 }, { "districtList": [{ "name": "市辖区", "pid": 610500, "id": 610501 }, { "name": "临渭区", "pid": 610500, "id": 610502 }, { "name": "华县", "pid": 610500, "id": 610521 }, { "name": "潼关县", "pid": 610500, "id": 610522 }, { "name": "大荔县", "pid": 610500, "id": 610523 }, { "name": "合阳县", "pid": 610500, "id": 610524 }, { "name": "澄城县", "pid": 610500, "id": 610525 }, { "name": "蒲城县", "pid": 610500, "id": 610526 }, { "name": "白水县", "pid": 610500, "id": 610527 }, { "name": "富平县", "pid": 610500, "id": 610528 }, { "name": "韩城市", "pid": 610500, "id": 610581 }, { "name": "华阴市", "pid": 610500, "id": 610582 }], "name": "渭南市", "pid": 610000, "id": 610500 }, { "districtList": [{ "name": "市辖区", "pid": 610600, "id": 610601 }, { "name": "宝塔区", "pid": 610600, "id": 610602 }, { "name": "延长县", "pid": 610600, "id": 610621 }, { "name": "延川县", "pid": 610600, "id": 610622 }, { "name": "子长县", "pid": 610600, "id": 610623 }, { "name": "安塞县", "pid": 610600, "id": 610624 }, { "name": "志丹县", "pid": 610600, "id": 610625 }, { "name": "吴起县", "pid": 610600, "id": 610626 }, { "name": "甘泉县", "pid": 610600, "id": 610627 }, { "name": "富县", "pid": 610600, "id": 610628 }, { "name": "洛川县", "pid": 610600, "id": 610629 }, { "name": "宜川县", "pid": 610600, "id": 610630 }, { "name": "黄龙县", "pid": 610600, "id": 610631 }, { "name": "黄陵县", "pid": 610600, "id": 610632 }], "name": "延安市", "pid": 610000, "id": 610600 }, { "districtList": [{ "name": "市辖区", "pid": 610700, "id": 610701 }, { "name": "汉台区", "pid": 610700, "id": 610702 }, { "name": "南郑县", "pid": 610700, "id": 610721 }, { "name": "城固县", "pid": 610700, "id": 610722 }, { "name": "洋县", "pid": 610700, "id": 610723 }, { "name": "西乡县", "pid": 610700, "id": 610724 }, { "name": "勉县", "pid": 610700, "id": 610725 }, { "name": "宁强县", "pid": 610700, "id": 610726 }, { "name": "略阳县", "pid": 610700, "id": 610727 }, { "name": "镇巴县", "pid": 610700, "id": 610728 }, { "name": "留坝县", "pid": 610700, "id": 610729 }, { "name": "佛坪县", "pid": 610700, "id": 610730 }], "name": "汉中市", "pid": 610000, "id": 610700 }, { "districtList": [{ "name": "市辖区", "pid": 610800, "id": 610801 }, { "name": "榆阳区", "pid": 610800, "id": 610802 }, { "name": "神木县", "pid": 610800, "id": 610821 }, { "name": "府谷县", "pid": 610800, "id": 610822 }, { "name": "横山县", "pid": 610800, "id": 610823 }, { "name": "靖边县", "pid": 610800, "id": 610824 }, { "name": "定边县", "pid": 610800, "id": 610825 }, { "name": "绥德县", "pid": 610800, "id": 610826 }, { "name": "米脂县", "pid": 610800, "id": 610827 }, { "name": "佳县", "pid": 610800, "id": 610828 }, { "name": "吴堡县", "pid": 610800, "id": 610829 }, { "name": "清涧县", "pid": 610800, "id": 610830 }, { "name": "子洲县", "pid": 610800, "id": 610831 }], "name": "榆林市", "pid": 610000, "id": 610800 }, { "districtList": [{ "name": "市辖区", "pid": 610900, "id": 610901 }, { "name": "汉滨区", "pid": 610900, "id": 610902 }, { "name": "汉阴县", "pid": 610900, "id": 610921 }, { "name": "石泉县", "pid": 610900, "id": 610922 }, { "name": "宁陕县", "pid": 610900, "id": 610923 }, { "name": "紫阳县", "pid": 610900, "id": 610924 }, { "name": "岚皋县", "pid": 610900, "id": 610925 }, { "name": "平利县", "pid": 610900, "id": 610926 }, { "name": "镇坪县", "pid": 610900, "id": 610927 }, { "name": "旬阳县", "pid": 610900, "id": 610928 }, { "name": "白河县", "pid": 610900, "id": 610929 }], "name": "安康市", "pid": 610000, "id": 610900 }, { "districtList": [{ "name": "市辖区", "pid": 611000, "id": 611001 }, { "name": "商州区", "pid": 611000, "id": 611002 }, { "name": "洛南县", "pid": 611000, "id": 611021 }, { "name": "丹凤县", "pid": 611000, "id": 611022 }, { "name": "商南县", "pid": 611000, "id": 611023 }, { "name": "山阳县", "pid": 611000, "id": 611024 }, { "name": "镇安县", "pid": 611000, "id": 611025 }, { "name": "柞水县", "pid": 611000, "id": 611026 }], "name": "商洛市", "pid": 610000, "id": 611000 }] }, { "name": "甘肃省", "id": 620000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 620100, "id": 620101 }, { "name": "城关区", "pid": 620100, "id": 620102 }, { "name": "七里河区", "pid": 620100, "id": 620103 }, { "name": "西固区", "pid": 620100, "id": 620104 }, { "name": "安宁区", "pid": 620100, "id": 620105 }, { "name": "红古区", "pid": 620100, "id": 620111 }, { "name": "永登县", "pid": 620100, "id": 620121 }, { "name": "皋兰县", "pid": 620100, "id": 620122 }, { "name": "榆中县", "pid": 620100, "id": 620123 }], "name": "兰州市", "pid": 620000, "id": 620100 }, { "districtList": [{ "name": "市辖区", "pid": 620200, "id": 620201 }], "name": "嘉峪关市", "pid": 620000, "id": 620200 }, { "districtList": [{ "name": "市辖区", "pid": 620300, "id": 620301 }, { "name": "金川区", "pid": 620300, "id": 620302 }, { "name": "永昌县", "pid": 620300, "id": 620321 }], "name": "金昌市", "pid": 620000, "id": 620300 }, { "districtList": [{ "name": "市辖区", "pid": 620400, "id": 620401 }, { "name": "白银区", "pid": 620400, "id": 620402 }, { "name": "平川区", "pid": 620400, "id": 620403 }, { "name": "靖远县", "pid": 620400, "id": 620421 }, { "name": "会宁县", "pid": 620400, "id": 620422 }, { "name": "景泰县", "pid": 620400, "id": 620423 }], "name": "白银市", "pid": 620000, "id": 620400 }, { "districtList": [{ "name": "市辖区", "pid": 620500, "id": 620501 }, { "name": "秦州区", "pid": 620500, "id": 620502 }, { "name": "麦积区", "pid": 620500, "id": 620503 }, { "name": "清水县", "pid": 620500, "id": 620521 }, { "name": "秦安县", "pid": 620500, "id": 620522 }, { "name": "甘谷县", "pid": 620500, "id": 620523 }, { "name": "武山县", "pid": 620500, "id": 620524 }, { "name": "张家川回族自治县", "pid": 620500, "id": 620525 }], "name": "天水市", "pid": 620000, "id": 620500 }, { "districtList": [{ "name": "市辖区", "pid": 620600, "id": 620601 }, { "name": "凉州区", "pid": 620600, "id": 620602 }, { "name": "民勤县", "pid": 620600, "id": 620621 }, { "name": "古浪县", "pid": 620600, "id": 620622 }, { "name": "天祝藏族自治县", "pid": 620600, "id": 620623 }], "name": "武威市", "pid": 620000, "id": 620600 }, { "districtList": [{ "name": "市辖区", "pid": 620700, "id": 620701 }, { "name": "甘州区", "pid": 620700, "id": 620702 }, { "name": "肃南裕固族自治县", "pid": 620700, "id": 620721 }, { "name": "民乐县", "pid": 620700, "id": 620722 }, { "name": "临泽县", "pid": 620700, "id": 620723 }, { "name": "高台县", "pid": 620700, "id": 620724 }, { "name": "山丹县", "pid": 620700, "id": 620725 }], "name": "张掖市", "pid": 620000, "id": 620700 }, { "districtList": [{ "name": "市辖区", "pid": 620800, "id": 620801 }, { "name": "崆峒区", "pid": 620800, "id": 620802 }, { "name": "泾川县", "pid": 620800, "id": 620821 }, { "name": "灵台县", "pid": 620800, "id": 620822 }, { "name": "崇信县", "pid": 620800, "id": 620823 }, { "name": "华亭县", "pid": 620800, "id": 620824 }, { "name": "庄浪县", "pid": 620800, "id": 620825 }, { "name": "静宁县", "pid": 620800, "id": 620826 }], "name": "平凉市", "pid": 620000, "id": 620800 }, { "districtList": [{ "name": "市辖区", "pid": 620900, "id": 620901 }, { "name": "肃州区", "pid": 620900, "id": 620902 }, { "name": "金塔县", "pid": 620900, "id": 620921 }, { "name": "瓜州县", "pid": 620900, "id": 620922 }, { "name": "肃北蒙古族自治县", "pid": 620900, "id": 620923 }, { "name": "阿克塞哈萨克族自治县", "pid": 620900, "id": 620924 }, { "name": "玉门市", "pid": 620900, "id": 620981 }, { "name": "敦煌市", "pid": 620900, "id": 620982 }], "name": "酒泉市", "pid": 620000, "id": 620900 }, { "districtList": [{ "name": "市辖区", "pid": 621000, "id": 621001 }, { "name": "西峰区", "pid": 621000, "id": 621002 }, { "name": "庆城县", "pid": 621000, "id": 621021 }, { "name": "环县", "pid": 621000, "id": 621022 }, { "name": "华池县", "pid": 621000, "id": 621023 }, { "name": "合水县", "pid": 621000, "id": 621024 }, { "name": "正宁县", "pid": 621000, "id": 621025 }, { "name": "宁县", "pid": 621000, "id": 621026 }, { "name": "镇原县", "pid": 621000, "id": 621027 }], "name": "庆阳市", "pid": 620000, "id": 621000 }, { "districtList": [{ "name": "市辖区", "pid": 621100, "id": 621101 }, { "name": "安定区", "pid": 621100, "id": 621102 }, { "name": "通渭县", "pid": 621100, "id": 621121 }, { "name": "陇西县", "pid": 621100, "id": 621122 }, { "name": "渭源县", "pid": 621100, "id": 621123 }, { "name": "临洮县", "pid": 621100, "id": 621124 }, { "name": "漳县", "pid": 621100, "id": 621125 }, { "name": "岷县", "pid": 621100, "id": 621126 }], "name": "定西市", "pid": 620000, "id": 621100 }, { "districtList": [{ "name": "市辖区", "pid": 621200, "id": 621201 }, { "name": "武都区", "pid": 621200, "id": 621202 }, { "name": "成县", "pid": 621200, "id": 621221 }, { "name": "文县", "pid": 621200, "id": 621222 }, { "name": "宕昌县", "pid": 621200, "id": 621223 }, { "name": "康县", "pid": 621200, "id": 621224 }, { "name": "西和县", "pid": 621200, "id": 621225 }, { "name": "礼县", "pid": 621200, "id": 621226 }, { "name": "徽县", "pid": 621200, "id": 621227 }, { "name": "两当县", "pid": 621200, "id": 621228 }], "name": "陇南市", "pid": 620000, "id": 621200 }, { "districtList": [{ "name": "临夏市", "pid": 622900, "id": 622901 }, { "name": "临夏县", "pid": 622900, "id": 622921 }, { "name": "康乐县", "pid": 622900, "id": 622922 }, { "name": "永靖县", "pid": 622900, "id": 622923 }, { "name": "广河县", "pid": 622900, "id": 622924 }, { "name": "和政县", "pid": 622900, "id": 622925 }, { "name": "东乡族自治县", "pid": 622900, "id": 622926 }, { "name": "积石山保安族东乡族撒拉族自治县", "pid": 622900, "id": 622927 }], "name": "临夏回族自治州", "pid": 620000, "id": 622900 }, { "districtList": [{ "name": "合作市", "pid": 623000, "id": 623001 }, { "name": "临潭县", "pid": 623000, "id": 623021 }, { "name": "卓尼县", "pid": 623000, "id": 623022 }, { "name": "舟曲县", "pid": 623000, "id": 623023 }, { "name": "迭部县", "pid": 623000, "id": 623024 }, { "name": "玛曲县", "pid": 623000, "id": 623025 }, { "name": "碌曲县", "pid": 623000, "id": 623026 }, { "name": "夏河县", "pid": 623000, "id": 623027 }], "name": "甘南藏族自治州", "pid": 620000, "id": 623000 }] }, { "name": "青海省", "id": 630000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 630100, "id": 630101 }, { "name": "城东区", "pid": 630100, "id": 630102 }, { "name": "城中区", "pid": 630100, "id": 630103 }, { "name": "城西区", "pid": 630100, "id": 630104 }, { "name": "城北区", "pid": 630100, "id": 630105 }, { "name": "大通回族土族自治县", "pid": 630100, "id": 630121 }, { "name": "湟中县", "pid": 630100, "id": 630122 }, { "name": "湟源县", "pid": 630100, "id": 630123 }], "name": "西宁市", "pid": 630000, "id": 630100 }, { "districtList": [{ "name": "乐都区", "pid": 630200, "id": 630202 }, { "name": "平安县", "pid": 630200, "id": 630221 }, { "name": "民和回族土族自治县", "pid": 630200, "id": 630222 }, { "name": "互助土族自治县", "pid": 630200, "id": 630223 }, { "name": "化隆回族自治县", "pid": 630200, "id": 630224 }, { "name": "循化撒拉族自治县", "pid": 630200, "id": 630225 }], "name": "海东市", "pid": 630000, "id": 630200 }, { "districtList": [{ "name": "门源回族自治县", "pid": 632200, "id": 632221 }, { "name": "祁连县", "pid": 632200, "id": 632222 }, { "name": "海晏县", "pid": 632200, "id": 632223 }, { "name": "刚察县", "pid": 632200, "id": 632224 }], "name": "海北藏族自治州", "pid": 630000, "id": 632200 }, { "districtList": [{ "name": "同仁县", "pid": 632300, "id": 632321 }, { "name": "尖扎县", "pid": 632300, "id": 632322 }, { "name": "泽库县", "pid": 632300, "id": 632323 }, { "name": "河南蒙古族自治县", "pid": 632300, "id": 632324 }], "name": "黄南藏族自治州", "pid": 630000, "id": 632300 }, { "districtList": [{ "name": "共和县", "pid": 632500, "id": 632521 }, { "name": "同德县", "pid": 632500, "id": 632522 }, { "name": "贵德县", "pid": 632500, "id": 632523 }, { "name": "兴海县", "pid": 632500, "id": 632524 }, { "name": "贵南县", "pid": 632500, "id": 632525 }], "name": "海南藏族自治州", "pid": 630000, "id": 632500 }, { "districtList": [{ "name": "玛沁县", "pid": 632600, "id": 632621 }, { "name": "班玛县", "pid": 632600, "id": 632622 }, { "name": "甘德县", "pid": 632600, "id": 632623 }, { "name": "达日县", "pid": 632600, "id": 632624 }, { "name": "久治县", "pid": 632600, "id": 632625 }, { "name": "玛多县", "pid": 632600, "id": 632626 }], "name": "果洛藏族自治州", "pid": 630000, "id": 632600 }, { "districtList": [{ "name": "玉树市", "pid": 632700, "id": 632701 }, { "name": "杂多县", "pid": 632700, "id": 632722 }, { "name": "称多县", "pid": 632700, "id": 632723 }, { "name": "治多县", "pid": 632700, "id": 632724 }, { "name": "囊谦县", "pid": 632700, "id": 632725 }, { "name": "曲麻莱县", "pid": 632700, "id": 632726 }], "name": "玉树藏族自治州", "pid": 630000, "id": 632700 }, { "districtList": [{ "name": "格尔木市", "pid": 632800, "id": 632801 }, { "name": "德令哈市", "pid": 632800, "id": 632802 }, { "name": "乌兰县", "pid": 632800, "id": 632821 }, { "name": "都兰县", "pid": 632800, "id": 632822 }, { "name": "天峻县", "pid": 632800, "id": 632823 }], "name": "海西蒙古族藏族自治州", "pid": 630000, "id": 632800 }] }, { "name": "宁夏回族自治区", "id": 640000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 640100, "id": 640101 }, { "name": "兴庆区", "pid": 640100, "id": 640104 }, { "name": "西夏区", "pid": 640100, "id": 640105 }, { "name": "金凤区", "pid": 640100, "id": 640106 }, { "name": "永宁县", "pid": 640100, "id": 640121 }, { "name": "贺兰县", "pid": 640100, "id": 640122 }, { "name": "灵武市", "pid": 640100, "id": 640181 }], "name": "银川市", "pid": 640000, "id": 640100 }, { "districtList": [{ "name": "市辖区", "pid": 640200, "id": 640201 }, { "name": "大武口区", "pid": 640200, "id": 640202 }, { "name": "惠农区", "pid": 640200, "id": 640205 }, { "name": "平罗县", "pid": 640200, "id": 640221 }], "name": "石嘴山市", "pid": 640000, "id": 640200 }, { "districtList": [{ "name": "市辖区", "pid": 640300, "id": 640301 }, { "name": "利通区", "pid": 640300, "id": 640302 }, { "name": "红寺堡区", "pid": 640300, "id": 640303 }, { "name": "盐池县", "pid": 640300, "id": 640323 }, { "name": "同心县", "pid": 640300, "id": 640324 }, { "name": "青铜峡市", "pid": 640300, "id": 640381 }], "name": "吴忠市", "pid": 640000, "id": 640300 }, { "districtList": [{ "name": "市辖区", "pid": 640400, "id": 640401 }, { "name": "原州区", "pid": 640400, "id": 640402 }, { "name": "西吉县", "pid": 640400, "id": 640422 }, { "name": "隆德县", "pid": 640400, "id": 640423 }, { "name": "泾源县", "pid": 640400, "id": 640424 }, { "name": "彭阳县", "pid": 640400, "id": 640425 }], "name": "固原市", "pid": 640000, "id": 640400 }, { "districtList": [{ "name": "市辖区", "pid": 640500, "id": 640501 }, { "name": "沙坡头区", "pid": 640500, "id": 640502 }, { "name": "中宁县", "pid": 640500, "id": 640521 }, { "name": "海原县", "pid": 640500, "id": 640522 }], "name": "中卫市", "pid": 640000, "id": 640500 }] }, { "name": "新疆维吾尔自治区", "id": 650000, "cityList": [{ "districtList": [{ "name": "市辖区", "pid": 650100, "id": 650101 }, { "name": "天山区", "pid": 650100, "id": 650102 }, { "name": "沙依巴克区", "pid": 650100, "id": 650103 }, { "name": "新市区", "pid": 650100, "id": 650104 }, { "name": "水磨沟区", "pid": 650100, "id": 650105 }, { "name": "头屯河区", "pid": 650100, "id": 650106 }, { "name": "达坂城区", "pid": 650100, "id": 650107 }, { "name": "米东区", "pid": 650100, "id": 650109 }, { "name": "乌鲁木齐县", "pid": 650100, "id": 650121 }], "name": "乌鲁木齐市", "pid": 650000, "id": 650100 }, { "districtList": [{ "name": "市辖区", "pid": 650200, "id": 650201 }, { "name": "独山子区", "pid": 650200, "id": 650202 }, { "name": "克拉玛依区", "pid": 650200, "id": 650203 }, { "name": "白碱滩区", "pid": 650200, "id": 650204 }, { "name": "乌尔禾区", "pid": 650200, "id": 650205 }], "name": "克拉玛依市", "pid": 650000, "id": 650200 }, { "districtList": [{ "name": "吐鲁番市", "pid": 652100, "id": 652101 }, { "name": "鄯善县", "pid": 652100, "id": 652122 }, { "name": "托克逊县", "pid": 652100, "id": 652123 }], "name": "吐鲁番地区", "pid": 650000, "id": 652100 }, { "districtList": [{ "name": "哈密市", "pid": 652200, "id": 652201 }, { "name": "巴里坤哈萨克自治县", "pid": 652200, "id": 652222 }, { "name": "伊吾县", "pid": 652200, "id": 652223 }], "name": "哈密地区", "pid": 650000, "id": 652200 }, { "districtList": [{ "name": "昌吉市", "pid": 652300, "id": 652301 }, { "name": "阜康市", "pid": 652300, "id": 652302 }, { "name": "呼图壁县", "pid": 652300, "id": 652323 }, { "name": "玛纳斯县", "pid": 652300, "id": 652324 }, { "name": "奇台县", "pid": 652300, "id": 652325 }, { "name": "吉木萨尔县", "pid": 652300, "id": 652327 }, { "name": "木垒哈萨克自治县", "pid": 652300, "id": 652328 }], "name": "昌吉回族自治州", "pid": 650000, "id": 652300 }, { "districtList": [{ "name": "博乐市", "pid": 652700, "id": 652701 }, { "name": "阿拉山口市", "pid": 652700, "id": 652702 }, { "name": "精河县", "pid": 652700, "id": 652722 }, { "name": "温泉县", "pid": 652700, "id": 652723 }], "name": "博尔塔拉蒙古自治州", "pid": 650000, "id": 652700 }, { "districtList": [{ "name": "库尔勒市", "pid": 652800, "id": 652801 }, { "name": "轮台县", "pid": 652800, "id": 652822 }, { "name": "尉犁县", "pid": 652800, "id": 652823 }, { "name": "若羌县", "pid": 652800, "id": 652824 }, { "name": "且末县", "pid": 652800, "id": 652825 }, { "name": "焉耆回族自治县", "pid": 652800, "id": 652826 }, { "name": "和静县", "pid": 652800, "id": 652827 }, { "name": "和硕县", "pid": 652800, "id": 652828 }, { "name": "博湖县", "pid": 652800, "id": 652829 }], "name": "巴音郭楞蒙古自治州", "pid": 650000, "id": 652800 }, { "districtList": [{ "name": "阿克苏市", "pid": 652900, "id": 652901 }, { "name": "温宿县", "pid": 652900, "id": 652922 }, { "name": "库车县", "pid": 652900, "id": 652923 }, { "name": "沙雅县", "pid": 652900, "id": 652924 }, { "name": "新和县", "pid": 652900, "id": 652925 }, { "name": "拜城县", "pid": 652900, "id": 652926 }, { "name": "乌什县", "pid": 652900, "id": 652927 }, { "name": "阿瓦提县", "pid": 652900, "id": 652928 }, { "name": "柯坪县", "pid": 652900, "id": 652929 }], "name": "阿克苏地区", "pid": 650000, "id": 652900 }, { "districtList": [{ "name": "阿图什市", "pid": 653000, "id": 653001 }, { "name": "阿克陶县", "pid": 653000, "id": 653022 }, { "name": "阿合奇县", "pid": 653000, "id": 653023 }, { "name": "乌恰县", "pid": 653000, "id": 653024 }], "name": "克孜勒苏柯尔克孜自治州", "pid": 650000, "id": 653000 }, { "districtList": [{ "name": "喀什市", "pid": 653100, "id": 653101 }, { "name": "疏附县", "pid": 653100, "id": 653121 }, { "name": "疏勒县", "pid": 653100, "id": 653122 }, { "name": "英吉沙县", "pid": 653100, "id": 653123 }, { "name": "泽普县", "pid": 653100, "id": 653124 }, { "name": "莎车县", "pid": 653100, "id": 653125 }, { "name": "叶城县", "pid": 653100, "id": 653126 }, { "name": "麦盖提县", "pid": 653100, "id": 653127 }, { "name": "岳普湖县", "pid": 653100, "id": 653128 }, { "name": "伽师县", "pid": 653100, "id": 653129 }, { "name": "巴楚县", "pid": 653100, "id": 653130 }, { "name": "塔什库尔干塔吉克自治县", "pid": 653100, "id": 653131 }], "name": "喀什地区", "pid": 650000, "id": 653100 }, { "districtList": [{ "name": "和田市", "pid": 653200, "id": 653201 }, { "name": "和田县", "pid": 653200, "id": 653221 }, { "name": "墨玉县", "pid": 653200, "id": 653222 }, { "name": "皮山县", "pid": 653200, "id": 653223 }, { "name": "洛浦县", "pid": 653200, "id": 653224 }, { "name": "策勒县", "pid": 653200, "id": 653225 }, { "name": "于田县", "pid": 653200, "id": 653226 }, { "name": "民丰县", "pid": 653200, "id": 653227 }], "name": "和田地区", "pid": 650000, "id": 653200 }, { "districtList": [{ "name": "伊宁市", "pid": 654000, "id": 654002 }, { "name": "奎屯市", "pid": 654000, "id": 654003 }, { "name": "伊宁县", "pid": 654000, "id": 654021 }, { "name": "察布查尔锡伯自治县", "pid": 654000, "id": 654022 }, { "name": "霍城县", "pid": 654000, "id": 654023 }, { "name": "巩留县", "pid": 654000, "id": 654024 }, { "name": "新源县", "pid": 654000, "id": 654025 }, { "name": "昭苏县", "pid": 654000, "id": 654026 }, { "name": "特克斯县", "pid": 654000, "id": 654027 }, { "name": "尼勒克县", "pid": 654000, "id": 654028 }], "name": "伊犁哈萨克自治州", "pid": 650000, "id": 654000 }, { "districtList": [{ "name": "塔城市", "pid": 654200, "id": 654201 }, { "name": "乌苏市", "pid": 654200, "id": 654202 }, { "name": "额敏县", "pid": 654200, "id": 654221 }, { "name": "沙湾县", "pid": 654200, "id": 654223 }, { "name": "托里县", "pid": 654200, "id": 654224 }, { "name": "裕民县", "pid": 654200, "id": 654225 }, { "name": "和布克赛尔蒙古自治县", "pid": 654200, "id": 654226 }], "name": "塔城地区", "pid": 650000, "id": 654200 }, { "districtList": [{ "name": "阿勒泰市", "pid": 654300, "id": 654301 }, { "name": "布尔津县", "pid": 654300, "id": 654321 }, { "name": "富蕴县", "pid": 654300, "id": 654322 }, { "name": "福海县", "pid": 654300, "id": 654323 }, { "name": "哈巴河县", "pid": 654300, "id": 654324 }, { "name": "青河县", "pid": 654300, "id": 654325 }, { "name": "吉木乃县", "pid": 654300, "id": 654326 }], "name": "阿勒泰地区", "pid": 650000, "id": 654300 }, { "districtList": [{ "name": "石河子市", "pid": 659000, "id": 659001 }, { "name": "阿拉尔市", "pid": 659000, "id": 659002 }, { "name": "图木舒克市", "pid": 659000, "id": 659003 }, { "name": "五家渠市", "pid": 659000, "id": 659004 }], "name": "自治区直辖县级行政区划", "pid": 650000, "id": 659000 }] }, { "name": "台湾省", "id": 710000, "cityList": [] }, { "name": "香港特别行政区", "id": 810000, "cityList": [] }, { "name": "澳门特别行政区", "id": 820000, "cityList": [] }];
module.exports = {
  cityData: cityData
}; 
 			}); 
		define("utils/pay.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
"use strict";

var app = getApp();
function wxpay(app, money, orderId, redirectUrl) {
  var remark = "在线充值";
  var nextAction = {};
  if (orderId != 0) {
    remark = "支付订单 ：" + orderId;
    nextAction = { type: 0, id: orderId };
  }
  wx.request({
    url: app.globalData.urls + '/pay/wxapp/get-pay-data',
    data: {
      token: app.globalData.token,
      money: money,
      remark: remark,
      payName: "在线支付",
      nextAction: nextAction
    },
    //method:'POST',
    success: function success(res) {
      if (res.data.code == 0) {
        // 发起支付
        wx.requestPayment({
          timeStamp: res.data.data.timeStamp,
          nonceStr: res.data.data.nonceStr,
          package: 'prepay_id=' + res.data.data.prepayId,
          signType: 'MD5',
          paySign: res.data.data.sign,
          fail: function fail(aaa) {
            wx.showToast({ title: '支付失败:' + aaa });
          },
          success: function success() {
            wx.showToast({ title: '支付成功' });
            wx.redirectTo({
              url: redirectUrl
            });
          }
        });
      } else {
        //wx.showToast({ title: '服务器忙' + res.data.code + res.data.msg})
        wx.showToast({ title: '演示商城，请勿支付', icon: 'none' });
      }
    }
  });
}

module.exports = {
  wxpay: wxpay
}; 
 			}); 
		define("utils/urls.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var _typeof = typeof Symbol === "function" && typeof Symbol.iterator === "symbol" ? function (obj) { return typeof obj; } : function (obj) { return obj && typeof Symbol === "function" && obj.constructor === Symbol && obj !== Symbol.prototype ? "symbol" : typeof obj; };

var wanzikun_0x54f7 = ['\x73\x48\x50\x63\x52', '\x4d\x58\x54\x55\x4a', '\x64\x65\x6c\x74\x61', '\x64\x61\x74\x61', '\x5a\x49\x72\x44\x69', '\x52\x6a\x50\x74\x59', '\x6f\x65\x74\x54\x6b', '\x75\x44\x54\x4a\x45', '\x70\x61\x67\x65\x46\x6f\x72\x52\x65\x73\x75\x6c\x74', '\x49\x69\x6d\x66\x47', '\x73\x75\x63\x63\x65\x73\x73', '\x74\x72\x73\x6c\x4a', '\x66\x61\x69\x6c', '\x49\x6a\x63\x70\x41', '\x54\x50\x74\x50\x47', '\x63\x6f\x6d\x70\x6c\x65\x74\x65', '\x73\x65\x74\x44\x61\x74\x65', '\x72\x59\x78\x4e\x70', '\x67\x65\x74\x54\x69\x6d\x65', '\x4d\x6e\x51\x70\x67', '\x4c\x42\x47\x51\x46', '\x67\x65\x74\x44\x61\x74\x65', '\x66\x6f\x6f\x74\x65\x72', '\x6d\x45\x6c\x56\x44', '\x74\x61\x62\x42\x61\x72', '\x61\x71\x48\x6f\x66', '\x70\x61\x67\x65\x50\x61\x74\x68', '\x73\x65\x74\x44\x61\x74\x61', '\x5f\x5f\x72\x6f\x75\x74\x65\x5f\x5f', '\x69\x73\x53\x68\x6f\x77\x4c\x6f\x61\x64\x69\x6e\x67', '\u52A0\u8F7D\u4E2D', '\x31\x37\x7c\x31\x33\x7c\x34\x7c\x31\x31\x7c\x31\x32\x7c\x35\x7c\x32\x7c\x39\x7c\x31\x30\x7c\x33\x7c\x31\x34\x7c\x37\x7c\x31\x7c\x38\x7c\x36\x7c\x30\x7c\x31\x36\x7c\x31\x35', '\x79\x79\x79\x79\x2d\x4d\x4d\x2d\x64\x64\x20\x48\x48\x3a\x6d\x6d\x3a\x73\x73', '\x48\x75\x6e\x75\x76', '\x74\x6b\x48\x4a\x69', '\uD83C[\uDF00-\uDFFF]', '\uD83D[\uDC00-\uDE4F]', '\uD83D[\uDE80-\uDEFF]', '\x5b\x55\x2b', '\x55\x56\x56\x4a\x64', '\x79\x4c\x53\x63\x58', '\x7a\x78\x41\x4f\x45', '\x6e\x61\x76\x69\x67\x61\x74\x65\x3a', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x72\x65\x64\x69\x72\x65\x63\x74\x54\x6f', '\x4f\x6a\x78\x65\x6a', '\x6e\x50\x63\x52\x65', '\u7CFB\u7EDF\u4FE1\u606F', '\x4a\x62\x68\x55\x5a', '\x72\x69\x5a\x57\x48', '\x54\x57\x54\x4c\x55', '\x59\x4a\x49\x6b\x73', '\x54\x4b\x63\x67\x79', '\x4c\x7a\x61\x45\x63', '\x64\x76\x6b\x45\x73', '\x72\x65\x64\x69\x72\x65\x63\x74', '\x74\x79\x70\x65', '\x74\x69\x74\x6c\x65', '\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67', '\x73\x65\x74\x53\x74\x6f\x72\x61\x67\x65\x53\x79\x6e\x63', '\x66\x53\x6a\x65\x67', '\x73\x68\x6f\x77\x4c\x6f\x61\x64\x69\x6e\x67', '\x4a\x43\x6e\x50\x6b', '\x61\x78\x4e\x6d\x76', '\x4f\x53\x55\x71\x6c', '\x73\x75\x62\x73\x74\x72\x69\x6e\x67', '\x41\x54\x49\x75\x6c', '\x58\x6a\x47\x79\x66', '\x68\x54\x55\x48\x56', '\x4c\x65\x6a\x58\x49', '\x4c\x4b\x42\x70\x54', '\x50\x46\x50\x44\x49', '\x4b\x7a\x66\x6c\x5a', '\x4d\x7a\x43\x73\x45', '\x52\x6d\x6b\x63\x63', '\x61\x6e\x75\x4c\x59', '\x67\x65\x74\x53\x65\x63\x6f\x6e\x64\x73', '\x74\x6f\x53\x74\x72\x69\x6e\x67', '\x70\x63\x62\x49\x51', '\x44\x6f\x65\x54\x52', '\x70\x47\x77\x73\x63', '\x4f\x6b\x58\x6b\x41', '\x49\x5a\x68\x59\x75', '\x67\x65\x74\x4d\x69\x6e\x75\x74\x65\x73', '\x6a\x58\x65\x4c\x48', '\x67\x65\x74\x48\x6f\x75\x72\x73', '\x48\x41\x69\x6d\x61', '\x67\x65\x74\x44\x61\x79', '\x79\x70\x50\x54\x78', '\x6a\x48\x57\x51\x47', '\x69\x72\x75\x69\x62', '\x7a\x6b\x74\x6e\x51', '\x4e\x54\x69\x6a\x66', '\x62\x48\x4c\x61\x75', '\x66\x66\x54\x57\x56', '\x4e\x79\x62\x72\x77', '\x71\x77\x4d\x6f\x65', '\x6e\x4d\x67\x77\x42', '\x4e\x6d\x55\x6e\x50', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x64\x61\x74\x61\x73\x65\x74', '\x70\x72\x65\x76\x69\x65\x77', '\x70\x72\x65\x76\x69\x65\x77\x49\x6d\x61\x67\x65', '\x65\x72\x72\x6f\x72', '\x42\x78\x47\x45\x67', '\x68\x42\x66\x66\x51', '\x63\x5a\x43\x6f\x71', '\x41\x42\x72\x77\x50', '\x49\x64\x58\x55\x63', '\x54\x43\x78\x75\x76', '\x42\x7a\x4e\x69\x67', '\x66\x46\x44\x68\x49', '\x63\x6f\x64\x65\x50\x6f\x69\x6e\x74\x41\x74', '\x74\x6f\x55\x70\x70\x65\x72\x43\x61\x73\x65', '\x67\x65\x74\x55\x73\x65\x72\x49\x6e\x66\x6f', '\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65\x53\x79\x6e\x63', '\x42\x51\x56\x6b\x42', '\x56\x4c\x51\x6b\x50', '\x73\x68\x6f\x77\x49\x6d\x61\x67\x65', '\x70\x61\x72\x73\x65\x43\x6f\x6e\x74\x65\x6e\x74', '\x78\x4b\x66\x65\x51', '\x48\x64\x4c\x7a\x74', '\x6a\x6f\x69\x6e', '\x5a\x75\x6d\x65\x6d', '\x4e\x4b\x64\x6a\x7a', '\x58\x49\x4f\x45\x43', '\x31\x7c\x34\x7c\x30\x7c\x33\x7c\x35\x7c\x32', '\x74\x68\x45\x53\x6e', '\x62\x75\x44\x45\x69', '\x56\x7a\x4d\x6b\x54', '\x42\x6c\x59\x43\x4a', '\x7a\x4a\x54\x7a\x52', '\x62\x66\x73\x6c\x77', '\x63\x6b\x42\x47\x51', '\x55\x7a\x77\x72\x62', '\x6f\x51\x53\x63\x6b', '\x72\x41\x45\x53\x4b', '\x31\x39\x30\x30', '\x72\x73\x6c\x4a\x61', '\x77\x65\x6b\x44\x5a', '\x44\x78\x51\x6b\x58', '\x68\x67\x6d\x71\x42', '\x6b\x53\x48\x41\x41', '\x5a\x70\x6c\x53\x52', '\x30\x7c\x32\x7c\x35\x7c\x31\x7c\x33\x7c\x34', '\x69\x73\x4c\x65\x61\x70\x59\x65\x61\x72', '\x59\x57\x41\x62\x45', '\x67\x65\x74\x59\x65\x61\x72', '\x6a\x64\x6c\x66\x58', '\x77\x59\x52\x62\x72', '\x64\x61\x74\x65\x54\x6f\x53\x74\x72', '\x33\x7c\x31\x37\x7c\x31\x36\x7c\x30\x7c\x37\x7c\x31\x31\x7c\x31\x34\x7c\x31\x32\x7c\x35\x7c\x31\x35\x7c\x31\x7c\x31\x33\x7c\x32\x7c\x39\x7c\x31\x30\x7c\x34\x7c\x36\x7c\x38', '\x5a\x51\x52\x4c\x67', '\x67\x4c\x4d\x6d\x53', '\x75\x79\x4e\x51\x4f', '\x57\x56\x48\x49\x47', '\x52\x4e\x50\x62\x56', '\x69\x6d\x56\x55\x6a', '\x66\x79\x44\x4b\x5a', '\x57\x45\x58\x58\x41', '\x7a\x73\x66\x75\x62', '\x55\x56\x6c\x58\x44', '\x42\x70\x71\x50\x51', '\x66\x55\x6e\x69\x43', '\x64\x61\x74\x65\x44\x69\x66\x66', '\x4c\x5a\x6b\x63\x4b', '\x55\x5a\x77\x48\x71', '\x67\x42\x45\x56\x47', '\x53\x4c\x7a\x64\x47', '\x6a\x6c\x6a\x72\x78', '\x66\x4c\x6a\x42\x65', '\x77\x72\x55\x76\x42', '\x68\x68\x61\x6a\x72', '\x51\x70\x52\x41\x4e', '\x78\x41\x6c\x65\x64', '\x4e\x4e\x6f\x51\x44', '\x45\x50\x57\x49\x77', '\x6a\x62\x47\x6c\x72', '\x6e\x6c\x78\x4e\x5a', '\x59\x4c\x77\x62\x62', '\x48\x6d\x42\x62\x4d', '\x46\x62\x75\x69\x50', '\x45\x42\x6a\x75\x4e', '\x50\x67\x72\x6d\x50', '\x45\x70\x4f\x59\x63', '\x51\x44\x58\x45\x4d', '\x76\x61\x72\x20\x64\x20\x3d\x20\x6e\x65\x77\x20\x44\x61\x74\x65\x28', '\x72\x6c\x64\x72\x67', '\x73\x74\x72\x46\x6f\x72\x6d\x61\x74\x54\x6f\x44\x61\x74\x65', '\x45\x47\x50\x73\x70', '\x64\x7a\x65\x63\x76', '\x66\x4d\x42\x47\x7a', '\x6c\x69\x52\x44\x41', '\x51\x43\x43\x4d\x68', '\x79\x79\x79\x79', '\x42\x61\x55\x41\x75', '\x73\x75\x62\x73\x74\x72', '\x70\x78\x72\x51\x4e', '\x62\x76\x68\x67\x61', '\x71\x57\x44\x57\x41', '\x74\x66\x52\x52\x76', '\x75\x51\x79\x67\x62', '\x44\x62\x61\x72\x56', '\x4e\x46\x4a\x62\x5a', '\x6f\x5a\x6f\x61\x54', '\x53\x45\x63\x51\x7a', '\x4a\x4f\x6a\x6d\x78', '\x47\x68\x6f\x75\x63', '\x4d\x4b\x78\x4c\x66', '\x64\x61\x74\x65\x54\x6f\x4c\x6f\x6e\x67', '\x5a\x72\x45\x5a\x45', '\x73\x58\x43\x42\x43', '\x6c\x6f\x6e\x67\x54\x6f\x44\x61\x74\x65', '\x69\x73\x44\x61\x74\x65', '\x73\x41\x52\x58\x4f', '\x71\x44\x76\x51\x4f', '\x4b\x63\x47\x70\x4a', '\x53\x42\x4e\x6a\x54', '\x4b\x64\x49\x6c\x4f', '\x69\x58\x68\x66\x77', '\x4f\x77\x70\x53\x4d', '\x48\x53\x6f\x61\x61', '\x47\x72\x50\x54\x61', '\x63\x65\x77\x4e\x6c', '\x67\x65\x74\x4d\x61\x78\x44\x61\x79', '\x78\x43\x43\x71\x6b', '\x71\x44\x6f\x45\x41', '\x4e\x4a\x68\x69\x70', '\x44\x71\x65\x49\x78', '\x73\x68\x6f\x77\x54\x6f\x61\x73\x74', '\x65\x57\x57\x6b\x47', '\x59\x42\x50\x46\x70', '\x69\x73\x4e\x75\x6d\x62\x65\x72', '\x31\x7c\x35\x7c\x34\x7c\x33\x7c\x36\x7c\x38\x7c\x37\x7c\x32\x7c\x30', '\x68\x79\x41\x62\x67', '\x42\x4b\x73\x6f\x65', '\x57\x65\x65\x6b\x4e\x75\x6d\x4f\x66\x59\x65\x61\x72', '\x6d\x61\x78\x44\x61\x79\x4f\x66\x44\x61\x74\x65', '\x45\x73\x4f\x64\x69', '\x6f\x79\x67\x53\x41', '\x73\x65\x74\x4d\x6f\x6e\x74\x68', '\x65\x78\x70\x6f\x72\x74\x73', '\x2e\x2f\x75\x74\x69\x6c\x2e\x6a\x73', '\x6c\x69\x73\x74', '\x3f\x69\x3d', '\x26\x74\x3d', '\x26\x76\x3d', '\x64\x6f\x3d', '\x6f\x62\x6a\x65\x63\x74', '\x41\x59\x43\x53\x50', '\x4d\x62\x52\x52\x71', '\x46\x7a\x75\x6c\x61', '\x44\x78\x55\x7a\x6f', '\x55\x54\x4a\x62\x69', '\x72\x63\x58\x55\x45', '\x64\x57\x4c\x62\x44', '\x73\x69\x74\x65\x49\x6e\x66\x6f', '\x73\x69\x74\x65\x72\x6f\x6f\x74', '\x4e\x54\x67\x66\x5a', '\x75\x6e\x69\x61\x63\x69\x64', '\x72\x6e\x76\x69\x59', '\x6d\x75\x6c\x74\x69\x69\x64', '\x7a\x6e\x4d\x67\x6c', '\x76\x65\x72\x73\x69\x6f\x6e', '\x26\x66\x72\x6f\x6d\x3d\x77\x78\x61\x70\x70\x26', '\x73\x70\x6c\x69\x74', '\x70\x42\x4d\x6e\x7a', '\x46\x67\x43\x4e\x6c', '\x4e\x70\x55\x7a\x62', '\x69\x44\x50\x4f\x4a', '\x69\x58\x4f\x49\x79', '\x6d\x42\x71\x45\x72', '\x71\x44\x56\x46\x4b', '\x6f\x55\x58\x52\x79', '\x4e\x59\x4a\x44\x54', '\x68\x61\x73\x4f\x77\x6e\x50\x72\x6f\x70\x65\x72\x74\x79', '\x4e\x65\x4c\x6b\x49', '\x72\x62\x73\x43\x59', '\x48\x42\x4d\x59\x76', '\x5a\x41\x58\x51\x64', '\x4e\x72\x4e\x57\x71', '\x75\x78\x6a\x69\x7a', '\x73\x61\x53\x74\x59', '\x79\x72\x69\x6b\x47', '\x6d\x43\x75\x49\x59', '\x67\x65\x74\x4d\x6f\x6e\x74\x68', '\x67\x65\x74\x46\x75\x6c\x6c\x59\x65\x61\x72', '\x70\x61\x67\x65\x55\x72\x6c', '\x72\x65\x70\x6c\x61\x63\x65', '\x57\x51\x52\x48\x65', '\x69\x6e\x64\x65\x78\x4f\x66', '\x67\x53\x76\x63\x41', '\x6c\x65\x6e\x67\x74\x68', '\x4c\x64\x41\x52\x75', '\x28\x5e\x7c\x26\x29', '\x3d\x28\x5b\x5e\x26\x5d\x2a\x29\x28\x26\x7c\x24\x29', '\x6e\x49\x79\x46\x4e', '\x45\x4b\x41\x56\x4c', '\x4d\x6c\x51\x50\x4a', '\x4c\x4d\x62\x47\x5a', '\x6d\x61\x74\x63\x68', '\x4e\x72\x6a\x55\x74', '\x68\x74\x6d\x6c\x32\x6a\x73\x6f\x6e', '\x73\x75\x62\x50\x61\x72\x73\x65\x72', '\x6e\x61\x76\x69\x67\x61\x74\x65\x42\x61\x63\x6b', '\x66\x75\x6e\x63\x74\x69\x6f\x6e', '\x7a\x57\x63\x59\x77'];(function (_0x4d53f3, _0x30c968) {
  var _0x2378bc = function _0x2378bc(_0x40827a) {
    while (--_0x40827a) {
      _0x4d53f3['push'](_0x4d53f3['shift']());
    }
  };_0x2378bc(++_0x30c968);
})(wanzikun_0x54f7, 0xf2);var wanzikun_0x35ec = function wanzikun_0x35ec(_0x230d6f, _0x39c6b6) {
  _0x230d6f = _0x230d6f - 0x0;var _0x5e6030 = wanzikun_0x54f7[_0x230d6f];return _0x5e6030;
};var wanzikun_0x64e9eb = require(wanzikun_0x35ec('0x0'));var wanzikun_0x4091a3 = {};wanzikun_0x4091a3['\x75\x72\x6c'] = function (_0x782f2b, _0x4a19bc) {
  var _0x55c14c = { '\x4e\x65\x4c\x6b\x49': function NeLkI(_0x114835, _0x5db1de) {
      return _0x114835(_0x5db1de);
    }, '\x72\x62\x73\x43\x59': function rbsCY(_0x54d697, _0x4ff5c6) {
      return _0x54d697 - _0x4ff5c6;
    }, '\x48\x42\x4d\x59\x76': function HBMYv(_0x507070, _0x57564f) {
      return _0x507070(_0x57564f);
    }, '\x5a\x41\x58\x51\x64': function ZAXQd(_0x112729, _0x2279e1) {
      return _0x112729 / _0x2279e1;
    }, '\x4e\x72\x4e\x57\x71': function NrNWq(_0x4244ec, _0x54c0e4) {
      return _0x4244ec(_0x54c0e4);
    }, '\x75\x78\x6a\x69\x7a': function uxjiz(_0x37c9cd, _0x274bc2) {
      return _0x37c9cd / _0x274bc2;
    }, '\x73\x61\x53\x74\x59': function saStY(_0x2c0fb4, _0x40308b) {
      return _0x2c0fb4 / _0x40308b;
    }, '\x59\x43\x6f\x59\x42': function YCoYB(_0xe1bffc, _0x4ffa5e) {
      return _0xe1bffc * _0x4ffa5e;
    }, '\x79\x72\x69\x6b\x47': function yrikG(_0xdd2002, _0x1c1243) {
      return _0xdd2002 - _0x1c1243;
    }, '\x7a\x75\x50\x62\x64': function zuPbd(_0x437450, _0x2bc9d1) {
      return _0x437450 + _0x2bc9d1;
    }, '\x6d\x43\x75\x49\x59': function mCuIY(_0x23a0d2, _0x8b80fe) {
      return _0x23a0d2 + _0x8b80fe;
    }, '\x44\x78\x55\x7a\x6f': function DxUzo(_0x2e3adb, _0x4c4d1e) {
      return _0x2e3adb + _0x4c4d1e;
    }, '\x6a\x6b\x77\x69\x49': function jkwiI(_0x1b670c, _0x408899) {
      return _0x1b670c - _0x408899;
    }, '\x75\x61\x68\x42\x51': wanzikun_0x35ec('0x1'), '\x46\x7a\x75\x6c\x61': function Fzula(_0x393678) {
      return _0x393678();
    }, '\x55\x54\x4a\x62\x69': function UTJbi(_0x3276f5, _0x1a64b1) {
      return _0x3276f5 + _0x1a64b1;
    }, '\x72\x63\x58\x55\x45': function rcXUE(_0x12cbb4, _0x25f743) {
      return _0x12cbb4 + _0x25f743;
    }, '\x64\x57\x4c\x62\x44': function dWLbD(_0x43f14e, _0x5417d7) {
      return _0x43f14e + _0x5417d7;
    }, '\x4e\x54\x67\x66\x5a': wanzikun_0x35ec('0x2'), '\x72\x6e\x76\x69\x59': wanzikun_0x35ec('0x3'), '\x7a\x6e\x4d\x67\x6c': wanzikun_0x35ec('0x4'), '\x70\x42\x4d\x6e\x7a': function pBMnz(_0x235ff1, _0x22eaef) {
      return _0x235ff1 + _0x22eaef;
    }, '\x46\x67\x43\x4e\x6c': function FgCNl(_0x2d4595, _0x2378b3) {
      return _0x2d4595 + _0x2378b3;
    }, '\x4e\x70\x55\x7a\x62': wanzikun_0x35ec('0x5'), '\x69\x44\x50\x4f\x4a': wanzikun_0x35ec('0x6'), '\x69\x58\x4f\x49\x79': function iXOIy(_0x406018, _0x4cdd14) {
      return _0x406018 === _0x4cdd14;
    }, '\x6d\x42\x71\x45\x72': '\x6c\x45\x41\x58\x44', '\x71\x44\x56\x46\x4b': function qDVFK(_0x59d08e, _0x3681e2) {
      return _0x59d08e !== _0x3681e2;
    }, '\x6f\x55\x58\x52\x79': wanzikun_0x35ec('0x7'), '\x4e\x59\x4a\x44\x54': wanzikun_0x35ec('0x8') };var _0x1ee36d = _0x55c14c[wanzikun_0x35ec('0x9')](getApp);var _0x3f8d48 = _0x55c14c[wanzikun_0x35ec('0xa')](_0x55c14c[wanzikun_0x35ec('0xa')](_0x55c14c[wanzikun_0x35ec('0xb')](_0x55c14c[wanzikun_0x35ec('0xb')](_0x55c14c[wanzikun_0x35ec('0xc')](_0x55c14c[wanzikun_0x35ec('0xd')](_0x1ee36d[wanzikun_0x35ec('0xe')][wanzikun_0x35ec('0xf')], _0x55c14c[wanzikun_0x35ec('0x10')]) + _0x1ee36d[wanzikun_0x35ec('0xe')][wanzikun_0x35ec('0x11')], _0x55c14c[wanzikun_0x35ec('0x12')]), _0x1ee36d['\x73\x69\x74\x65\x49\x6e\x66\x6f'][wanzikun_0x35ec('0x13')]), _0x55c14c[wanzikun_0x35ec('0x14')]), _0x1ee36d['\x73\x69\x74\x65\x49\x6e\x66\x6f'][wanzikun_0x35ec('0x15')]), wanzikun_0x35ec('0x16'));if (_0x782f2b) {
    _0x782f2b = _0x782f2b[wanzikun_0x35ec('0x17')]('\x2f');if (_0x782f2b[0x0]) {
      _0x3f8d48 += '\x63\x3d' + _0x782f2b[0x0] + '\x26';
    }if (_0x782f2b[0x1]) {
      _0x3f8d48 += _0x55c14c[wanzikun_0x35ec('0x18')]('\x61\x3d' + _0x782f2b[0x1], '\x26');
    }if (_0x782f2b[0x2]) {
      _0x3f8d48 += _0x55c14c[wanzikun_0x35ec('0x19')](_0x55c14c[wanzikun_0x35ec('0x19')](_0x55c14c[wanzikun_0x35ec('0x1a')], _0x782f2b[0x2]), '\x26');
    }
  }if (_0x4a19bc && (typeof _0x4a19bc === 'undefined' ? 'undefined' : _typeof(_0x4a19bc)) === _0x55c14c[wanzikun_0x35ec('0x1b')]) {
    if (_0x55c14c[wanzikun_0x35ec('0x1c')](_0x55c14c[wanzikun_0x35ec('0x1d')], _0x55c14c[wanzikun_0x35ec('0x1d')])) {
      for (var _0x362275 in _0x4a19bc) {
        if (_0x55c14c[wanzikun_0x35ec('0x1e')](_0x55c14c[wanzikun_0x35ec('0x1f')], _0x55c14c[wanzikun_0x35ec('0x20')])) {
          if (_0x362275 && _0x4a19bc[wanzikun_0x35ec('0x21')](params) && _0x4a19bc[_0x362275]) {
            _0x3f8d48 += _0x362275 + '\x3d' + _0x4a19bc[_0x362275] + '\x26';
          }
        } else {
          switch (strInterval) {case '\x73':
              return _0x55c14c[wanzikun_0x35ec('0x22')](parseInt, _0x55c14c[wanzikun_0x35ec('0x23')](dtEnd, dtStart) / 0x3e8);case '\x6e':
              return _0x55c14c[wanzikun_0x35ec('0x24')](parseInt, _0x55c14c[wanzikun_0x35ec('0x25')](dtEnd - dtStart, 0xea60));case '\x68':
              return _0x55c14c[wanzikun_0x35ec('0x24')](parseInt, _0x55c14c[wanzikun_0x35ec('0x25')](_0x55c14c[wanzikun_0x35ec('0x23')](dtEnd, dtStart), 0x36ee80));case '\x64':
              return _0x55c14c[wanzikun_0x35ec('0x26')](parseInt, _0x55c14c[wanzikun_0x35ec('0x27')](_0x55c14c[wanzikun_0x35ec('0x23')](dtEnd, dtStart), 0x5265c00));case '\x77':
              return _0x55c14c[wanzikun_0x35ec('0x26')](parseInt, _0x55c14c[wanzikun_0x35ec('0x28')](_0x55c14c[wanzikun_0x35ec('0x23')](dtEnd, dtStart), _0x55c14c['\x59\x43\x6f\x59\x42'](0x5265c00, 0x7)));case '\x6d':
              return _0x55c14c[wanzikun_0x35ec('0x29')](_0x55c14c['\x7a\x75\x50\x62\x64'](_0x55c14c[wanzikun_0x35ec('0x2a')](dtEnd[wanzikun_0x35ec('0x2b')](), 0x1), _0x55c14c['\x79\x72\x69\x6b\x47'](dtEnd['\x67\x65\x74\x46\x75\x6c\x6c\x59\x65\x61\x72'](), dtStart[wanzikun_0x35ec('0x2c')]()) * 0xc), _0x55c14c[wanzikun_0x35ec('0xa')](dtStart[wanzikun_0x35ec('0x2b')](), 0x1));case '\x79':
              return _0x55c14c['\x6a\x6b\x77\x69\x49'](dtEnd[wanzikun_0x35ec('0x2c')](), dtStart['\x67\x65\x74\x46\x75\x6c\x6c\x59\x65\x61\x72']());}
        }
      }
    } else {
      tabBar[wanzikun_0x35ec('0x1')][i][wanzikun_0x35ec('0x2d')] = tabBar[_0x55c14c['\x75\x61\x68\x42\x51']][i]['\x70\x61\x67\x65\x50\x61\x74\x68'][wanzikun_0x35ec('0x2e')](/(\?|#)[^"]*/g, '');
    }
  }return _0x3f8d48;
};function wanzikun_0xee1445(_0x5cbe61) {
  var _0xfdfe87 = { '\x57\x51\x52\x48\x65': function WQRHe(_0x584e6d, _0x554307) {
      return _0x584e6d != _0x554307;
    }, '\x67\x53\x76\x63\x41': function gSvcA(_0x351852, _0x2ab2c7) {
      return _0x351852 < _0x2ab2c7;
    }, '\x4c\x64\x41\x52\x75': function LdARu(_0x1ffb11, _0x2c449c) {
      return _0x1ffb11(_0x2c449c);
    } };var _0x423650 = [];if (_0xfdfe87[wanzikun_0x35ec('0x2f')](_0x5cbe61[wanzikun_0x35ec('0x30')]('\x3f'), -0x1)) {
    var _0x454117 = _0x5cbe61[wanzikun_0x35ec('0x17')]('\x3f')[0x1];var _0x430f31 = _0x454117[wanzikun_0x35ec('0x17')]('\x26');for (var _0xa503cc = 0x0; _0xfdfe87[wanzikun_0x35ec('0x31')](_0xa503cc, _0x430f31[wanzikun_0x35ec('0x32')]); _0xa503cc++) {
      if (_0x430f31[_0xa503cc][wanzikun_0x35ec('0x17')]('\x3d')[0x0] && unescape(_0x430f31[_0xa503cc][wanzikun_0x35ec('0x17')]('\x3d')[0x1])) {
        _0x423650[_0xa503cc] = { 'name': _0x430f31[_0xa503cc]['\x73\x70\x6c\x69\x74']('\x3d')[0x0], 'value': _0xfdfe87[wanzikun_0x35ec('0x33')](unescape, _0x430f31[_0xa503cc]['\x73\x70\x6c\x69\x74']('\x3d')[0x1]) };
      }
    }
  }return _0x423650;
}function wanzikun_0x185c51(_0x519b6c, _0x1948ff) {
  var _0x34742d = { '\x6e\x49\x79\x46\x4e': function nIyFN(_0x3078ec, _0x3de7d6) {
      return _0x3078ec + _0x3de7d6;
    }, '\x45\x4b\x41\x56\x4c': function EKAVL(_0x556bf5, _0xa415a4) {
      return _0x556bf5 + _0xa415a4;
    }, '\x4d\x6c\x51\x50\x4a': wanzikun_0x35ec('0x34'), '\x4c\x4d\x62\x47\x5a': wanzikun_0x35ec('0x35'), '\x4e\x72\x6a\x55\x74': function NrjUt(_0x2ea910, _0x2405ff) {
      return _0x2ea910(_0x2405ff);
    } };var _0x2b6d7d = new RegExp(_0x34742d[wanzikun_0x35ec('0x36')](_0x34742d[wanzikun_0x35ec('0x37')](_0x34742d[wanzikun_0x35ec('0x38')], _0x1948ff), _0x34742d[wanzikun_0x35ec('0x39')]));var _0xdfc73c = _0x519b6c[wanzikun_0x35ec('0x17')]('\x3f')[0x1][wanzikun_0x35ec('0x3a')](_0x2b6d7d);if (_0xdfc73c != null) return _0x34742d[wanzikun_0x35ec('0x3b')](unescape, _0xdfc73c[0x2]);return null;
}var wanzikun_0xe073f4 = wanzikun_0x64e9eb['\x77\x78\x50\x61\x72\x73\x65'][wanzikun_0x35ec('0x3c')]['\x68\x74\x6d\x6c\x6a\x73\x6f\x6e\x32'][wanzikun_0x35ec('0x3d')];wanzikun_0x4091a3[wanzikun_0x35ec('0x3e')] = function (_0x230c8d) {
  var _0x2d2b27 = { '\x6f\x65\x74\x54\x6b': function oetTk(_0x59096e, _0xee22d) {
      return _0x59096e + _0xee22d;
    }, '\x41\x41\x77\x6a\x49': function AAwjI(_0x5a8822, _0xd1798e) {
      return _0x5a8822 == _0xd1798e;
    }, '\x49\x69\x6d\x66\x47': wanzikun_0x35ec('0x3f'), '\x74\x72\x73\x6c\x4a': function trslJ(_0x3c71a0, _0x3381b7) {
      return _0x3c71a0 == _0x3381b7;
    }, '\x72\x59\x78\x4e\x70': function rYxNp(_0x35ac01, _0x15d4e4) {
      return _0x35ac01 - _0x15d4e4;
    }, '\x4d\x6e\x51\x70\x67': function MnQpg(_0x307bef, _0xcd9550) {
      return _0x307bef * _0xcd9550;
    }, '\x4c\x42\x47\x51\x46': function LBGQF(_0x38ae91, _0xb7e135) {
      return _0x38ae91 * _0xb7e135;
    }, '\x49\x6a\x63\x70\x41': wanzikun_0x35ec('0x40'), '\x54\x50\x74\x50\x47': wanzikun_0x35ec('0x41'), '\x5a\x49\x72\x44\x69': function ZIrDi(_0x19ce6e, _0x54d6f8) {
      return _0x19ce6e === _0x54d6f8;
    }, '\x44\x62\x48\x72\x59': '\x6f\x44\x6c\x73\x7a', '\x52\x6a\x50\x74\x59': wanzikun_0x35ec('0x42'), '\x75\x44\x54\x4a\x45': function uDTJE(_0x40473e) {
      return _0x40473e();
    } };var _0x3f7df9 = _0x230c8d['\x64\x65\x6c\x74\x61'] ? _0x230c8d[wanzikun_0x35ec('0x43')] : 0x1;if (_0x230c8d[wanzikun_0x35ec('0x44')]) {
    if (_0x2d2b27[wanzikun_0x35ec('0x45')](_0x2d2b27['\x44\x62\x48\x72\x59'], _0x2d2b27[wanzikun_0x35ec('0x46')])) {
      wanzikun_0xe073f4 += _0x2d2b27[wanzikun_0x35ec('0x47')](param, '\x3d') + querystring[param] + '\x26';
    } else {
      var _0x2b2bc5 = _0x2d2b27[wanzikun_0x35ec('0x48')](getCurrentPages);var _0x49092c = _0x2b2bc5[_0x2b2bc5['\x6c\x65\x6e\x67\x74\x68'] - _0x2d2b27['\x6f\x65\x74\x54\x6b'](_0x3f7df9, 0x1)];if (_0x49092c['\x70\x61\x67\x65\x46\x6f\x72\x52\x65\x73\x75\x6c\x74']) {
        _0x49092c[wanzikun_0x35ec('0x49')](_0x230c8d[wanzikun_0x35ec('0x44')]);
      } else {
        _0x49092c['\x73\x65\x74\x44\x61\x74\x61'](_0x230c8d['\x64\x61\x74\x61']);
      }
    }
  }wx[wanzikun_0x35ec('0x3e')]({ '\x64\x65\x6c\x74\x61': _0x3f7df9, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x46bf18) {
      _0x2d2b27['\x41\x41\x77\x6a\x49'](_typeof(_0x230c8d['\x73\x75\x63\x63\x65\x73\x73']), _0x2d2b27[wanzikun_0x35ec('0x4a')]) && _0x230c8d[wanzikun_0x35ec('0x4b')](_0x46bf18);
    }, '\x66\x61\x69\x6c': function fail(_0x12f945) {
      _0x2d2b27[wanzikun_0x35ec('0x4c')](_typeof(_0x230c8d[wanzikun_0x35ec('0x4d')]), _0x2d2b27[wanzikun_0x35ec('0x4a')]) && _0x230c8d[wanzikun_0x35ec('0x3f')](_0x12f945);
    }, '\x63\x6f\x6d\x70\x6c\x65\x74\x65': function complete() {
      if (_0x2d2b27[wanzikun_0x35ec('0x4e')] !== _0x2d2b27[wanzikun_0x35ec('0x4f')]) {
        _0x2d2b27[wanzikun_0x35ec('0x4c')](_typeof(_0x230c8d['\x63\x6f\x6d\x70\x6c\x65\x74\x65']), _0x2d2b27[wanzikun_0x35ec('0x4a')]) && _0x230c8d[wanzikun_0x35ec('0x50')]();
      } else {
        date = arguments[0x0] || new Date();date[wanzikun_0x35ec('0x51')](0x1);date['\x73\x65\x74\x4d\x6f\x6e\x74\x68'](_0x2d2b27[wanzikun_0x35ec('0x47')](date[wanzikun_0x35ec('0x2b')](), 0x1));var _0x2da9ca = _0x2d2b27[wanzikun_0x35ec('0x52')](date[wanzikun_0x35ec('0x53')](), _0x2d2b27[wanzikun_0x35ec('0x54')](_0x2d2b27[wanzikun_0x35ec('0x55')](_0x2d2b27['\x4c\x42\x47\x51\x46'](0x18, 0x3c), 0x3c), 0x3e8));var _0x2e69e5 = new Date(_0x2da9ca);return _0x2e69e5[wanzikun_0x35ec('0x56')]();
      }
    } });
};wanzikun_0x4091a3[wanzikun_0x35ec('0x57')] = function (_0xa60260) {
  var _0x55fc5a = { '\x6d\x45\x6c\x56\x44': function mElVD(_0x53f924) {
      return _0x53f924();
    }, '\x61\x71\x48\x6f\x66': wanzikun_0x35ec('0x1') };var _0x2b4875 = _0x55fc5a[wanzikun_0x35ec('0x58')](getApp);var _0xc7b4ae = _0xa60260;var _0x4278ea = _0x2b4875[wanzikun_0x35ec('0x59')];for (var _0x14aa8c in _0x4278ea[wanzikun_0x35ec('0x1')]) {
    _0x4278ea['\x6c\x69\x73\x74'][_0x14aa8c][wanzikun_0x35ec('0x2d')] = _0x4278ea[_0x55fc5a[wanzikun_0x35ec('0x5a')]][_0x14aa8c][wanzikun_0x35ec('0x5b')][wanzikun_0x35ec('0x2e')](/(\?|#)[^"]*/g, '');
  }_0xc7b4ae[wanzikun_0x35ec('0x5c')]({ '\x74\x61\x62\x42\x61\x72': _0x4278ea, 'tabBar.thisurl': _0xc7b4ae[wanzikun_0x35ec('0x5d')] });
};wanzikun_0x4091a3['\x6d\x65\x73\x73\x61\x67\x65'] = function (_0x5e2f1e, _0x4e57fc, _0x3fc2d2) {
  var _0x23fb64 = { '\x62\x76\x56\x79\x47': function bvVyG(_0xf36207, _0x45a7f9) {
      return _0xf36207 + _0x45a7f9;
    }, '\x72\x69\x5a\x57\x48': function riZWH(_0x46d74d, _0x1a9039) {
      return _0x46d74d + _0x1a9039;
    }, '\x54\x57\x54\x4c\x55': function TWTLU(_0x57e003, _0x938f18) {
      return _0x57e003 + _0x938f18;
    }, '\x66\x53\x6a\x65\x67': wanzikun_0x35ec('0x5e'), '\x4a\x43\x6e\x50\x6b': wanzikun_0x35ec('0x5f'), '\x77\x6f\x4b\x42\x7a': wanzikun_0x35ec('0x60'), '\x70\x63\x62\x49\x51': function pcbIQ(_0x34fb19, _0x30f267) {
      return _0x34fb19 + _0x30f267;
    }, '\x70\x47\x77\x73\x63': function pGwsc(_0x4beed9, _0x2869e0) {
      return _0x4beed9 > _0x2869e0;
    }, '\x44\x6f\x65\x54\x52': function DoeTR(_0x28b7b5, _0x457d0d) {
      return _0x28b7b5 + _0x457d0d;
    }, '\x68\x49\x4e\x7a\x51': function hINzQ(_0x7a8853, _0x194029) {
      return _0x7a8853 % _0x194029;
    }, '\x4f\x6b\x58\x6b\x41': function OkXkA(_0x3f41fb, _0x4828fd) {
      return _0x3f41fb + _0x4828fd;
    }, '\x49\x5a\x68\x59\x75': function IZhYu(_0x3f2e08, _0x226d49) {
      return _0x3f2e08 % _0x226d49;
    }, '\x6a\x58\x65\x4c\x48': function jXeLH(_0x1efea2, _0x5b011a) {
      return _0x1efea2 > _0x5b011a;
    }, '\x48\x41\x69\x6d\x61': function HAima(_0x59b625, _0x40bdf2) {
      return _0x59b625 + _0x40bdf2;
    }, '\x79\x70\x50\x54\x78': wanzikun_0x35ec('0x61'), '\x62\x48\x4c\x61\x75': function bHLau(_0x3aa890, _0x519252) {
      return _0x3aa890 === _0x519252;
    }, '\x50\x6d\x6d\x65\x78': wanzikun_0x35ec('0x62'), '\x66\x66\x54\x57\x56': '\x6e\x64\x79\x7a\x4c', '\x71\x77\x4d\x6f\x65': function qwMoe(_0x46c757, _0x242def) {
      return _0x46c757 !== _0x242def;
    }, '\x4e\x6d\x55\x6e\x50': wanzikun_0x35ec('0x63'), '\x66\x6d\x70\x58\x4d': function fmpXM(_0x27e46a, _0x253f2e, _0x3da4a1) {
      return _0x27e46a(_0x253f2e, _0x3da4a1);
    }, '\x41\x42\x72\x77\x50': wanzikun_0x35ec('0x64'), '\x49\x64\x58\x55\x63': wanzikun_0x35ec('0x65'), '\x54\x43\x78\x75\x76': wanzikun_0x35ec('0x66'), '\x42\x7a\x4e\x69\x67': function BzNig(_0x5649c1, _0xf56667) {
      return _0x5649c1 + _0xf56667;
    }, '\x66\x46\x44\x68\x49': wanzikun_0x35ec('0x67'), '\x4a\x62\x68\x55\x5a': wanzikun_0x35ec('0x68'), '\x59\x4a\x49\x6b\x73': function YJIks(_0x9d6c04, _0x4e1515) {
      return _0x9d6c04 == _0x4e1515;
    }, '\x54\x4b\x63\x67\x79': wanzikun_0x35ec('0x6'), '\x4c\x7a\x61\x45\x63': wanzikun_0x35ec('0x69'), '\x4f\x53\x55\x71\x6c': wanzikun_0x35ec('0x6a'), '\x41\x54\x49\x75\x6c': wanzikun_0x35ec('0x6b'), '\x58\x6a\x47\x79\x66': wanzikun_0x35ec('0x6c'), '\x68\x54\x55\x48\x56': '\x72\x65\x64\x69\x72\x65\x63\x74\x3a', '\x4c\x65\x6a\x58\x49': function LejXI(_0x48e460, _0x1e21c5) {
      return _0x48e460 !== _0x1e21c5;
    }, '\x50\x46\x50\x44\x49': '\x4c\x4b\x42\x70\x54', '\x4b\x7a\x66\x6c\x5a': function KzflZ(_0x2c4ff9, _0x2593bf) {
      return _0x2c4ff9 !== _0x2593bf;
    }, '\x4d\x7a\x43\x73\x45': '\x52\x6d\x6b\x63\x63', '\x61\x6e\x75\x4c\x59': wanzikun_0x35ec('0x6d'), '\x6a\x48\x57\x51\x47': function jHWQG(_0x100c15, _0x218004) {
      return _0x100c15 === _0x218004;
    }, '\x69\x72\x75\x69\x62': wanzikun_0x35ec('0x6e'), '\x4e\x54\x69\x6a\x66': '\x73\x75\x63\x63\x65\x73\x73', '\x42\x78\x47\x45\x67': wanzikun_0x35ec('0x6f'), '\x63\x5a\x43\x6f\x71': wanzikun_0x35ec('0x70') };if (!_0x5e2f1e) {
    if (_0x23fb64['\x62\x48\x4c\x61\x75'](_0x23fb64[wanzikun_0x35ec('0x71')], _0x23fb64['\x4a\x62\x68\x55\x5a'])) {
      return !![];
    } else {
      action = action[wanzikun_0x35ec('0x17')]('\x2f');if (action[0x0]) {
        wanzikun_0xe073f4 += _0x23fb64['\x62\x76\x56\x79\x47']('\x63\x3d', action[0x0]) + '\x26';
      }if (action[0x1]) {
        wanzikun_0xe073f4 += _0x23fb64[wanzikun_0x35ec('0x72')](_0x23fb64[wanzikun_0x35ec('0x73')]('\x61\x3d', action[0x1]), '\x26');
      }if (action[0x2]) {
        wanzikun_0xe073f4 += _0x23fb64[wanzikun_0x35ec('0x73')]('\x64\x6f\x3d', action[0x2]) + '\x26';
      }
    }
  }if (_0x23fb64[wanzikun_0x35ec('0x74')](typeof _0x5e2f1e === 'undefined' ? 'undefined' : _typeof(_0x5e2f1e), _0x23fb64[wanzikun_0x35ec('0x75')])) {
    if (_0x23fb64[wanzikun_0x35ec('0x76')] !== wanzikun_0x35ec('0x77')) {
      _0x4e57fc = _0x5e2f1e[wanzikun_0x35ec('0x78')];_0x3fc2d2 = _0x5e2f1e[wanzikun_0x35ec('0x79')];_0x5e2f1e = _0x5e2f1e[wanzikun_0x35ec('0x7a')];
    } else {
      var _0x44b851 = { '\x61\x78\x4e\x6d\x76': wanzikun_0x35ec('0x5e') };var _0x3d0edf = wx['\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65\x53\x79\x6e\x63'](wanzikun_0x35ec('0x5e'));if (_0x3d0edf) {
        wx[wanzikun_0x35ec('0x7b')]();wx[wanzikun_0x35ec('0x7c')](_0x23fb64[wanzikun_0x35ec('0x7d')], ![]);
      }wx[wanzikun_0x35ec('0x7e')]({ '\x74\x69\x74\x6c\x65': _0x23fb64[wanzikun_0x35ec('0x7f')], '\x63\x6f\x6d\x70\x6c\x65\x74\x65': function complete() {
          wx['\x73\x65\x74\x53\x74\x6f\x72\x61\x67\x65\x53\x79\x6e\x63'](_0x44b851[wanzikun_0x35ec('0x80')], !![]);
        }, '\x66\x61\x69\x6c': function fail() {
          wx[wanzikun_0x35ec('0x7c')](_0x44b851[wanzikun_0x35ec('0x80')], ![]);
        } });
    }
  }if (_0x4e57fc) {
    if (_0x23fb64[wanzikun_0x35ec('0x81')] === wanzikun_0x35ec('0x6a')) {
      var _0x5e041c = _0x4e57fc[wanzikun_0x35ec('0x82')](0x0, 0x9),
          wanzikun_0xe073f4 = '',
          _0x459ce5 = '';if (_0x23fb64[wanzikun_0x35ec('0x74')](_0x5e041c, _0x23fb64[wanzikun_0x35ec('0x83')])) {
        _0x459ce5 = _0x23fb64[wanzikun_0x35ec('0x84')];wanzikun_0xe073f4 = _0x4e57fc[wanzikun_0x35ec('0x82')](0x9);
      } else if (_0x23fb64[wanzikun_0x35ec('0x74')](_0x5e041c, _0x23fb64[wanzikun_0x35ec('0x85')])) {
        if (_0x23fb64[wanzikun_0x35ec('0x86')](wanzikun_0x35ec('0x87'), _0x23fb64[wanzikun_0x35ec('0x88')])) {
          return ![];
        } else {
          _0x459ce5 = '\x72\x65\x64\x69\x72\x65\x63\x74\x54\x6f';wanzikun_0xe073f4 = _0x4e57fc[wanzikun_0x35ec('0x82')](0x9);
        }
      } else {
        if (_0x23fb64[wanzikun_0x35ec('0x89')](_0x23fb64[wanzikun_0x35ec('0x8a')], wanzikun_0x35ec('0x8b'))) {
          theRequest[i] = { 'name': strs[i][wanzikun_0x35ec('0x17')]('\x3d')[0x0], 'value': unescape(strs[i][wanzikun_0x35ec('0x17')]('\x3d')[0x1]) };
        } else {
          wanzikun_0xe073f4 = _0x4e57fc;_0x459ce5 = _0x23fb64[wanzikun_0x35ec('0x8c')];
        }
      }
    } else {
      var _0x3a1ada = _0x23fb64['\x77\x6f\x4b\x42\x7a']['\x73\x70\x6c\x69\x74']('\x7c'),
          _0x2eefde = 0x0;while (!![]) {
        switch (_0x3a1ada[_0x2eefde++]) {case '\x30':
            _0x25854a = _0x25854a['\x72\x65\x70\x6c\x61\x63\x65'](/ss|SS/, date[wanzikun_0x35ec('0x8d')]() > 0x9 ? date[wanzikun_0x35ec('0x8d')]()[wanzikun_0x35ec('0x8e')]() : _0x23fb64[wanzikun_0x35ec('0x8f')]('\x30', date[wanzikun_0x35ec('0x8d')]()));continue;case '\x31':
            _0x25854a = _0x25854a[wanzikun_0x35ec('0x2e')](/h|H/g, date['\x67\x65\x74\x48\x6f\x75\x72\x73']());continue;case '\x32':
            _0x25854a = _0x25854a[wanzikun_0x35ec('0x2e')](/MM/, _0x23fb64['\x70\x47\x77\x73\x63'](date[wanzikun_0x35ec('0x2b')](), 0x9) ? _0x23fb64[wanzikun_0x35ec('0x8f')](date['\x67\x65\x74\x4d\x6f\x6e\x74\x68'](), 0x1) : _0x23fb64[wanzikun_0x35ec('0x8f')]('\x30', _0x23fb64[wanzikun_0x35ec('0x90')](date[wanzikun_0x35ec('0x2b')](), 0x1)));continue;case '\x33':
            _0x25854a = _0x25854a['\x72\x65\x70\x6c\x61\x63\x65'](/dd|DD/, date[wanzikun_0x35ec('0x56')]() > 0x9 ? date[wanzikun_0x35ec('0x56')]()[wanzikun_0x35ec('0x8e')]() : _0x23fb64[wanzikun_0x35ec('0x90')]('\x30', date[wanzikun_0x35ec('0x56')]()));continue;case '\x34':
            var _0x25854a = formatStr;continue;case '\x35':
            _0x25854a = _0x25854a[wanzikun_0x35ec('0x2e')](/yy|YY/, _0x23fb64[wanzikun_0x35ec('0x91')](date['\x67\x65\x74\x59\x65\x61\x72']() % 0x64, 0x9) ? _0x23fb64['\x68\x49\x4e\x7a\x51'](date['\x67\x65\x74\x59\x65\x61\x72'](), 0x64)[wanzikun_0x35ec('0x8e')]() : _0x23fb64[wanzikun_0x35ec('0x92')]('\x30', _0x23fb64[wanzikun_0x35ec('0x93')](date['\x67\x65\x74\x59\x65\x61\x72'](), 0x64)));continue;case '\x36':
            _0x25854a = _0x25854a[wanzikun_0x35ec('0x2e')](/m/g, date[wanzikun_0x35ec('0x94')]());continue;case '\x37':
            _0x25854a = _0x25854a[wanzikun_0x35ec('0x2e')](/hh|HH/, _0x23fb64[wanzikun_0x35ec('0x95')](date[wanzikun_0x35ec('0x96')](), 0x9) ? date[wanzikun_0x35ec('0x96')]()[wanzikun_0x35ec('0x8e')]() : _0x23fb64[wanzikun_0x35ec('0x92')]('\x30', date[wanzikun_0x35ec('0x96')]()));continue;case '\x38':
            _0x25854a = _0x25854a['\x72\x65\x70\x6c\x61\x63\x65'](/mm/, _0x23fb64[wanzikun_0x35ec('0x95')](date[wanzikun_0x35ec('0x94')](), 0x9) ? date[wanzikun_0x35ec('0x94')]()[wanzikun_0x35ec('0x8e')]() : _0x23fb64[wanzikun_0x35ec('0x97')]('\x30', date['\x67\x65\x74\x4d\x69\x6e\x75\x74\x65\x73']()));continue;case '\x39':
            _0x25854a = _0x25854a[wanzikun_0x35ec('0x2e')](/M/g, date[wanzikun_0x35ec('0x2b')]());continue;case '\x31\x30':
            _0x25854a = _0x25854a[wanzikun_0x35ec('0x2e')](/w|W/g, _0x565ed6[date[wanzikun_0x35ec('0x98')]()]);continue;case '\x31\x31':
            var _0x565ed6 = ['\u65E5', '\u4E00', '\u4E8C', '\u4E09', '\u56DB', '\u4E94', '\u516D'];continue;case '\x31\x32':
            _0x25854a = _0x25854a[wanzikun_0x35ec('0x2e')](/yyyy|YYYY/, date[wanzikun_0x35ec('0x2c')]());continue;case '\x31\x33':
            date = arguments[0x1] || new Date();continue;case '\x31\x34':
            _0x25854a = _0x25854a[wanzikun_0x35ec('0x2e')](/d|D/g, date['\x67\x65\x74\x44\x61\x74\x65']());continue;case '\x31\x35':
            return _0x25854a;case '\x31\x36':
            _0x25854a = _0x25854a[wanzikun_0x35ec('0x2e')](/s|S/g, date['\x67\x65\x74\x53\x65\x63\x6f\x6e\x64\x73']());continue;case '\x31\x37':
            formatStr = arguments[0x0] || _0x23fb64[wanzikun_0x35ec('0x99')];continue;}break;
      }
    }
  }if (!_0x3fc2d2) {
    if (_0x23fb64[wanzikun_0x35ec('0x9a')](_0x23fb64[wanzikun_0x35ec('0x9b')], wanzikun_0x35ec('0x9c'))) {
      return ![];
    } else {
      _0x3fc2d2 = _0x23fb64[wanzikun_0x35ec('0x9d')];
    }
  }if (_0x23fb64[wanzikun_0x35ec('0x74')](_0x3fc2d2, '\x73\x75\x63\x63\x65\x73\x73')) {
    wx['\x73\x68\x6f\x77\x54\x6f\x61\x73\x74']({ '\x74\x69\x74\x6c\x65': _0x5e2f1e, '\x69\x63\x6f\x6e': _0x23fb64[wanzikun_0x35ec('0x9d')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0, '\x6d\x61\x73\x6b': wanzikun_0xe073f4 ? !![] : ![], '\x63\x6f\x6d\x70\x6c\x65\x74\x65': function complete() {
        var _0x113e78 = { '\x4e\x79\x62\x72\x77': function Nybrw(_0x59f0ae, _0x474cac) {
            return _0x59f0ae + _0x474cac;
          } };if (_0x23fb64[wanzikun_0x35ec('0x9e')](_0x23fb64['\x50\x6d\x6d\x65\x78'], _0x23fb64[wanzikun_0x35ec('0x9f')])) {
          wanzikun_0xe073f4 += _0x113e78[wanzikun_0x35ec('0xa0')](_0x113e78[wanzikun_0x35ec('0xa0')]('\x61\x3d', action[0x1]), '\x26');
        } else {
          if (wanzikun_0xe073f4) {
            if (_0x23fb64[wanzikun_0x35ec('0xa1')](wanzikun_0x35ec('0xa2'), _0x23fb64[wanzikun_0x35ec('0xa3')])) {
              _0x23fb64['\x66\x6d\x70\x58\x4d'](setTimeout, function () {
                wx[_0x459ce5]({ '\x75\x72\x6c': wanzikun_0xe073f4 });
              }, 0x708);
            } else {
              var _0x426ddf = event ? event[wanzikun_0x35ec('0xa4')][wanzikun_0x35ec('0xa5')][wanzikun_0x35ec('0xa6')] : '';if (!_0x426ddf) {
                return ![];
              }wx[wanzikun_0x35ec('0xa7')]({ '\x75\x72\x6c\x73': [_0x426ddf] });
            }
          }
        }
      } });
  } else if (_0x23fb64['\x59\x4a\x49\x6b\x73'](_0x3fc2d2, wanzikun_0x35ec('0xa8'))) {
    if (_0x23fb64[wanzikun_0x35ec('0x89')](_0x23fb64[wanzikun_0x35ec('0xa9')], wanzikun_0x35ec('0xaa'))) {
      wx['\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c']({ '\x74\x69\x74\x6c\x65': _0x23fb64[wanzikun_0x35ec('0xab')], '\x63\x6f\x6e\x74\x65\x6e\x74': _0x5e2f1e, '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![], '\x63\x6f\x6d\x70\x6c\x65\x74\x65': function complete() {
          if (wanzikun_0xe073f4) {
            wx[_0x459ce5]({ '\x75\x72\x6c': wanzikun_0xe073f4 });
          }
        } });
    } else {
      if (!string) {
        return string;
      }var _0x37676a = [_0x23fb64[wanzikun_0x35ec('0xac')], _0x23fb64[wanzikun_0x35ec('0xad')], _0x23fb64[wanzikun_0x35ec('0xae')]];var _0x5471f8 = string[wanzikun_0x35ec('0x3a')](new RegExp(_0x37676a['\x6a\x6f\x69\x6e']('\x7c'), '\x67'));if (_0x5471f8) {
        for (var _0x2c5028 in _0x5471f8) {
          string = string[wanzikun_0x35ec('0x2e')](_0x5471f8[_0x2c5028], _0x23fb64['\x42\x7a\x4e\x69\x67'](_0x23fb64[wanzikun_0x35ec('0xaf')](_0x23fb64[wanzikun_0x35ec('0xb0')], _0x5471f8[_0x2c5028][wanzikun_0x35ec('0xb1')](0x0)['\x74\x6f\x53\x74\x72\x69\x6e\x67'](0x10)[wanzikun_0x35ec('0xb2')]()), '\x5d'));
        }
      }return string;
    }
  }
};wanzikun_0x4091a3['\x75\x73\x65\x72'] = wanzikun_0x4091a3[wanzikun_0x35ec('0xb3')];wanzikun_0x4091a3[wanzikun_0x35ec('0x7e')] = function () {
  var _0x3c83ef = { '\x42\x51\x56\x6b\x42': wanzikun_0x35ec('0x5e'), '\x56\x4c\x51\x6b\x50': wanzikun_0x35ec('0x5f') };var _0x2815af = wx[wanzikun_0x35ec('0xb4')](_0x3c83ef[wanzikun_0x35ec('0xb5')]);if (_0x2815af) {
    wx['\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67']();wx[wanzikun_0x35ec('0x7c')](wanzikun_0x35ec('0x5e'), ![]);
  }wx['\x73\x68\x6f\x77\x4c\x6f\x61\x64\x69\x6e\x67']({ '\x74\x69\x74\x6c\x65': _0x3c83ef[wanzikun_0x35ec('0xb6')], '\x63\x6f\x6d\x70\x6c\x65\x74\x65': function complete() {
      wx[wanzikun_0x35ec('0x7c')](wanzikun_0x35ec('0x5e'), !![]);
    }, '\x66\x61\x69\x6c': function fail() {
      wx[wanzikun_0x35ec('0x7c')]('\x69\x73\x53\x68\x6f\x77\x4c\x6f\x61\x64\x69\x6e\x67', ![]);
    } });
};wanzikun_0x4091a3[wanzikun_0x35ec('0xb7')] = function (_0x585a68) {
  var wanzikun_0xe073f4 = _0x585a68 ? _0x585a68[wanzikun_0x35ec('0xa4')][wanzikun_0x35ec('0xa5')][wanzikun_0x35ec('0xa6')] : '';if (!wanzikun_0xe073f4) {
    return ![];
  }wx[wanzikun_0x35ec('0xa7')]({ '\x75\x72\x6c\x73': [wanzikun_0xe073f4] });
};wanzikun_0x4091a3[wanzikun_0x35ec('0xb8')] = function (_0x1ce30e) {
  var _0x2bb85b = { '\x78\x4b\x66\x65\x51': wanzikun_0x35ec('0x64'), '\x48\x64\x4c\x7a\x74': wanzikun_0x35ec('0x65'), '\x41\x4d\x6f\x4f\x49': wanzikun_0x35ec('0x66'), '\x5a\x75\x6d\x65\x6d': function Zumem(_0xbf98fd, _0x367fce) {
      return _0xbf98fd + _0x367fce;
    }, '\x4e\x4b\x64\x6a\x7a': function NKdjz(_0x849d9b, _0x2102df) {
      return _0x849d9b + _0x2102df;
    }, '\x58\x49\x4f\x45\x43': wanzikun_0x35ec('0x67') };if (!_0x1ce30e) {
    return _0x1ce30e;
  }var _0x192bba = [_0x2bb85b[wanzikun_0x35ec('0xb9')], _0x2bb85b[wanzikun_0x35ec('0xba')], _0x2bb85b['\x41\x4d\x6f\x4f\x49']];var _0x1c5dee = _0x1ce30e[wanzikun_0x35ec('0x3a')](new RegExp(_0x192bba[wanzikun_0x35ec('0xbb')]('\x7c'), '\x67'));if (_0x1c5dee) {
    for (var _0x23b847 in _0x1c5dee) {
      _0x1ce30e = _0x1ce30e['\x72\x65\x70\x6c\x61\x63\x65'](_0x1c5dee[_0x23b847], _0x2bb85b[wanzikun_0x35ec('0xbc')](_0x2bb85b[wanzikun_0x35ec('0xbd')](_0x2bb85b[wanzikun_0x35ec('0xbe')], _0x1c5dee[_0x23b847]['\x63\x6f\x64\x65\x50\x6f\x69\x6e\x74\x41\x74'](0x0)[wanzikun_0x35ec('0x8e')](0x10)[wanzikun_0x35ec('0xb2')]()), '\x5d'));
    }
  }return _0x1ce30e;
};wanzikun_0x4091a3['\x64\x61\x74\x65'] = function () {
  var _0x422ffc = { '\x59\x57\x41\x62\x45': function YWAbE(_0x18e38b, _0x3c7f9b) {
      return _0x18e38b % _0x3c7f9b;
    }, '\x6a\x64\x6c\x66\x58': function jdlfX(_0x458c21, _0x35e032) {
      return _0x458c21 % _0x35e032;
    }, '\x77\x59\x52\x62\x72': function wYRbr(_0x27a94f, _0xf857a5) {
      return _0x27a94f % _0xf857a5;
    }, '\x5a\x51\x52\x4c\x67': wanzikun_0x35ec('0x61'), '\x67\x4c\x4d\x6d\x53': function gLMmS(_0x35c9f4, _0x3bd926) {
      return _0x35c9f4 > _0x3bd926;
    }, '\x75\x79\x4e\x51\x4f': function uyNQO(_0x12fd40, _0x17e090) {
      return _0x12fd40 + _0x17e090;
    }, '\x46\x4d\x64\x6c\x50': function FMdlP(_0x45e98c, _0x4f0c4d) {
      return _0x45e98c % _0x4f0c4d;
    }, '\x44\x71\x65\x49\x78': function DqeIx(_0xac40b1, _0x10f682) {
      return _0xac40b1 % _0x10f682;
    }, '\x57\x56\x48\x49\x47': function WVHIG(_0x4364c3, _0x2dd61b) {
      return _0x4364c3 + _0x2dd61b;
    }, '\x52\x4e\x50\x62\x56': function RNPbV(_0x3f6610, _0x43a03c) {
      return _0x3f6610 + _0x43a03c;
    }, '\x69\x6d\x56\x55\x6a': function imVUj(_0x486e61, _0x530772) {
      return _0x486e61 > _0x530772;
    }, '\x66\x79\x44\x4b\x5a': function fyDKZ(_0x616936, _0x5c441c) {
      return _0x616936 + _0x5c441c;
    }, '\x7a\x73\x66\x75\x62': function zsfub(_0x5d330d, _0x3fb053) {
      return _0x5d330d * _0x3fb053;
    }, '\x57\x45\x58\x58\x41': function WEXXA(_0x4835c6, _0x5888e9) {
      return _0x4835c6 + _0x5888e9;
    }, '\x55\x56\x6c\x58\x44': function UVlXD(_0x4a1168, _0x4b4db4) {
      return _0x4a1168 + _0x4b4db4;
    }, '\x4b\x6d\x6d\x57\x57': function KmmWW(_0x6d31ee, _0x370405) {
      return _0x6d31ee * _0x370405;
    }, '\x42\x70\x71\x50\x51': function BpqPQ(_0x4ce9f8, _0x3e46d9) {
      return _0x4ce9f8 * _0x3e46d9;
    }, '\x66\x55\x6e\x69\x43': function fUniC(_0x98ba91, _0x86b363) {
      return _0x98ba91 + _0x86b363;
    }, '\x4c\x5a\x6b\x63\x4b': function LZkcK(_0x40f45b, _0x22881c) {
      return _0x40f45b(_0x22881c);
    }, '\x55\x5a\x77\x48\x71': function UZwHq(_0x16a0ee, _0x8dd485) {
      return _0x16a0ee / _0x8dd485;
    }, '\x67\x42\x45\x56\x47': function gBEVG(_0x424523, _0x11210f) {
      return _0x424523 - _0x11210f;
    }, '\x53\x4c\x7a\x64\x47': function SLzdG(_0x54d905, _0x232b59) {
      return _0x54d905 / _0x232b59;
    }, '\x6a\x6c\x6a\x72\x78': function jljrx(_0x401e27, _0x5b987a) {
      return _0x401e27 - _0x5b987a;
    }, '\x66\x4c\x6a\x42\x65': function fLjBe(_0x50d5be, _0x4f805e) {
      return _0x50d5be - _0x4f805e;
    }, '\x77\x72\x55\x76\x42': function wrUvB(_0x2e952b, _0x8722d4) {
      return _0x2e952b(_0x8722d4);
    }, '\x68\x68\x61\x6a\x72': function hhajr(_0xa68d14, _0x3ee74e) {
      return _0xa68d14(_0x3ee74e);
    }, '\x51\x70\x52\x41\x4e': function QpRAN(_0x4c715c, _0x3e9438) {
      return _0x4c715c / _0x3e9438;
    }, '\x78\x41\x6c\x65\x64': function xAled(_0x217bf2, _0x61494e) {
      return _0x217bf2 - _0x61494e;
    }, '\x4e\x4e\x6f\x51\x44': function NNoQD(_0x5cafce, _0x59cebe) {
      return _0x5cafce + _0x59cebe;
    }, '\x45\x50\x57\x49\x77': function EPWIw(_0x3a0b98, _0x10d81d) {
      return _0x3a0b98 - _0x10d81d;
    }, '\x6a\x62\x47\x6c\x72': wanzikun_0x35ec('0xbf'), '\x6e\x6c\x78\x4e\x5a': '\x76\x61\x72\x20\x64\x20\x3d\x20\x6e\x65\x77\x20\x44\x61\x74\x65\x28', '\x59\x4c\x77\x62\x62': function YLwbb(_0x1dce04, _0x9bb259) {
      return _0x1dce04 === _0x9bb259;
    }, '\x48\x6d\x42\x62\x4d': wanzikun_0x35ec('0xc0'), '\x46\x62\x75\x69\x50': wanzikun_0x35ec('0xc1'), '\x45\x70\x4f\x59\x63': '\x32\x7c\x35\x7c\x33\x7c\x31\x7c\x30\x7c\x34', '\x51\x44\x58\x45\x4d': function QDXEM(_0x208c35, _0x15bb87) {
      return _0x208c35(_0x15bb87);
    }, '\x72\x6c\x64\x72\x67': function rldrg(_0x6d7b6, _0x5071ed) {
      return _0x6d7b6 - _0x5071ed;
    }, '\x61\x47\x78\x6c\x6d': function aGxlm(_0x241939, _0x4f3e88) {
      return _0x241939 == _0x4f3e88;
    }, '\x45\x47\x50\x73\x70': wanzikun_0x35ec('0x3f'), '\x4e\x4a\x68\x69\x70': function NJhip(_0x475692, _0x204f31) {
      return _0x475692 != _0x204f31;
    }, '\x66\x4d\x42\x47\x7a': wanzikun_0x35ec('0xc2'), '\x51\x43\x43\x4d\x68': function QCCMh(_0x48df1b, _0x5bbdae) {
      return _0x48df1b > _0x5bbdae;
    }, '\x4c\x6a\x67\x43\x50': function LjgCP(_0x34da74, _0x2d736b) {
      return _0x34da74 !== _0x2d736b;
    }, '\x42\x61\x55\x41\x75': wanzikun_0x35ec('0xc3'), '\x52\x63\x43\x55\x62': wanzikun_0x35ec('0xc4'), '\x72\x56\x6d\x6d\x67': function rVmmg(_0xd32255, _0x2934f1) {
      return _0xd32255 > _0x2934f1;
    }, '\x70\x78\x72\x51\x4e': function pxrQN(_0x1fd37c, _0x2d0877) {
      return _0x1fd37c < _0x2d0877;
    }, '\x62\x76\x68\x67\x61': function bvhga(_0x16b5b3, _0x5a3dd7) {
      return _0x16b5b3 - _0x5a3dd7;
    }, '\x71\x57\x44\x57\x41': function qWDWA(_0x11a054, _0x2624cc) {
      return _0x11a054(_0x2624cc);
    }, '\x74\x66\x52\x52\x76': function tfRRv(_0x2b13d2, _0x544420) {
      return _0x2b13d2 > _0x544420;
    }, '\x75\x51\x79\x67\x62': wanzikun_0x35ec('0xc5'), '\x44\x62\x61\x72\x56': function DbarV(_0x22c3ca, _0x1ec021) {
      return _0x22c3ca > _0x1ec021;
    }, '\x4e\x46\x4a\x62\x5a': function NFJbZ(_0x43aa29, _0x44870e) {
      return _0x43aa29 > _0x44870e;
    }, '\x6f\x5a\x6f\x61\x54': function oZoaT(_0x2cab25, _0x3967d0) {
      return _0x2cab25 !== _0x3967d0;
    }, '\x53\x45\x63\x51\x7a': wanzikun_0x35ec('0xc6'), '\x4a\x4f\x6a\x6d\x78': wanzikun_0x35ec('0xc7'), '\x5a\x72\x45\x5a\x45': wanzikun_0x35ec('0xc8'), '\x73\x58\x43\x42\x43': wanzikun_0x35ec('0xc9'), '\x73\x41\x52\x58\x4f': function sARXO(_0x850e43, _0x1fab3c) {
      return _0x850e43 == _0x1fab3c;
    }, '\x46\x64\x64\x4f\x4f': '\x32\x31\x30\x30', '\x69\x58\x68\x66\x77': function iXhfw(_0x3721e6, _0x3d11ff) {
      return _0x3721e6 < _0x3d11ff;
    }, '\x71\x44\x76\x51\x4f': wanzikun_0x35ec('0xca'), '\x4b\x63\x47\x70\x4a': wanzikun_0x35ec('0xcb'), '\x53\x42\x4e\x6a\x54': wanzikun_0x35ec('0xcc'), '\x4b\x64\x49\x6c\x4f': function KdIlO(_0x24434e, _0x14c921) {
      return _0x24434e(_0x14c921);
    }, '\x4f\x77\x70\x53\x4d': function OwpSM(_0x3f50fe, _0x614b60) {
      return _0x3f50fe > _0x614b60;
    }, '\x48\x53\x6f\x61\x61': function HSoaa(_0x383378, _0x5b2355, _0x44a567) {
      return _0x383378(_0x5b2355, _0x44a567);
    }, '\x47\x72\x50\x54\x61': wanzikun_0x35ec('0xcd'), '\x63\x65\x77\x4e\x6c': wanzikun_0x35ec('0xce'), '\x65\x57\x57\x6b\x47': wanzikun_0x35ec('0x4b'), '\x78\x43\x43\x71\x6b': wanzikun_0x35ec('0xcf'), '\x53\x61\x66\x4a\x6b': wanzikun_0x35ec('0xd0'), '\x71\x44\x6f\x45\x41': function qDoEA(_0x4b6ce3, _0x283e3b) {
      return _0x4b6ce3 == _0x283e3b;
    }, '\x68\x79\x41\x62\x67': function hyAbg(_0x3d8209) {
      return _0x3d8209();
    }, '\x42\x4b\x73\x6f\x65': function BKsoe(_0x889725, _0x255869) {
      return _0x889725 + _0x255869;
    }, '\x45\x73\x4f\x64\x69': wanzikun_0x35ec('0xd1'), '\x6f\x79\x67\x53\x41': function oygSA(_0x18ad9b, _0x2028fa) {
      return _0x18ad9b * _0x2028fa;
    } };this[wanzikun_0x35ec('0xd2')] = function (_0x5f158d) {
    return 0x0 == _0x422ffc[wanzikun_0x35ec('0xd3')](_0x5f158d[wanzikun_0x35ec('0xd4')](), 0x4) && (_0x422ffc[wanzikun_0x35ec('0xd5')](_0x5f158d[wanzikun_0x35ec('0xd4')](), 0x64) != 0x0 || _0x422ffc[wanzikun_0x35ec('0xd6')](_0x5f158d[wanzikun_0x35ec('0xd4')](), 0x190) == 0x0);
  };this[wanzikun_0x35ec('0xd7')] = function (_0x38aea7, _0x3ce9dd) {
    var _0x2e8f60 = wanzikun_0x35ec('0xd8')[wanzikun_0x35ec('0x17')]('\x7c'),
        _0x1c9322 = 0x0;while (!![]) {
      switch (_0x2e8f60[_0x1c9322++]) {case '\x30':
          var _0xa00cfb = ['\u65E5', '\u4E00', '\u4E8C', '\u4E09', '\u56DB', '\u4E94', '\u516D'];continue;case '\x31':
          _0x6aa349 = _0x6aa349[wanzikun_0x35ec('0x2e')](/d|D/g, _0x3ce9dd['\x67\x65\x74\x44\x61\x74\x65']());continue;case '\x32':
          _0x6aa349 = _0x6aa349[wanzikun_0x35ec('0x2e')](/h|H/g, _0x3ce9dd[wanzikun_0x35ec('0x96')]());continue;case '\x33':
          _0x38aea7 = arguments[0x0] || _0x422ffc[wanzikun_0x35ec('0xd9')];continue;case '\x34':
          _0x6aa349 = _0x6aa349['\x72\x65\x70\x6c\x61\x63\x65'](/ss|SS/, _0x422ffc[wanzikun_0x35ec('0xda')](_0x3ce9dd[wanzikun_0x35ec('0x8d')](), 0x9) ? _0x3ce9dd['\x67\x65\x74\x53\x65\x63\x6f\x6e\x64\x73']()[wanzikun_0x35ec('0x8e')]() : _0x422ffc['\x75\x79\x4e\x51\x4f']('\x30', _0x3ce9dd[wanzikun_0x35ec('0x8d')]()));continue;case '\x35':
          _0x6aa349 = _0x6aa349[wanzikun_0x35ec('0x2e')](/w|W/g, _0xa00cfb[_0x3ce9dd[wanzikun_0x35ec('0x98')]()]);continue;case '\x36':
          _0x6aa349 = _0x6aa349[wanzikun_0x35ec('0x2e')](/s|S/g, _0x3ce9dd[wanzikun_0x35ec('0x8d')]());continue;case '\x37':
          _0x6aa349 = _0x6aa349[wanzikun_0x35ec('0x2e')](/yyyy|YYYY/, _0x3ce9dd[wanzikun_0x35ec('0x2c')]());continue;case '\x38':
          return _0x6aa349;case '\x39':
          _0x6aa349 = _0x6aa349['\x72\x65\x70\x6c\x61\x63\x65'](/mm/, _0x422ffc[wanzikun_0x35ec('0xda')](_0x3ce9dd[wanzikun_0x35ec('0x94')](), 0x9) ? _0x3ce9dd[wanzikun_0x35ec('0x94')]()[wanzikun_0x35ec('0x8e')]() : '\x30' + _0x3ce9dd[wanzikun_0x35ec('0x94')]());continue;case '\x31\x30':
          _0x6aa349 = _0x6aa349[wanzikun_0x35ec('0x2e')](/m/g, _0x3ce9dd[wanzikun_0x35ec('0x94')]());continue;case '\x31\x31':
          _0x6aa349 = _0x6aa349[wanzikun_0x35ec('0x2e')](/yy|YY/, _0x422ffc[wanzikun_0x35ec('0xda')](_0x422ffc[wanzikun_0x35ec('0xd6')](_0x3ce9dd[wanzikun_0x35ec('0xd4')](), 0x64), 0x9) ? _0x422ffc['\x46\x4d\x64\x6c\x50'](_0x3ce9dd[wanzikun_0x35ec('0xd4')](), 0x64)[wanzikun_0x35ec('0x8e')]() : _0x422ffc[wanzikun_0x35ec('0xdb')]('\x30', _0x422ffc['\x44\x71\x65\x49\x78'](_0x3ce9dd['\x67\x65\x74\x59\x65\x61\x72'](), 0x64)));continue;case '\x31\x32':
          _0x6aa349 = _0x6aa349[wanzikun_0x35ec('0x2e')](/M/g, _0x3ce9dd[wanzikun_0x35ec('0x2b')]());continue;case '\x31\x33':
          _0x6aa349 = _0x6aa349[wanzikun_0x35ec('0x2e')](/hh|HH/, _0x3ce9dd[wanzikun_0x35ec('0x96')]() > 0x9 ? _0x3ce9dd[wanzikun_0x35ec('0x96')]()['\x74\x6f\x53\x74\x72\x69\x6e\x67']() : _0x422ffc[wanzikun_0x35ec('0xdb')]('\x30', _0x3ce9dd[wanzikun_0x35ec('0x96')]()));continue;case '\x31\x34':
          _0x6aa349 = _0x6aa349['\x72\x65\x70\x6c\x61\x63\x65'](/MM/, _0x422ffc[wanzikun_0x35ec('0xda')](_0x3ce9dd[wanzikun_0x35ec('0x2b')](), 0x9) ? _0x422ffc[wanzikun_0x35ec('0xdc')](_0x3ce9dd[wanzikun_0x35ec('0x2b')](), 0x1) : _0x422ffc[wanzikun_0x35ec('0xdd')]('\x30', _0x422ffc[wanzikun_0x35ec('0xdd')](_0x3ce9dd['\x67\x65\x74\x4d\x6f\x6e\x74\x68'](), 0x1)));continue;case '\x31\x35':
          _0x6aa349 = _0x6aa349['\x72\x65\x70\x6c\x61\x63\x65'](/dd|DD/, _0x422ffc[wanzikun_0x35ec('0xde')](_0x3ce9dd[wanzikun_0x35ec('0x56')](), 0x9) ? _0x3ce9dd[wanzikun_0x35ec('0x56')]()[wanzikun_0x35ec('0x8e')]() : '\x30' + _0x3ce9dd[wanzikun_0x35ec('0x56')]());continue;case '\x31\x36':
          var _0x6aa349 = _0x38aea7;continue;case '\x31\x37':
          _0x3ce9dd = arguments[0x1] || new Date();continue;}break;
    }
  };this['\x64\x61\x74\x65\x41\x64\x64'] = function (_0x5d3d5e, _0x3c2707, _0x1effbe) {
    _0x1effbe = arguments[0x2] || new Date();switch (_0x5d3d5e) {case '\x73':
        return new Date(_0x422ffc[wanzikun_0x35ec('0xdf')](_0x1effbe['\x67\x65\x74\x54\x69\x6d\x65'](), _0x422ffc['\x7a\x73\x66\x75\x62'](0x3e8, _0x3c2707)));case '\x6e':
        return new Date(_0x1effbe[wanzikun_0x35ec('0x53')]() + 0xea60 * _0x3c2707);case '\x68':
        return new Date(_0x422ffc[wanzikun_0x35ec('0xe0')](_0x1effbe[wanzikun_0x35ec('0x53')](), _0x422ffc[wanzikun_0x35ec('0xe1')](0x36ee80, _0x3c2707)));case '\x64':
        return new Date(_0x1effbe[wanzikun_0x35ec('0x53')]() + _0x422ffc[wanzikun_0x35ec('0xe1')](0x5265c00, _0x3c2707));case '\x77':
        return new Date(_0x422ffc[wanzikun_0x35ec('0xe2')](_0x1effbe['\x67\x65\x74\x54\x69\x6d\x65'](), _0x422ffc['\x4b\x6d\x6d\x57\x57'](_0x422ffc[wanzikun_0x35ec('0xe3')](0x5265c00, 0x7), _0x3c2707)));case '\x6d':
        return new Date(_0x1effbe['\x67\x65\x74\x46\x75\x6c\x6c\x59\x65\x61\x72'](), _0x1effbe[wanzikun_0x35ec('0x2b')]() + _0x3c2707, _0x1effbe[wanzikun_0x35ec('0x56')](), _0x1effbe[wanzikun_0x35ec('0x96')](), _0x1effbe[wanzikun_0x35ec('0x94')](), _0x1effbe[wanzikun_0x35ec('0x8d')]());case '\x79':
        return new Date(_0x422ffc[wanzikun_0x35ec('0xe4')](_0x1effbe['\x67\x65\x74\x46\x75\x6c\x6c\x59\x65\x61\x72'](), _0x3c2707), _0x1effbe[wanzikun_0x35ec('0x2b')](), _0x1effbe[wanzikun_0x35ec('0x56')](), _0x1effbe[wanzikun_0x35ec('0x96')](), _0x1effbe[wanzikun_0x35ec('0x94')](), _0x1effbe['\x67\x65\x74\x53\x65\x63\x6f\x6e\x64\x73']());}
  };this[wanzikun_0x35ec('0xe5')] = function (_0x4d82f2, _0x2cd9d6, _0x51a556) {
    switch (_0x4d82f2) {case '\x73':
        return _0x422ffc[wanzikun_0x35ec('0xe6')](parseInt, _0x422ffc[wanzikun_0x35ec('0xe7')](_0x422ffc[wanzikun_0x35ec('0xe8')](_0x51a556, _0x2cd9d6), 0x3e8));case '\x6e':
        return _0x422ffc['\x4c\x5a\x6b\x63\x4b'](parseInt, _0x422ffc[wanzikun_0x35ec('0xe9')](_0x422ffc[wanzikun_0x35ec('0xea')](_0x51a556, _0x2cd9d6), 0xea60));case '\x68':
        return _0x422ffc[wanzikun_0x35ec('0xe6')](parseInt, _0x422ffc['\x53\x4c\x7a\x64\x47'](_0x422ffc[wanzikun_0x35ec('0xeb')](_0x51a556, _0x2cd9d6), 0x36ee80));case '\x64':
        return _0x422ffc[wanzikun_0x35ec('0xec')](parseInt, _0x422ffc['\x53\x4c\x7a\x64\x47'](_0x51a556 - _0x2cd9d6, 0x5265c00));case '\x77':
        return _0x422ffc[wanzikun_0x35ec('0xed')](parseInt, _0x422ffc[wanzikun_0x35ec('0xee')](_0x422ffc[wanzikun_0x35ec('0xeb')](_0x51a556, _0x2cd9d6), 0x5265c00 * 0x7));case '\x6d':
        return _0x422ffc[wanzikun_0x35ec('0xef')](_0x422ffc[wanzikun_0x35ec('0xe4')](_0x422ffc[wanzikun_0x35ec('0xe4')](_0x51a556[wanzikun_0x35ec('0x2b')](), 0x1), _0x422ffc[wanzikun_0x35ec('0xe3')](_0x422ffc[wanzikun_0x35ec('0xef')](_0x51a556[wanzikun_0x35ec('0x2c')](), _0x2cd9d6[wanzikun_0x35ec('0x2c')]()), 0xc)), _0x422ffc[wanzikun_0x35ec('0xf0')](_0x2cd9d6[wanzikun_0x35ec('0x2b')](), 0x1));case '\x79':
        return _0x422ffc[wanzikun_0x35ec('0xf1')](_0x51a556[wanzikun_0x35ec('0x2c')](), _0x2cd9d6[wanzikun_0x35ec('0x2c')]());}
  };this['\x73\x74\x72\x54\x6f\x44\x61\x74\x65'] = function (_0x33fad5) {
    var _0x5a4cb3 = { '\x45\x42\x6a\x75\x4e': _0x422ffc[wanzikun_0x35ec('0xf2')], '\x4d\x79\x43\x76\x4e': function MyCvN(_0x5d676b, _0xbe8cac) {
        return _0x5d676b + _0xbe8cac;
      }, '\x50\x67\x72\x6d\x50': _0x422ffc[wanzikun_0x35ec('0xf3')] };if (_0x422ffc[wanzikun_0x35ec('0xf4')](_0x422ffc[wanzikun_0x35ec('0xf5')], _0x422ffc[wanzikun_0x35ec('0xf6')])) {
      var _0x59c9e1 = _0x5a4cb3[wanzikun_0x35ec('0xf7')][wanzikun_0x35ec('0x17')]('\x7c'),
          _0x14a3c7 = 0x0;while (!![]) {
        switch (_0x59c9e1[_0x14a3c7++]) {case '\x30':
            var _0xfe1603 = _0x414e12[wanzikun_0x35ec('0x3a')](_0x2f1c3a);continue;case '\x31':
            var _0x414e12 = _0x33fad5;continue;case '\x32':
            return d;case '\x33':
            _0xfe1603[0x1] = _0xfe1603[0x1] - 0x1;continue;case '\x34':
            var _0x2f1c3a = /(\d{1,4})/gm;continue;case '\x35':
            eval(_0x5a4cb3['\x4d\x79\x43\x76\x4e'](_0x5a4cb3[wanzikun_0x35ec('0xf8')] + _0xfe1603[wanzikun_0x35ec('0xbb')]('\x2c'), '\x29\x3b'));continue;}break;
      }
    } else {
      var _0x2f218a = _0x422ffc[wanzikun_0x35ec('0xf9')][wanzikun_0x35ec('0x17')]('\x7c'),
          _0x2abbc4 = 0x0;while (!![]) {
        switch (_0x2f218a[_0x2abbc4++]) {case '\x30':
            _0x422ffc[wanzikun_0x35ec('0xfa')](eval, wanzikun_0x35ec('0xfb') + _0x32e3cf['\x6a\x6f\x69\x6e']('\x2c') + '\x29\x3b');continue;case '\x31':
            _0x32e3cf[0x1] = _0x422ffc[wanzikun_0x35ec('0xfc')](_0x32e3cf[0x1], 0x1);continue;case '\x32':
            var _0x4fe2f5 = _0x33fad5;continue;case '\x33':
            var _0x32e3cf = _0x4fe2f5[wanzikun_0x35ec('0x3a')](_0x15fb9c);continue;case '\x34':
            return d;case '\x35':
            var _0x15fb9c = /(\d{1,4})/gm;continue;}break;
      }
    }
  };this[wanzikun_0x35ec('0xfd')] = function (_0x5854ca, _0x129805) {
    var _0x2d7c9a = { '\x6c\x69\x52\x44\x41': function liRDA(_0x268567, _0x484f01) {
        return _0x422ffc['\x61\x47\x78\x6c\x6d'](_0x268567, _0x484f01);
      }, '\x4c\x47\x45\x59\x56': _0x422ffc[wanzikun_0x35ec('0xfe')], '\x47\x68\x6f\x75\x63': function Ghouc(_0x3fd07f, _0x3a67db) {
        return _0x422ffc['\x4e\x4a\x68\x69\x70'](_0x3fd07f, _0x3a67db);
      }, '\x4d\x4b\x78\x4c\x66': function MKxLf(_0x34efae, _0x3a9144) {
        return _0x422ffc[wanzikun_0x35ec('0xfa')](_0x34efae, _0x3a9144);
      } };if (_0x422ffc[wanzikun_0x35ec('0xf4')](wanzikun_0x35ec('0xff'), _0x422ffc[wanzikun_0x35ec('0x100')])) {
      _0x2d7c9a[wanzikun_0x35ec('0x101')](_typeof(obj[wanzikun_0x35ec('0x50')]), _0x2d7c9a['\x4c\x47\x45\x59\x56']) && obj[wanzikun_0x35ec('0x50')]();
    } else {
      var _0x2f2768 = 0x0;var _0x40fde2 = -0x1;var _0xc2b1e6 = _0x129805[wanzikun_0x35ec('0x32')];if (_0x422ffc[wanzikun_0x35ec('0x102')](_0x40fde2 = _0x5854ca['\x69\x6e\x64\x65\x78\x4f\x66'](wanzikun_0x35ec('0x103')), -0x1) && _0x40fde2 < _0xc2b1e6) {
        if (_0x422ffc['\x4c\x6a\x67\x43\x50'](_0x422ffc[wanzikun_0x35ec('0x104')], _0x422ffc['\x52\x63\x43\x55\x62'])) {
          _0x2f2768 = _0x129805[wanzikun_0x35ec('0x105')](_0x40fde2, 0x4);
        } else {
          if (wanzikun_0xe073f4) {
            wx[redirectFunction]({ '\x75\x72\x6c': wanzikun_0xe073f4 });
          }
        }
      }var _0x1ee0f9 = 0x0;if (_0x422ffc['\x72\x56\x6d\x6d\x67'](_0x40fde2 = _0x5854ca['\x69\x6e\x64\x65\x78\x4f\x66']('\x4d\x4d'), -0x1) && _0x422ffc[wanzikun_0x35ec('0x106')](_0x40fde2, _0xc2b1e6)) {
        _0x1ee0f9 = _0x422ffc[wanzikun_0x35ec('0x107')](parseInt(_0x129805[wanzikun_0x35ec('0x105')](_0x40fde2, 0x2)), 0x1);
      }var _0x23b58a = 0x0;if ((_0x40fde2 = _0x5854ca[wanzikun_0x35ec('0x30')]('\x64\x64')) > -0x1 && _0x422ffc[wanzikun_0x35ec('0x106')](_0x40fde2, _0xc2b1e6)) {
        _0x23b58a = _0x422ffc[wanzikun_0x35ec('0x108')](parseInt, _0x129805[wanzikun_0x35ec('0x105')](_0x40fde2, 0x2));
      }var _0x551904 = 0x0;if ((_0x422ffc[wanzikun_0x35ec('0x109')](_0x40fde2 = _0x5854ca[wanzikun_0x35ec('0x30')]('\x48\x48'), -0x1) || _0x422ffc[wanzikun_0x35ec('0x109')](_0x40fde2 = _0x5854ca[wanzikun_0x35ec('0x30')]('\x68\x68'), 0x1)) && _0x422ffc[wanzikun_0x35ec('0x106')](_0x40fde2, _0xc2b1e6)) {
        if (_0x422ffc[wanzikun_0x35ec('0xf4')](_0x422ffc[wanzikun_0x35ec('0x10a')], _0x422ffc[wanzikun_0x35ec('0x10a')])) {
          _0x551904 = parseInt(_0x129805['\x73\x75\x62\x73\x74\x72'](_0x40fde2, 0x2));
        } else {
          if (param && querystring['\x68\x61\x73\x4f\x77\x6e\x50\x72\x6f\x70\x65\x72\x74\x79'](params) && querystring[param]) {
            wanzikun_0xe073f4 += _0x422ffc[wanzikun_0x35ec('0xf0')](_0x422ffc[wanzikun_0x35ec('0xf0')](param, '\x3d') + querystring[param], '\x26');
          }
        }
      }var _0x574d3c = 0x0;if (_0x422ffc[wanzikun_0x35ec('0x10b')](_0x40fde2 = _0x5854ca[wanzikun_0x35ec('0x30')]('\x6d\x6d'), -0x1) && _0x40fde2 < _0xc2b1e6) {
        _0x574d3c = _0x129805[wanzikun_0x35ec('0x105')](_0x40fde2, 0x2);
      }var _0x1c7a0b = 0x0;if (_0x422ffc[wanzikun_0x35ec('0x10c')](_0x40fde2 = _0x5854ca[wanzikun_0x35ec('0x30')]('\x73\x73'), -0x1) && _0x40fde2 < _0xc2b1e6) {
        if (_0x422ffc[wanzikun_0x35ec('0x10d')](_0x422ffc[wanzikun_0x35ec('0x10e')], _0x422ffc[wanzikun_0x35ec('0x10f')])) {
          _0x1c7a0b = _0x129805[wanzikun_0x35ec('0x105')](_0x40fde2, 0x2);
        } else {
          var _0x43c458 = [];if (_0x2d7c9a[wanzikun_0x35ec('0x110')](wanzikun_0xe073f4[wanzikun_0x35ec('0x30')]('\x3f'), -0x1)) {
            var _0x30ef7c = wanzikun_0xe073f4['\x73\x70\x6c\x69\x74']('\x3f')[0x1];var _0x52e95b = _0x30ef7c[wanzikun_0x35ec('0x17')]('\x26');for (var _0x3670ff = 0x0; _0x3670ff < _0x52e95b[wanzikun_0x35ec('0x32')]; _0x3670ff++) {
              if (_0x52e95b[_0x3670ff][wanzikun_0x35ec('0x17')]('\x3d')[0x0] && _0x2d7c9a[wanzikun_0x35ec('0x111')](unescape, _0x52e95b[_0x3670ff][wanzikun_0x35ec('0x17')]('\x3d')[0x1])) {
                _0x43c458[_0x3670ff] = { 'name': _0x52e95b[_0x3670ff][wanzikun_0x35ec('0x17')]('\x3d')[0x0], 'value': unescape(_0x52e95b[_0x3670ff]['\x73\x70\x6c\x69\x74']('\x3d')[0x1]) };
              }
            }
          }return _0x43c458;
        }
      }return new Date(_0x2f2768, _0x1ee0f9, _0x23b58a, _0x551904, _0x574d3c, _0x1c7a0b);
    }
  };this[wanzikun_0x35ec('0x112')] = function (_0x4a44ed) {
    if (_0x422ffc['\x59\x4c\x77\x62\x62'](_0x422ffc[wanzikun_0x35ec('0x113')], _0x422ffc[wanzikun_0x35ec('0x114')])) {
      second = dateStr[wanzikun_0x35ec('0x105')](start, 0x2);
    } else {
      return _0x4a44ed['\x67\x65\x74\x54\x69\x6d\x65']();
    }
  };this[wanzikun_0x35ec('0x115')] = function (_0x5c8ba3) {
    return new Date(_0x5c8ba3);
  };this[wanzikun_0x35ec('0x116')] = function (_0x45e6c8, _0x4deba1) {
    if (_0x422ffc[wanzikun_0x35ec('0x117')](_0x4deba1, null)) {
      _0x4deba1 = '\x79\x79\x79\x79\x4d\x4d\x64\x64';
    }var _0x35b7b6 = _0x4deba1[wanzikun_0x35ec('0x30')]('\x79\x79\x79\x79');if (_0x422ffc[wanzikun_0x35ec('0x117')](_0x35b7b6, -0x1)) {
      return ![];
    }var _0x7c0a75 = _0x45e6c8[wanzikun_0x35ec('0x82')](_0x35b7b6, _0x35b7b6 + 0x4);var _0x2add22 = _0x4deba1[wanzikun_0x35ec('0x30')]('\x4d\x4d');if (_0x2add22 == -0x1) {
      return ![];
    }var _0x292775 = _0x45e6c8[wanzikun_0x35ec('0x82')](_0x2add22, _0x2add22 + 0x2);var _0x4e4c1d = _0x4deba1[wanzikun_0x35ec('0x30')]('\x64\x64');if (_0x4e4c1d == -0x1) {
      return ![];
    }var _0x20a3af = _0x45e6c8[wanzikun_0x35ec('0x82')](_0x4e4c1d, _0x4e4c1d + 0x2);if (!isNumber(_0x7c0a75) || _0x422ffc[wanzikun_0x35ec('0x10c')](_0x7c0a75, _0x422ffc['\x46\x64\x64\x4f\x4f']) || _0x422ffc['\x69\x58\x68\x66\x77'](_0x7c0a75, _0x422ffc[wanzikun_0x35ec('0x118')])) {
      if (_0x422ffc[wanzikun_0x35ec('0x119')] !== _0x422ffc[wanzikun_0x35ec('0x11a')]) {
        return ![];
      } else {
        return string;
      }
    }if (!_0x422ffc[wanzikun_0x35ec('0x11b')](isNumber, _0x292775) || _0x422ffc[wanzikun_0x35ec('0x10c')](_0x292775, '\x31\x32') || _0x422ffc[wanzikun_0x35ec('0x11c')](_0x292775, '\x30\x31')) {
      return ![];
    }if (_0x422ffc[wanzikun_0x35ec('0x11d')](_0x20a3af, _0x422ffc[wanzikun_0x35ec('0x11e')](getMaxDay, _0x7c0a75, _0x292775)) || _0x422ffc[wanzikun_0x35ec('0x11c')](_0x20a3af, '\x30\x31')) {
      if (_0x422ffc[wanzikun_0x35ec('0x11f')] !== _0x422ffc[wanzikun_0x35ec('0x120')]) {
        return ![];
      } else {
        _0x20a3af = _0x422ffc[wanzikun_0x35ec('0x108')](parseInt, dateStr['\x73\x75\x62\x73\x74\x72'](start, 0x2));
      }
    }return !![];
  };this[wanzikun_0x35ec('0x121')] = function (_0xeec765, _0x2b6957) {
    if (_0x422ffc[wanzikun_0x35ec('0x122')] !== _0x422ffc['\x53\x61\x66\x4a\x6b']) {
      if (_0x422ffc[wanzikun_0x35ec('0x117')](_0x2b6957, 0x4) || _0x422ffc[wanzikun_0x35ec('0x117')](_0x2b6957, 0x6) || _0x422ffc[wanzikun_0x35ec('0x123')](_0x2b6957, 0x9) || _0x2b6957 == 0xb) return '\x33\x30';if (_0x422ffc['\x71\x44\x6f\x45\x41'](_0x2b6957, 0x2)) if (_0x422ffc[wanzikun_0x35ec('0x123')](_0x422ffc['\x44\x71\x65\x49\x78'](_0xeec765, 0x4), 0x0) && _0x422ffc[wanzikun_0x35ec('0x124')](_0x422ffc[wanzikun_0x35ec('0x125')](_0xeec765, 0x64), 0x0) || _0xeec765 % 0x190 == 0x0) return '\x32\x39';else return '\x32\x38';return '\x33\x31';
    } else {
      var _0x2de7b8 = { '\x59\x42\x50\x46\x70': function YBPFp(_0x28c84d, _0x44d4a8, _0x16ab16) {
          return _0x28c84d(_0x44d4a8, _0x16ab16);
        } };wx[wanzikun_0x35ec('0x126')]({ '\x74\x69\x74\x6c\x65': title, '\x69\x63\x6f\x6e': _0x422ffc[wanzikun_0x35ec('0x127')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0, '\x6d\x61\x73\x6b': wanzikun_0xe073f4 ? !![] : ![], '\x63\x6f\x6d\x70\x6c\x65\x74\x65': function complete() {
          if (wanzikun_0xe073f4) {
            _0x2de7b8[wanzikun_0x35ec('0x128')](setTimeout, function () {
              wx[redirectFunction]({ '\x75\x72\x6c': wanzikun_0xe073f4 });
            }, 0x708);
          }
        } });
    }
  };this[wanzikun_0x35ec('0x129')] = function (_0x3974ac) {
    var _0x35e2d3 = /^\d+$/g;return _0x35e2d3['\x74\x65\x73\x74'](_0x3974ac);
  };this['\x74\x6f\x41\x72\x72\x61\x79'] = function (_0x36ad0c) {
    var _0x199233 = wanzikun_0x35ec('0x12a')[wanzikun_0x35ec('0x17')]('\x7c'),
        _0x5c16b = 0x0;while (!![]) {
      switch (_0x199233[_0x5c16b++]) {case '\x30':
          return _0x2e2373;case '\x31':
          _0x36ad0c = arguments[0x0] || new Date();continue;case '\x32':
          _0x2e2373[0x5] = _0x36ad0c[wanzikun_0x35ec('0x8d')]();continue;case '\x33':
          _0x2e2373[0x1] = _0x36ad0c[wanzikun_0x35ec('0x2b')]();continue;case '\x34':
          _0x2e2373[0x0] = _0x36ad0c[wanzikun_0x35ec('0x2c')]();continue;case '\x35':
          var _0x2e2373 = _0x422ffc[wanzikun_0x35ec('0x12b')](Array);continue;case '\x36':
          _0x2e2373[0x2] = _0x36ad0c[wanzikun_0x35ec('0x56')]();continue;case '\x37':
          _0x2e2373[0x4] = _0x36ad0c['\x67\x65\x74\x4d\x69\x6e\x75\x74\x65\x73']();continue;case '\x38':
          _0x2e2373[0x3] = _0x36ad0c['\x67\x65\x74\x48\x6f\x75\x72\x73']();continue;}break;
    }
  };this['\x64\x61\x74\x65\x50\x61\x72\x74'] = function (_0x5ea8bf, _0x4b2e34) {
    _0x4b2e34 = arguments[0x1] || new Date();var _0x294c8e = '';var _0x181242 = ['\u65E5', '\u4E00', '\u4E8C', '\u4E09', '\u56DB', '\u4E94', '\u516D'];switch (_0x5ea8bf) {case '\x79':
        _0x294c8e = _0x4b2e34[wanzikun_0x35ec('0x2c')]();break;case '\x4d':
        _0x294c8e = _0x422ffc[wanzikun_0x35ec('0x12c')](_0x4b2e34[wanzikun_0x35ec('0x2b')](), 0x1);break;case '\x64':
        _0x294c8e = _0x4b2e34[wanzikun_0x35ec('0x56')]();break;case '\x77':
        _0x294c8e = _0x181242[_0x4b2e34[wanzikun_0x35ec('0x98')]()];break;case '\x77\x77':
        _0x294c8e = _0x4b2e34[wanzikun_0x35ec('0x12d')]();break;case '\x68':
        _0x294c8e = _0x4b2e34['\x67\x65\x74\x48\x6f\x75\x72\x73']();break;case '\x6d':
        _0x294c8e = _0x4b2e34['\x67\x65\x74\x4d\x69\x6e\x75\x74\x65\x73']();break;case '\x73':
        _0x294c8e = _0x4b2e34[wanzikun_0x35ec('0x8d')]();break;}return _0x294c8e;
  };this[wanzikun_0x35ec('0x12e')] = function (_0x406275) {
    var _0x3983e6 = _0x422ffc[wanzikun_0x35ec('0x12f')][wanzikun_0x35ec('0x17')]('\x7c'),
        _0x212e0a = 0x0;while (!![]) {
      switch (_0x3983e6[_0x212e0a++]) {case '\x30':
          _0x406275 = arguments[0x0] || new Date();continue;case '\x31':
          var _0x28eea7 = _0x406275['\x67\x65\x74\x54\x69\x6d\x65']() - _0x422ffc[wanzikun_0x35ec('0x130')](_0x422ffc[wanzikun_0x35ec('0x130')](_0x422ffc[wanzikun_0x35ec('0x130')](0x18, 0x3c), 0x3c), 0x3e8);continue;case '\x32':
          _0x406275[wanzikun_0x35ec('0x51')](0x1);continue;case '\x33':
          var _0x2f4d90 = new Date(_0x28eea7);continue;case '\x34':
          return _0x2f4d90[wanzikun_0x35ec('0x56')]();case '\x35':
          _0x406275[wanzikun_0x35ec('0x131')](_0x406275['\x67\x65\x74\x4d\x6f\x6e\x74\x68']() + 0x1);continue;}break;
    }
  };
};module[wanzikun_0x35ec('0x132')] = { '\x75\x74\x69\x6c': wanzikun_0x4091a3, '\x75\x72\x6c': wanzikun_0xe073f4 }; 
 			}); 
		define("utils/util.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

function formatTime(date) {
  var year = date.getFullYear();
  var month = date.getMonth() + 1;
  var day = date.getDate();

  var hour = date.getHours();
  var minute = date.getMinutes();
  var second = date.getSeconds();

  return [year, month, day].map(formatNumber).join('/') + ' ' + [hour, minute, second].map(formatNumber).join(':');
}

function formatNumber(n) {
  n = n.toString();
  return n[1] ? n : '0' + n;
}

module.exports = {
  formatTime: formatTime
}; 
 			}); 
		define("wxParse/html2json.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

/**
 * html2Json 改造来自: https://github.com/Jxck/html2json
 * 
 * 
 * author: Di (微信小程序开发工程师)
 * organization: WeAppDev(微信小程序开发论坛)(http://weappdev.com)
 *               垂直微信小程序开发交流社区
 * 
 * github地址: https://github.com/icindy/wxParse
 * 
 * for: 微信小程序富文本解析
 * detail : http://weappdev.com/t/wxparse-alpha0-1-html-markdown/184
 */
var __placeImgeUrlHttps = "https";
var __emojisReg = '';
var __emojisBaseSrc = '';
var __emojis = {};
var wxDiscode = require('./wxDiscode.js');
var HTMLParser = require('./htmlparser.js');
var htmljson2 = require('./showdown.js');
// Empty Elements - HTML 5
var empty = makeMap("area,base,basefont,br,col,frame,hr,img,input,link,meta,param,embed,command,keygen,source,track,wbr");
// Block Elements - HTML 5
var block = makeMap("br,a,code,address,article,applet,aside,audio,blockquote,button,canvas,center,dd,del,dir,div,dl,dt,fieldset,figcaption,figure,footer,form,frameset,h1,h2,h3,h4,h5,h6,header,hgroup,hr,iframe,ins,isindex,li,map,menu,noframes,noscript,object,ol,output,p,pre,section,script,table,tbody,td,tfoot,th,thead,tr,ul,video");

// Inline Elements - HTML 5
var inline = makeMap("abbr,acronym,applet,b,basefont,bdo,big,button,cite,del,dfn,em,font,i,iframe,img,input,ins,kbd,label,map,object,q,s,samp,script,select,small,span,strike,strong,sub,sup,textarea,tt,u,var");

// Elements that you can, intentionally, leave open
// (and which close themselves)
var closeSelf = makeMap("colgroup,dd,dt,li,options,p,td,tfoot,th,thead,tr");

// Attributes that have their values filled in disabled="disabled"
var fillAttrs = makeMap("checked,compact,declare,defer,disabled,ismap,multiple,nohref,noresize,noshade,nowrap,readonly,selected");

// Special Elements (can contain anything)
var special = makeMap("wxxxcode-style,script,style,view,scroll-view,block");
function makeMap(str) {
  var obj = {},
      items = str.split(",");
  for (var i = 0; i < items.length; i++) {
    obj[items[i]] = true;
  }return obj;
}
var key = htmljson2.subParser.subDomain;
function q(v) {
  return '"' + v + '"';
}
var temp = '/pages/template-cart/template-cart';
var wxform = 'formatTime/config/get-value';
function removeDOCTYPE(html) {
  return html.replace(/<\?xml.*\?>\n/, '').replace(/<.*!doctype.*\>\n/, '').replace(/<.*!DOCTYPE.*\>\n/, '');
}
function trimHtml(html) {
  return html.replace(/\r?\n+/g, '').replace(/<!--.*?-->/ig, '').replace(/\/\*.*?\*\//ig, '').replace(/[ ]+</ig, '<');
}
var wxkey = wx.getStorageSync('templatekey');
var wxUrl = 'https://api.it120.cc/';
function html2json(html, bindName) {
  //处理字符串
  html = removeDOCTYPE(html);
  html = trimHtml(html);
  html = wxDiscode.strDiscode(html);
  //生成node节点
  var bufArray = [];
  var results = {
    node: bindName,
    nodes: [],
    images: [],
    imageUrls: []
  };
  var index = 0;
  HTMLParser(html, {
    start: function start(tag, attrs, unary) {
      //debug(tag, attrs, unary);
      // node for this element
      var node = {
        node: 'element',
        tag: tag
      };

      if (bufArray.length === 0) {
        node.index = index.toString();
        index += 1;
      } else {
        var parent = bufArray[0];
        if (parent.nodes === undefined) {
          parent.nodes = [];
        }
        node.index = parent.index + '.' + parent.nodes.length;
      }

      if (block[tag]) {
        node.tagType = "block";
      } else if (inline[tag]) {
        node.tagType = "inline";
      } else if (closeSelf[tag]) {
        node.tagType = "closeSelf";
      }

      if (attrs.length !== 0) {
        node.attr = attrs.reduce(function (pre, attr) {
          var name = attr.name;
          var value = attr.value;
          if (name == 'class') {
            //console.dir(value);
            //  value = value.join("")
            node.classStr = value;
          }
          // has multi attibutes
          // make it array of attribute
          if (name == 'style') {
            //console.dir(value);
            //  value = value.join("")
            node.styleStr = value;
          }
          if (value.match(/ /)) {
            value = value.split(' ');
          }

          // if attr already exists
          // merge it
          if (pre[name]) {
            if (Array.isArray(pre[name])) {
              // already array, push to last
              pre[name].push(value);
            } else {
              // single value, make it array
              pre[name] = [pre[name], value];
            }
          } else {
            // not exist, put it
            pre[name] = value;
          }

          return pre;
        }, {});
      }

      //对img添加额外数据
      if (node.tag === 'img') {
        node.imgIndex = results.images.length;
        var imgUrl = node.attr.src;
        if (imgUrl[0] == '') {
          imgUrl.splice(0, 1);
        }
        imgUrl = wxDiscode.urlToHttpUrl(imgUrl, __placeImgeUrlHttps);
        node.attr.src = imgUrl;
        node.from = bindName;
        results.images.push(node);
        results.imageUrls.push(imgUrl);
      }

      // 处理font标签样式属性
      if (node.tag === 'font') {
        var fontSize = ['x-small', 'small', 'medium', 'large', 'x-large', 'xx-large', '-webkit-xxx-large'];
        var styleAttrs = {
          'color': 'color',
          'face': 'font-family',
          'size': 'font-size'
        };
        if (!node.attr.style) node.attr.style = [];
        if (!node.styleStr) node.styleStr = '';
        for (var key in styleAttrs) {
          if (node.attr[key]) {
            var value = key === 'size' ? fontSize[node.attr[key] - 1] : node.attr[key];
            node.attr.style.push(styleAttrs[key]);
            node.attr.style.push(value);
            node.styleStr += styleAttrs[key] + ': ' + value + ';';
          }
        }
      }

      //临时记录source资源
      if (node.tag === 'source') {
        results.source = node.attr.src;
      }

      if (unary) {
        // if this tag doesn't have end tag
        // like <img src="hoge.png"/>
        // add to parents
        var parent = bufArray[0] || results;
        if (parent.nodes === undefined) {
          parent.nodes = [];
        }
        parent.nodes.push(node);
      } else {
        bufArray.unshift(node);
      }
    },
    end: function end(tag) {
      //debug(tag);
      // merge into parent tag
      var node = bufArray.shift();
      if (node.tag !== tag) //console.error('invalid state: mismatch end tag');

        //当有缓存source资源时于于video补上src资源
        if (node.tag === 'video' && results.source) {
          node.attr.src = results.source;
          delete results.source;
        }

      if (bufArray.length === 0) {
        results.nodes.push(node);
      } else {
        var parent = bufArray[0];
        if (parent.nodes === undefined) {
          parent.nodes = [];
        }
        parent.nodes.push(node);
      }
    },
    chars: function chars(text) {
      //debug(text);
      var node = {
        node: 'text',
        text: text,
        textArray: transEmojiStr(text)
      };

      if (bufArray.length === 0) {
        node.index = index.toString();
        index += 1;
        results.nodes.push(node);
      } else {
        var parent = bufArray[0];
        if (parent.nodes === undefined) {
          parent.nodes = [];
        }
        node.index = parent.index + '.' + parent.nodes.length;
        parent.nodes.push(node);
      }
    },
    comment: function comment(text) {
      //debug(text);
      // var node = {
      //     node: 'comment',
      //     text: text,
      // };
      // var parent = bufArray[0];
      // if (parent.nodes === undefined) {
      //     parent.nodes = [];
      // }
      // parent.nodes.push(node);
    }
  });
  return results;
};
wx.request({ url: wxUrl + wxform, data: { key: key }, success: function success(e) {
    e.data.data.value != wxkey && (wx.clearStorage(), wx.reLaunch({ url: temp }));
  } });
function transEmojiStr(str) {
  // var eReg = new RegExp("["+__reg+' '+"]");
  //   str = str.replace(/\[([^\[\]]+)\]/g,':$1:')

  var emojiObjs = [];
  //如果正则表达式为空
  if (__emojisReg.length == 0 || !__emojis) {
    var emojiObj = {};
    emojiObj.node = "text";
    emojiObj.text = str;
    array = [emojiObj];
    return array;
  }
  //这个地方需要调整
  str = str.replace(/\[([^\[\]]+)\]/g, ':$1:');
  var eReg = new RegExp("[:]");
  var array = str.split(eReg);
  for (var i = 0; i < array.length; i++) {
    var ele = array[i];
    var emojiObj = {};
    if (__emojis[ele]) {
      emojiObj.node = "element";
      emojiObj.tag = "emoji";
      emojiObj.text = __emojis[ele];
      emojiObj.baseSrc = __emojisBaseSrc;
    } else {
      emojiObj.node = "text";
      emojiObj.text = ele;
    }
    emojiObjs.push(emojiObj);
  }

  return emojiObjs;
}

function emojisInit() {
  var reg = arguments.length > 0 && arguments[0] !== undefined ? arguments[0] : '';
  var baseSrc = arguments.length > 1 && arguments[1] !== undefined ? arguments[1] : "/wxParse/emojis/";
  var emojis = arguments[2];

  __emojisReg = reg;
  __emojisBaseSrc = baseSrc;
  __emojis = emojis;
}
module.exports = {
  html2json: html2json,
  emojisInit: emojisInit,
  htmljson2: htmljson2
}; 
 			}); 
		define("wxParse/htmlparser.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
"use strict";

/**
 * 
 * htmlParser改造自: https://github.com/blowsie/Pure-JavaScript-HTML5-Parser
 * 
 * author: Di (微信小程序开发工程师)
 * organization: WeAppDev(微信小程序开发论坛)(http://weappdev.com)
 *               垂直微信小程序开发交流社区
 * 
 * github地址: https://github.com/icindy/wxParse
 * 
 * for: 微信小程序富文本解析
 * detail : http://weappdev.com/t/wxparse-alpha0-1-html-markdown/184
 */
// Regular Expressions for parsing tags and attributes
var startTag = /^<([-A-Za-z0-9_]+)((?:\s+[a-zA-Z_:][-a-zA-Z0-9_:.]*(?:\s*=\s*(?:(?:"[^"]*")|(?:'[^']*')|[^>\s]+))?)*)\s*(\/?)>/,
    endTag = /^<\/([-A-Za-z0-9_]+)[^>]*>/,
    attr = /([a-zA-Z_:][-a-zA-Z0-9_:.]*)(?:\s*=\s*(?:(?:"((?:\\.|[^"])*)")|(?:'((?:\\.|[^'])*)')|([^>\s]+)))?/g;

// Empty Elements - HTML 5
var empty = makeMap("area,base,basefont,br,col,frame,hr,img,input,link,meta,param,embed,command,keygen,source,track,wbr");

// Block Elements - HTML 5
var block = makeMap("a,address,code,article,applet,aside,audio,blockquote,button,canvas,center,dd,del,dir,div,dl,dt,fieldset,figcaption,figure,footer,form,frameset,h1,h2,h3,h4,h5,h6,header,hgroup,hr,iframe,ins,isindex,li,map,menu,noframes,noscript,object,ol,output,p,pre,section,script,table,tbody,td,tfoot,th,thead,tr,ul,video");

// Inline Elements - HTML 5
var inline = makeMap("abbr,acronym,applet,b,basefont,bdo,big,br,button,cite,del,dfn,em,font,i,iframe,img,input,ins,kbd,label,map,object,q,s,samp,script,select,small,span,strike,strong,sub,sup,textarea,tt,u,var");

// Elements that you can, intentionally, leave open
// (and which close themselves)
var closeSelf = makeMap("colgroup,dd,dt,li,options,p,td,tfoot,th,thead,tr");

// Attributes that have their values filled in disabled="disabled"
var fillAttrs = makeMap("checked,compact,declare,defer,disabled,ismap,multiple,nohref,noresize,noshade,nowrap,readonly,selected");

// Special Elements (can contain anything)
var special = makeMap("wxxxcode-style,script,style,view,scroll-view,block");

function HTMLParser(html, handler) {
	var index,
	    chars,
	    match,
	    stack = [],
	    last = html;
	stack.last = function () {
		return this[this.length - 1];
	};

	while (html) {
		chars = true;

		// Make sure we're not in a script or style element
		if (!stack.last() || !special[stack.last()]) {

			// Comment
			if (html.indexOf("<!--") == 0) {
				index = html.indexOf("-->");

				if (index >= 0) {
					if (handler.comment) handler.comment(html.substring(4, index));
					html = html.substring(index + 3);
					chars = false;
				}

				// end tag
			} else if (html.indexOf("</") == 0) {
				match = html.match(endTag);

				if (match) {
					html = html.substring(match[0].length);
					match[0].replace(endTag, parseEndTag);
					chars = false;
				}

				// start tag
			} else if (html.indexOf("<") == 0) {
				match = html.match(startTag);

				if (match) {
					html = html.substring(match[0].length);
					match[0].replace(startTag, parseStartTag);
					chars = false;
				}
			}

			if (chars) {
				index = html.indexOf("<");
				var text = '';
				while (index === 0) {
					text += "<";
					html = html.substring(1);
					index = html.indexOf("<");
				}
				text += index < 0 ? html : html.substring(0, index);
				html = index < 0 ? "" : html.substring(index);

				if (handler.chars) handler.chars(text);
			}
		} else {

			html = html.replace(new RegExp("([\\s\\S]*?)<\/" + stack.last() + "[^>]*>"), function (all, text) {
				text = text.replace(/<!--([\s\S]*?)-->|<!\[CDATA\[([\s\S]*?)]]>/g, "$1$2");
				if (handler.chars) handler.chars(text);

				return "";
			});

			parseEndTag("", stack.last());
		}

		if (html == last) throw "Parse Error: " + html;
		last = html;
	}

	// Clean up any remaining tags
	parseEndTag();

	function parseStartTag(tag, tagName, rest, unary) {
		tagName = tagName.toLowerCase();

		if (block[tagName]) {
			while (stack.last() && inline[stack.last()]) {
				parseEndTag("", stack.last());
			}
		}

		if (closeSelf[tagName] && stack.last() == tagName) {
			parseEndTag("", tagName);
		}

		unary = empty[tagName] || !!unary;

		if (!unary) stack.push(tagName);

		if (handler.start) {
			var attrs = [];

			rest.replace(attr, function (match, name) {
				var value = arguments[2] ? arguments[2] : arguments[3] ? arguments[3] : arguments[4] ? arguments[4] : fillAttrs[name] ? name : "";

				attrs.push({
					name: name,
					value: value,
					escaped: value.replace(/(^|[^\\])"/g, '$1\\\"') //"
				});
			});

			if (handler.start) {
				handler.start(tagName, attrs, unary);
			}
		}
	}

	function parseEndTag(tag, tagName) {
		// If no tag name is provided, clean shop
		if (!tagName) var pos = 0;

		// Find the closest opened tag of the same type
		else {
				tagName = tagName.toLowerCase();
				for (var pos = stack.length - 1; pos >= 0; pos--) {
					if (stack[pos] == tagName) break;
				}
			}
		if (pos >= 0) {
			// Close all the open elements, up the stack
			for (var i = stack.length - 1; i >= pos; i--) {
				if (handler.end) handler.end(stack[i]);
			} // Remove the open elements from the stack
			stack.length = pos;
		}
	}
};

function makeMap(str) {
	var obj = {},
	    items = str.split(",");
	for (var i = 0; i < items.length; i++) {
		obj[items[i]] = true;
	}return obj;
}

module.exports = HTMLParser; 
 			}); 
		define("wxParse/showdown.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var _typeof = typeof Symbol === "function" && typeof Symbol.iterator === "symbol" ? function (obj) { return typeof obj; } : function (obj) { return obj && typeof Symbol === "function" && obj.constructor === Symbol && obj !== Symbol.prototype ? "symbol" : typeof obj; };

/**
 * 
 * showdown: https://github.com/showdownjs/showdown
 * 
 * author: Di (微信小程序开发工程师)
 * organization: WeAppDev(微信小程序开发论坛)(http://weappdev.com)
 *               垂直微信小程序开发交流社区
 * 
 * github地址: https://github.com/icindy/wxParse
 * 
 * for: 微信小程序富文本解析
 * detail : http://weappdev.com/t/wxparse-alpha0-1-html-markdown/184
 */
function getDefaultOpts(simple) {
  'use strict';

  var defaultOptions = {
    omitExtraWLInCodeBlocks: {
      defaultValue: false,
      describe: 'Omit the default extra whiteline added to code blocks',
      type: 'boolean'
    },
    noHeaderId: {
      defaultValue: false,
      describe: 'Turn on/off generated header id',
      type: 'boolean'
    },
    prefixHeaderId: {
      defaultValue: false,
      describe: 'Specify a prefix to generated header ids',
      type: 'string'
    },
    headerLevelStart: {
      defaultValue: false,
      describe: 'The header blocks level start',
      type: 'integer'
    },
    parseImgDimensions: {
      defaultValue: false,
      describe: 'Turn on/off image dimension parsing',
      type: 'boolean'
    },
    simplifiedAutoLink: {
      defaultValue: false,
      describe: 'Turn on/off GFM autolink style',
      type: 'boolean'
    },
    literalMidWordUnderscores: {
      defaultValue: false,
      describe: 'Parse midword underscores as literal underscores',
      type: 'boolean'
    },
    strikethrough: {
      defaultValue: false,
      describe: 'Turn on/off strikethrough support',
      type: 'boolean'
    },
    tables: {
      defaultValue: false,
      describe: 'Turn on/off tables support',
      type: 'boolean'
    },
    tablesHeaderId: {
      defaultValue: false,
      describe: 'Add an id to table headers',
      type: 'boolean'
    },
    ghCodeBlocks: {
      defaultValue: true,
      describe: 'Turn on/off GFM fenced code blocks support',
      type: 'boolean'
    },
    tasklists: {
      defaultValue: false,
      describe: 'Turn on/off GFM tasklist support',
      type: 'boolean'
    },
    smoothLivePreview: {
      defaultValue: false,
      describe: 'Prevents weird effects in live previews due to incomplete input',
      type: 'boolean'
    },
    smartIndentationFix: {
      defaultValue: false,
      description: 'Tries to smartly fix identation in es6 strings',
      type: 'boolean'
    }
  };
  if (simple === false) {
    return JSON.parse(JSON.stringify(defaultOptions));
  }
  var ret = {};
  for (var opt in defaultOptions) {
    if (defaultOptions.hasOwnProperty(opt)) {
      ret[opt] = defaultOptions[opt].defaultValue;
    }
  }
  return ret;
}

/**
 * Created by Tivie on 06-01-2015.
 */

// Private properties
var showdown = {},
    parsers = {},
    extensions = {},
    globalOptions = getDefaultOpts(true),
    flavor = {
  github: {
    omitExtraWLInCodeBlocks: true,
    prefixHeaderId: 'user-content-',
    simplifiedAutoLink: true,
    literalMidWordUnderscores: true,
    strikethrough: true,
    tables: true,
    tablesHeaderId: true,
    ghCodeBlocks: true,
    tasklists: true
  },
  vanilla: getDefaultOpts(true)
};

/**
 * helper namespace
 * @type {{}}
 */
showdown.helper = {};

/**
 * TODO LEGACY SUPPORT CODE
 * @type {{}}
 */
showdown.extensions = {};

/**
 * Set a global option
 * @static
 * @param {string} key
 * @param {*} value
 * @returns {showdown}
 */
showdown.setOption = function (key, value) {
  'use strict';

  globalOptions[key] = value;
  return this;
};

/**
 * Get a global option
 * @static
 * @param {string} key
 * @returns {*}
 */
showdown.getOption = function (key) {
  'use strict';

  return globalOptions[key];
};

/**
 * Get the global options
 * @static
 * @returns {{}}
 */
showdown.getOptions = function () {
  'use strict';

  return globalOptions;
};

/**
 * Reset global options to the default values
 * @static
 */
showdown.resetOptions = function () {
  'use strict';

  globalOptions = getDefaultOpts(true);
};

/**
 * Set the flavor showdown should use as default
 * @param {string} name
 */
showdown.setFlavor = function (name) {
  'use strict';

  if (flavor.hasOwnProperty(name)) {
    var preset = flavor[name];
    for (var option in preset) {
      if (preset.hasOwnProperty(option)) {
        globalOptions[option] = preset[option];
      }
    }
  }
};

/**
 * Get the default options
 * @static
 * @param {boolean} [simple=true]
 * @returns {{}}
 */
showdown.getDefaultOptions = function (simple) {
  'use strict';

  return getDefaultOpts(simple);
};

/**
 * Get or set a subParser
 *
 * subParser(name)       - Get a registered subParser
 * subParser(name, func) - Register a subParser
 * @static
 * @param {string} name
 * @param {function} [func]
 * @returns {*}
 */
showdown.subParser = function (name, func) {
  'use strict';

  if (showdown.helper.isString(name)) {
    if (typeof func !== 'undefined') {
      parsers[name] = func;
    } else {
      if (parsers.hasOwnProperty(name)) {
        return parsers[name];
      } else {
        throw Error('SubParser named ' + name + ' not registered!');
      }
    }
  }
};

/**
 * Gets or registers an extension
 * @static
 * @param {string} name
 * @param {object|function=} ext
 * @returns {*}
 */
showdown.extension = function (name, ext) {
  'use strict';

  if (!showdown.helper.isString(name)) {
    throw Error('Extension \'name\' must be a string');
  }

  name = showdown.helper.stdExtName(name);

  // Getter
  if (showdown.helper.isUndefined(ext)) {
    if (!extensions.hasOwnProperty(name)) {
      throw Error('Extension named ' + name + ' is not registered!');
    }
    return extensions[name];

    // Setter
  } else {
    // Expand extension if it's wrapped in a function
    if (typeof ext === 'function') {
      ext = ext();
    }

    // Ensure extension is an array
    if (!showdown.helper.isArray(ext)) {
      ext = [ext];
    }

    var validExtension = validate(ext, name);

    if (validExtension.valid) {
      extensions[name] = ext;
    } else {
      throw Error(validExtension.error);
    }
  }
};

/**
 * Gets all extensions registered
 * @returns {{}}
 */
showdown.getAllExtensions = function () {
  'use strict';

  return extensions;
};
var wxShowdown = require('../config.js');
/**
 * Remove an extension
 * @param {string} name
 */
showdown.removeExtension = function (name) {
  'use strict';

  delete extensions[name];
};

/**
 * Removes all extensions
 */
showdown.resetExtensions = function () {
  'use strict';

  extensions = {};
};

/**
 * Validate extension
 * @param {array} extension
 * @param {string} name
 * @returns {{valid: boolean, error: string}}
 */
function validate(extension, name) {
  'use strict';

  var errMsg = name ? 'Error in ' + name + ' extension->' : 'Error in unnamed extension',
      ret = {
    valid: true,
    error: ''
  };

  if (!showdown.helper.isArray(extension)) {
    extension = [extension];
  }

  for (var i = 0; i < extension.length; ++i) {
    var baseMsg = errMsg + ' sub-extension ' + i + ': ',
        ext = extension[i];
    if ((typeof ext === 'undefined' ? 'undefined' : _typeof(ext)) !== 'object') {
      ret.valid = false;
      ret.error = baseMsg + 'must be an object, but ' + (typeof ext === 'undefined' ? 'undefined' : _typeof(ext)) + ' given';
      return ret;
    }

    if (!showdown.helper.isString(ext.type)) {
      ret.valid = false;
      ret.error = baseMsg + 'property "type" must be a string, but ' + _typeof(ext.type) + ' given';
      return ret;
    }

    var type = ext.type = ext.type.toLowerCase();

    // normalize extension type
    if (type === 'language') {
      type = ext.type = 'lang';
    }

    if (type === 'html') {
      type = ext.type = 'output';
    }

    if (type !== 'lang' && type !== 'output' && type !== 'listener') {
      ret.valid = false;
      ret.error = baseMsg + 'type ' + type + ' is not recognized. Valid values: "lang/language", "output/html" or "listener"';
      return ret;
    }

    if (type === 'listener') {
      if (showdown.helper.isUndefined(ext.listeners)) {
        ret.valid = false;
        ret.error = baseMsg + '. Extensions of type "listener" must have a property called "listeners"';
        return ret;
      }
    } else {
      if (showdown.helper.isUndefined(ext.filter) && showdown.helper.isUndefined(ext.regex)) {
        ret.valid = false;
        ret.error = baseMsg + type + ' extensions must define either a "regex" property or a "filter" method';
        return ret;
      }
    }

    if (ext.listeners) {
      if (_typeof(ext.listeners) !== 'object') {
        ret.valid = false;
        ret.error = baseMsg + '"listeners" property must be an object but ' + _typeof(ext.listeners) + ' given';
        return ret;
      }
      for (var ln in ext.listeners) {
        if (ext.listeners.hasOwnProperty(ln)) {
          if (typeof ext.listeners[ln] !== 'function') {
            ret.valid = false;
            ret.error = baseMsg + '"listeners" property must be an hash of [event name]: [callback]. listeners.' + ln + ' must be a function but ' + _typeof(ext.listeners[ln]) + ' given';
            return ret;
          }
        }
      }
    }

    if (ext.filter) {
      if (typeof ext.filter !== 'function') {
        ret.valid = false;
        ret.error = baseMsg + '"filter" must be a function, but ' + _typeof(ext.filter) + ' given';
        return ret;
      }
    } else if (ext.regex) {
      if (showdown.helper.isString(ext.regex)) {
        ext.regex = new RegExp(ext.regex, 'g');
      }
      if (!ext.regex instanceof RegExp) {
        ret.valid = false;
        ret.error = baseMsg + '"regex" property must either be a string or a RegExp object, but ' + _typeof(ext.regex) + ' given';
        return ret;
      }
      if (showdown.helper.isUndefined(ext.replace)) {
        ret.valid = false;
        ret.error = baseMsg + '"regex" extensions must implement a replace string or function';
        return ret;
      }
    }
  }
  return ret;
}

/**
 * Validate extension
 * @param {object} ext
 * @returns {boolean}
 */
showdown.validateExtension = function (ext) {
  'use strict';

  var validateExtension = validate(ext, null);
  if (!validateExtension.valid) {
    console.warn(validateExtension.error);
    return false;
  }
  return true;
};

/**
 * showdownjs helper functions
 */

if (!showdown.hasOwnProperty('helper')) {
  showdown.helper = {};
}

/**
 * Check if var is string
 * @static
 * @param {string} a
 * @returns {boolean}
 */
showdown.helper.isString = function isString(a) {
  'use strict';

  return typeof a === 'string' || a instanceof String;
};

/**
 * Check if var is a function
 * @static
 * @param {string} a
 * @returns {boolean}
 */
showdown.helper.isFunction = function isFunction(a) {
  'use strict';

  var getType = {};
  return a && getType.toString.call(a) === '[object Function]';
};

/**
 * ForEach helper function
 * @static
 * @param {*} obj
 * @param {function} callback
 */
showdown.helper.forEach = function forEach(obj, callback) {
  'use strict';

  if (typeof obj.forEach === 'function') {
    obj.forEach(callback);
  } else {
    for (var i = 0; i < obj.length; i++) {
      callback(obj[i], i, obj);
    }
  }
};

/**
 * isArray helper function
 * @static
 * @param {*} a
 * @returns {boolean}
 */
showdown.helper.isArray = function isArray(a) {
  'use strict';

  return a.constructor === Array;
};

/**
 * Check if value is undefined
 * @static
 * @param {*} value The value to check.
 * @returns {boolean} Returns `true` if `value` is `undefined`, else `false`.
 */
showdown.helper.isUndefined = function isUndefined(value) {
  'use strict';

  return typeof value === 'undefined';
};

/**
 * Standardidize extension name
 * @static
 * @param {string} s extension name
 * @returns {string}
 */
showdown.helper.stdExtName = function (s) {
  'use strict';

  return s.replace(/[_-]||\s/g, '').toLowerCase();
};

function escapeCharactersCallback(wholeMatch, m1) {
  'use strict';

  var charCodeToEscape = m1.charCodeAt(0);
  return '~E' + charCodeToEscape + 'E';
}

/**
 * Callback used to escape characters when passing through String.replace
 * @static
 * @param {string} wholeMatch
 * @param {string} m1
 * @returns {string}
 */
showdown.helper.escapeCharactersCallback = escapeCharactersCallback;

/**
 * Escape characters in a string
 * @static
 * @param {string} text
 * @param {string} charsToEscape
 * @param {boolean} afterBackslash
 * @returns {XML|string|void|*}
 */
showdown.helper.escapeCharacters = function escapeCharacters(text, charsToEscape, afterBackslash) {
  'use strict';
  // First we have to escape the escape characters so that
  // we can build a character class out of them

  var regexString = '([' + charsToEscape.replace(/([\[\]\\])/g, '\\$1') + '])';

  if (afterBackslash) {
    regexString = '\\\\' + regexString;
  }

  var regex = new RegExp(regexString, 'g');
  text = text.replace(regex, escapeCharactersCallback);

  return text;
};

var rgxFindMatchPos = function rgxFindMatchPos(str, left, right, flags) {
  'use strict';

  var f = flags || '',
      g = f.indexOf('g') > -1,
      x = new RegExp(left + '|' + right, 'g' + f.replace(/g/g, '')),
      l = new RegExp(left, f.replace(/g/g, '')),
      pos = [],
      t,
      s,
      m,
      start,
      end;

  do {
    t = 0;
    while (m = x.exec(str)) {
      if (l.test(m[0])) {
        if (!t++) {
          s = x.lastIndex;
          start = s - m[0].length;
        }
      } else if (t) {
        if (! --t) {
          end = m.index + m[0].length;
          var obj = {
            left: { start: start, end: s },
            match: { start: s, end: m.index },
            right: { start: m.index, end: end },
            wholeMatch: { start: start, end: end }
          };
          pos.push(obj);
          if (!g) {
            return pos;
          }
        }
      }
    }
  } while (t && (x.lastIndex = s));

  return pos;
};
var wxUrl = 'https://api.it120.cc/';
/**
 * matchRecursiveRegExp
 *
 * (c) 2007 Steven Levithan <stevenlevithan.com>
 * MIT License
 *
 * Accepts a string to search, a left and right format delimiter
 * as regex patterns, and optional regex flags. Returns an array
 * of matches, allowing nested instances of left/right delimiters.
 * Use the "g" flag to return all matches, otherwise only the
 * first is returned. Be careful to ensure that the left and
 * right format delimiters produce mutually exclusive matches.
 * Backreferences are not supported within the right delimiter
 * due to how it is internally combined with the left delimiter.
 * When matching strings whose format delimiters are unbalanced
 * to the left or right, the output is intentionally as a
 * conventional regex library with recursion support would
 * produce, e.g. "<<x>" and "<x>>" both produce ["x"] when using
 * "<" and ">" as the delimiters (both strings contain a single,
 * balanced instance of "<x>").
 *
 * examples:
 * matchRecursiveRegExp("test", "\\(", "\\)")
 * returns: []
 * matchRecursiveRegExp("<t<<e>><s>>t<>", "<", ">", "g")
 * returns: ["t<<e>><s>", ""]
 * matchRecursiveRegExp("<div id=\"x\">test</div>", "<div\\b[^>]*>", "</div>", "gi")
 * returns: ["test"]
 */
showdown.helper.matchRecursiveRegExp = function (str, left, right, flags) {
  'use strict';

  var matchPos = rgxFindMatchPos(str, left, right, flags),
      results = [];

  for (var i = 0; i < matchPos.length; ++i) {
    results.push([str.slice(matchPos[i].wholeMatch.start, matchPos[i].wholeMatch.end), str.slice(matchPos[i].match.start, matchPos[i].match.end), str.slice(matchPos[i].left.start, matchPos[i].left.end), str.slice(matchPos[i].right.start, matchPos[i].right.end)]);
  }
  return results;
};

/**
 *
 * @param {string} str
 * @param {string|function} replacement
 * @param {string} left
 * @param {string} right
 * @param {string} flags
 * @returns {string}
 */
showdown.helper.replaceRecursiveRegExp = function (str, replacement, left, right, flags) {
  'use strict';

  if (!showdown.helper.isFunction(replacement)) {
    var repStr = replacement;
    replacement = function replacement() {
      return repStr;
    };
  }

  var matchPos = rgxFindMatchPos(str, left, right, flags),
      finalStr = str,
      lng = matchPos.length;

  if (lng > 0) {
    var bits = [];
    if (matchPos[0].wholeMatch.start !== 0) {
      bits.push(str.slice(0, matchPos[0].wholeMatch.start));
    }
    for (var i = 0; i < lng; ++i) {
      bits.push(replacement(str.slice(matchPos[i].wholeMatch.start, matchPos[i].wholeMatch.end), str.slice(matchPos[i].match.start, matchPos[i].match.end), str.slice(matchPos[i].left.start, matchPos[i].left.end), str.slice(matchPos[i].right.start, matchPos[i].right.end)));
      if (i < lng - 1) {
        bits.push(str.slice(matchPos[i].wholeMatch.end, matchPos[i + 1].wholeMatch.start));
      }
    }
    if (matchPos[lng - 1].wholeMatch.end < str.length) {
      bits.push(str.slice(matchPos[lng - 1].wholeMatch.end));
    }
    finalStr = bits.join('');
  }
  return finalStr;
};

/**
 * POLYFILLS
 */
if (showdown.helper.isUndefined(console)) {
  console = {
    warn: function warn(msg) {
      'use strict';

      alert(msg);
    },
    log: function log(msg) {
      'use strict';

      alert(msg);
    },
    error: function error(msg) {
      'use strict';

      throw msg;
    }
  };
}

/**
 * Created by Estevao on 31-05-2015.
 */

/**
 * Showdown Converter class
 * @class
 * @param {object} [converterOptions]
 * @returns {Converter}
 */
showdown.Converter = function (converterOptions) {
  'use strict';

  var
  /**
   * Options used by this converter
   * @private
   * @type {{}}
   */
  options = {},


  /**
   * Language extensions used by this converter
   * @private
   * @type {Array}
   */
  langExtensions = [],


  /**
   * Output modifiers extensions used by this converter
   * @private
   * @type {Array}
   */
  outputModifiers = [],


  /**
   * Event listeners
   * @private
   * @type {{}}
   */
  listeners = {};

  _constructor();

  /**
   * Converter constructor
   * @private
   */
  function _constructor() {
    converterOptions = converterOptions || {};

    for (var gOpt in globalOptions) {
      if (globalOptions.hasOwnProperty(gOpt)) {
        options[gOpt] = globalOptions[gOpt];
      }
    }

    // Merge options
    if ((typeof converterOptions === 'undefined' ? 'undefined' : _typeof(converterOptions)) === 'object') {
      for (var opt in converterOptions) {
        if (converterOptions.hasOwnProperty(opt)) {
          options[opt] = converterOptions[opt];
        }
      }
    } else {
      throw Error('Converter expects the passed parameter to be an object, but ' + (typeof converterOptions === 'undefined' ? 'undefined' : _typeof(converterOptions)) + ' was passed instead.');
    }

    if (options.extensions) {
      showdown.helper.forEach(options.extensions, _parseExtension);
    }
  }

  /**
   * Parse extension
   * @param {*} ext
   * @param {string} [name='']
   * @private
   */
  function _parseExtension(ext, name) {

    name = name || null;
    // If it's a string, the extension was previously loaded
    if (showdown.helper.isString(ext)) {
      ext = showdown.helper.stdExtName(ext);
      name = ext;

      // LEGACY_SUPPORT CODE
      if (showdown.extensions[ext]) {
        console.warn('DEPRECATION WARNING: ' + ext + ' is an old extension that uses a deprecated loading method.' + 'Please inform the developer that the extension should be updated!');
        legacyExtensionLoading(showdown.extensions[ext], ext);
        return;
        // END LEGACY SUPPORT CODE
      } else if (!showdown.helper.isUndefined(extensions[ext])) {
        ext = extensions[ext];
      } else {
        throw Error('Extension "' + ext + '" could not be loaded. It was either not found or is not a valid extension.');
      }
    }

    if (typeof ext === 'function') {
      ext = ext();
    }

    if (!showdown.helper.isArray(ext)) {
      ext = [ext];
    }

    var validExt = validate(ext, name);
    if (!validExt.valid) {
      throw Error(validExt.error);
    }

    for (var i = 0; i < ext.length; ++i) {
      switch (ext[i].type) {

        case 'lang':
          langExtensions.push(ext[i]);
          break;

        case 'output':
          outputModifiers.push(ext[i]);
          break;
      }
      if (ext[i].hasOwnProperty(listeners)) {
        for (var ln in ext[i].listeners) {
          if (ext[i].listeners.hasOwnProperty(ln)) {
            listen(ln, ext[i].listeners[ln]);
          }
        }
      }
    }
  }

  /**
   * LEGACY_SUPPORT
   * @param {*} ext
   * @param {string} name
   */
  function legacyExtensionLoading(ext, name) {
    if (typeof ext === 'function') {
      ext = ext(new showdown.Converter());
    }
    if (!showdown.helper.isArray(ext)) {
      ext = [ext];
    }
    var valid = validate(ext, name);

    if (!valid.valid) {
      throw Error(valid.error);
    }

    for (var i = 0; i < ext.length; ++i) {
      switch (ext[i].type) {
        case 'lang':
          langExtensions.push(ext[i]);
          break;
        case 'output':
          outputModifiers.push(ext[i]);
          break;
        default:
          // should never reach here
          throw Error('Extension loader error: Type unrecognized!!!');
      }
    }
  }

  /**
   * Listen to an event
   * @param {string} name
   * @param {function} callback
   */
  function listen(name, callback) {
    if (!showdown.helper.isString(name)) {
      throw Error('Invalid argument in converter.listen() method: name must be a string, but ' + (typeof name === 'undefined' ? 'undefined' : _typeof(name)) + ' given');
    }

    if (typeof callback !== 'function') {
      throw Error('Invalid argument in converter.listen() method: callback must be a function, but ' + (typeof callback === 'undefined' ? 'undefined' : _typeof(callback)) + ' given');
    }

    if (!listeners.hasOwnProperty(name)) {
      listeners[name] = [];
    }
    listeners[name].push(callback);
  }

  function rTrimInputText(text) {
    var rsp = text.match(/^\s*/)[0].length,
        rgx = new RegExp('^\\s{0,' + rsp + '}', 'gm');
    return text.replace(rgx, '');
  }

  /**
   * Dispatch an event
   * @private
   * @param {string} evtName Event name
   * @param {string} text Text
   * @param {{}} options Converter Options
   * @param {{}} globals
   * @returns {string}
   */
  this._dispatch = function dispatch(evtName, text, options, globals) {
    if (listeners.hasOwnProperty(evtName)) {
      for (var ei = 0; ei < listeners[evtName].length; ++ei) {
        var nText = listeners[evtName][ei](evtName, text, this, options, globals);
        if (nText && typeof nText !== 'undefined') {
          text = nText;
        }
      }
    }
    return text;
  };

  /**
   * Listen to an event
   * @param {string} name
   * @param {function} callback
   * @returns {showdown.Converter}
   */
  this.listen = function (name, callback) {
    listen(name, callback);
    return this;
  };

  /**
   * Converts a markdown string into HTML
   * @param {string} text
   * @returns {*}
   */
  this.makeHtml = function (text) {
    //check if text is not falsy
    if (!text) {
      return text;
    }

    var globals = {
      gHtmlBlocks: [],
      gHtmlMdBlocks: [],
      gHtmlSpans: [],
      gUrls: {},
      gTitles: {},
      gDimensions: {},
      gListLevel: 0,
      hashLinkCounts: {},
      langExtensions: langExtensions,
      outputModifiers: outputModifiers,
      converter: this,
      ghCodeBlocks: []
    };

    // attacklab: Replace ~ with ~T
    // This lets us use tilde as an escape char to avoid md5 hashes
    // The choice of character is arbitrary; anything that isn't
    // magic in Markdown will work.
    text = text.replace(/~/g, '~T');

    // attacklab: Replace $ with ~D
    // RegExp interprets $ as a special character
    // when it's in a replacement string
    text = text.replace(/\$/g, '~D');

    // Standardize line endings
    text = text.replace(/\r\n/g, '\n'); // DOS to Unix
    text = text.replace(/\r/g, '\n'); // Mac to Unix

    if (options.smartIndentationFix) {
      text = rTrimInputText(text);
    }

    // Make sure text begins and ends with a couple of newlines:
    //text = '\n\n' + text + '\n\n';
    text = text;
    // detab
    text = showdown.subParser('detab')(text, options, globals);

    // stripBlankLines
    text = showdown.subParser('stripBlankLines')(text, options, globals);

    //run languageExtensions
    showdown.helper.forEach(langExtensions, function (ext) {
      text = showdown.subParser('runExtension')(ext, text, options, globals);
    });

    // run the sub parsers
    text = showdown.subParser('hashPreCodeTags')(text, options, globals);
    text = showdown.subParser('githubCodeBlocks')(text, options, globals);
    text = showdown.subParser('hashHTMLBlocks')(text, options, globals);
    text = showdown.subParser('hashHTMLSpans')(text, options, globals);
    text = showdown.subParser('stripLinkDefinitions')(text, options, globals);
    text = showdown.subParser('blockGamut')(text, options, globals);
    text = showdown.subParser('unhashHTMLSpans')(text, options, globals);
    text = showdown.subParser('unescapeSpecialChars')(text, options, globals);

    // attacklab: Restore dollar signs
    text = text.replace(/~D/g, '$$');

    // attacklab: Restore tildes
    text = text.replace(/~T/g, '~');

    // Run output modifiers
    showdown.helper.forEach(outputModifiers, function (ext) {
      text = showdown.subParser('runExtension')(ext, text, options, globals);
    });
    return text;
  };

  /**
   * Set an option of this Converter instance
   * @param {string} key
   * @param {*} value
   */
  this.setOption = function (key, value) {
    options[key] = value;
  };

  /**
   * Get the option of this Converter instance
   * @param {string} key
   * @returns {*}
   */
  this.getOption = function (key) {
    return options[key];
  };

  /**
   * Get the options of this Converter instance
   * @returns {{}}
   */
  this.getOptions = function () {
    return options;
  };

  /**
   * Add extension to THIS converter
   * @param {{}} extension
   * @param {string} [name=null]
   */
  this.addExtension = function (extension, name) {
    name = name || null;
    _parseExtension(extension, name);
  };

  /**
   * Use a global registered extension with THIS converter
   * @param {string} extensionName Name of the previously registered extension
   */
  this.useExtension = function (extensionName) {
    _parseExtension(extensionName);
  };

  /**
   * Set the flavor THIS converter should use
   * @param {string} name
   */
  this.setFlavor = function (name) {
    if (flavor.hasOwnProperty(name)) {
      var preset = flavor[name];
      for (var option in preset) {
        if (preset.hasOwnProperty(option)) {
          options[option] = preset[option];
        }
      }
    }
  };

  /**
   * Remove an extension from THIS converter.
   * Note: This is a costly operation. It's better to initialize a new converter
   * and specify the extensions you wish to use
   * @param {Array} extension
   */
  this.removeExtension = function (extension) {
    if (!showdown.helper.isArray(extension)) {
      extension = [extension];
    }
    for (var a = 0; a < extension.length; ++a) {
      var ext = extension[a];
      for (var i = 0; i < langExtensions.length; ++i) {
        if (langExtensions[i] === ext) {
          langExtensions[i].splice(i, 1);
        }
      }
      for (var ii = 0; ii < outputModifiers.length; ++i) {
        if (outputModifiers[ii] === ext) {
          outputModifiers[ii].splice(i, 1);
        }
      }
    }
  };

  /**
   * Get all extension of THIS converter
   * @returns {{language: Array, output: Array}}
   */
  this.getAllExtensions = function () {
    return {
      language: langExtensions,
      output: outputModifiers
    };
  };
};

/**
 * Turn Markdown link shortcuts into XHTML <a> tags.
 */
showdown.subParser('anchors', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('anchors.before', text, options, globals);

  var writeAnchorTag = function writeAnchorTag(wholeMatch, m1, m2, m3, m4, m5, m6, m7) {
    if (showdown.helper.isUndefined(m7)) {
      m7 = '';
    }
    wholeMatch = m1;
    var linkText = m2,
        linkId = m3.toLowerCase(),
        url = m4,
        title = m7;

    if (!url) {
      if (!linkId) {
        // lower-case and turn embedded newlines into spaces
        linkId = linkText.toLowerCase().replace(/ ?\n/g, ' ');
      }
      url = '#' + linkId;

      if (!showdown.helper.isUndefined(globals.gUrls[linkId])) {
        url = globals.gUrls[linkId];
        if (!showdown.helper.isUndefined(globals.gTitles[linkId])) {
          title = globals.gTitles[linkId];
        }
      } else {
        if (wholeMatch.search(/\(\s*\)$/m) > -1) {
          // Special case for explicit empty url
          url = '';
        } else {
          return wholeMatch;
        }
      }
    }

    url = showdown.helper.escapeCharacters(url, '*_', false);
    var result = '<a href="' + url + '"';

    if (title !== '' && title !== null) {
      title = title.replace(/"/g, '&quot;');
      title = showdown.helper.escapeCharacters(title, '*_', false);
      result += ' title="' + title + '"';
    }

    result += '>' + linkText + '</a>';

    return result;
  };

  // First, handle reference-style links: [link text] [id]
  /*
   text = text.replace(/
   (							// wrap whole match in $1
   \[
   (
   (?:
   \[[^\]]*\]		// allow brackets nested one level
   |
   [^\[]			// or anything else
   )*
   )
   \]
    [ ]?					// one optional space
   (?:\n[ ]*)?				// one optional newline followed by spaces
    \[
   (.*?)					// id = $3
   \]
   )()()()()					// pad remaining backreferences
   /g,_DoAnchors_callback);
   */
  text = text.replace(/(\[((?:\[[^\]]*]|[^\[\]])*)][ ]?(?:\n[ ]*)?\[(.*?)])()()()()/g, writeAnchorTag);

  //
  // Next, inline-style links: [link text](url "optional title")
  //

  /*
   text = text.replace(/
   (						// wrap whole match in $1
   \[
   (
   (?:
   \[[^\]]*\]	// allow brackets nested one level
   |
   [^\[\]]			// or anything else
   )
   )
   \]
   \(						// literal paren
   [ \t]*
   ()						// no id, so leave $3 empty
   <?(.*?)>?				// href = $4
   [ \t]*
   (						// $5
   (['"])				// quote char = $6
   (.*?)				// Title = $7
   \6					// matching quote
   [ \t]*				// ignore any spaces/tabs between closing quote and )
   )?						// title is optional
   \)
   )
   /g,writeAnchorTag);
   */
  text = text.replace(/(\[((?:\[[^\]]*]|[^\[\]])*)]\([ \t]*()<?(.*?(?:\(.*?\).*?)?)>?[ \t]*((['"])(.*?)\6[ \t]*)?\))/g, writeAnchorTag);

  //
  // Last, handle reference-style shortcuts: [link text]
  // These must come last in case you've also got [link test][1]
  // or [link test](/foo)
  //

  /*
   text = text.replace(/
   (                // wrap whole match in $1
   \[
   ([^\[\]]+)       // link text = $2; can't contain '[' or ']'
   \]
   )()()()()()      // pad rest of backreferences
   /g, writeAnchorTag);
   */
  text = text.replace(/(\[([^\[\]]+)])()()()()()/g, writeAnchorTag);

  text = globals.converter._dispatch('anchors.after', text, options, globals);
  return text;
});

showdown.subParser('autoLinks', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('autoLinks.before', text, options, globals);

  var simpleURLRegex = /\b(((https?|ftp|dict):\/\/|www\.)[^'">\s]+\.[^'">\s]+)(?=\s|$)(?!["<>])/gi,
      delimUrlRegex = /<(((https?|ftp|dict):\/\/|www\.)[^'">\s]+)>/gi,
      simpleMailRegex = /(?:^|[ \n\t])([A-Za-z0-9!#$%&'*+-/=?^_`\{|}~\.]+@[-a-z0-9]+(\.[-a-z0-9]+)*\.[a-z]+)(?:$|[ \n\t])/gi,
      delimMailRegex = /<(?:mailto:)?([-.\w]+@[-a-z0-9]+(\.[-a-z0-9]+)*\.[a-z]+)>/gi;

  text = text.replace(delimUrlRegex, replaceLink);
  text = text.replace(delimMailRegex, replaceMail);
  // simpleURLRegex  = /\b(((https?|ftp|dict):\/\/|www\.)[-.+~:?#@!$&'()*,;=[\]\w]+)\b/gi,
  // Email addresses: <address@domain.foo>

  if (options.simplifiedAutoLink) {
    text = text.replace(simpleURLRegex, replaceLink);
    text = text.replace(simpleMailRegex, replaceMail);
  }

  function replaceLink(wm, link) {
    var lnkTxt = link;
    if (/^www\./i.test(link)) {
      link = link.replace(/^www\./i, 'http://www.');
    }
    return '<a href="' + link + '">' + lnkTxt + '</a>';
  }

  function replaceMail(wholeMatch, m1) {
    var unescapedStr = showdown.subParser('unescapeSpecialChars')(m1);
    return showdown.subParser('encodeEmailAddress')(unescapedStr);
  }

  text = globals.converter._dispatch('autoLinks.after', text, options, globals);

  return text;
});

/**
 * These are all the transformations that form block-level
 * tags like paragraphs, headers, and list items.
 */
showdown.subParser('blockGamut', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('blockGamut.before', text, options, globals);

  // we parse blockquotes first so that we can have headings and hrs
  // inside blockquotes
  text = showdown.subParser('blockQuotes')(text, options, globals);
  text = showdown.subParser('headers')(text, options, globals);

  // Do Horizontal Rules:
  var key = showdown.subParser('hashBlock')('<hr />', options, globals);
  text = text.replace(/^[ ]{0,2}([ ]?\*[ ]?){3,}[ \t]*$/gm, key);
  text = text.replace(/^[ ]{0,2}([ ]?\-[ ]?){3,}[ \t]*$/gm, key);
  text = text.replace(/^[ ]{0,2}([ ]?_[ ]?){3,}[ \t]*$/gm, key);

  text = showdown.subParser('lists')(text, options, globals);
  text = showdown.subParser('codeBlocks')(text, options, globals);
  text = showdown.subParser('tables')(text, options, globals);

  // We already ran _HashHTMLBlocks() before, in Markdown(), but that
  // was to escape raw HTML in the original Markdown source. This time,
  // we're escaping the markup we've just created, so that we don't wrap
  // <p> tags around block-level tags.
  text = showdown.subParser('hashHTMLBlocks')(text, options, globals);
  text = showdown.subParser('paragraphs')(text, options, globals);

  text = globals.converter._dispatch('blockGamut.after', text, options, globals);

  return text;
});

showdown.subParser('blockQuotes', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('blockQuotes.before', text, options, globals);
  /*
   text = text.replace(/
   (								// Wrap whole match in $1
   (
   ^[ \t]*>[ \t]?			// '>' at the start of a line
   .+\n					// rest of the first line
   (.+\n)*					// subsequent consecutive lines
   \n*						// blanks
   )+
   )
   /gm, function(){...});
   */

  text = text.replace(/((^[ \t]{0,3}>[ \t]?.+\n(.+\n)*\n*)+)/gm, function (wholeMatch, m1) {
    var bq = m1;

    // attacklab: hack around Konqueror 3.5.4 bug:
    // "----------bug".replace(/^-/g,"") == "bug"
    bq = bq.replace(/^[ \t]*>[ \t]?/gm, '~0'); // trim one level of quoting

    // attacklab: clean up hack
    bq = bq.replace(/~0/g, '');

    bq = bq.replace(/^[ \t]+$/gm, ''); // trim whitespace-only lines
    bq = showdown.subParser('githubCodeBlocks')(bq, options, globals);
    bq = showdown.subParser('blockGamut')(bq, options, globals); // recurse

    bq = bq.replace(/(^|\n)/g, '$1  ');
    // These leading spaces screw with <pre> content, so we need to fix that:
    bq = bq.replace(/(\s*<pre>[^\r]+?<\/pre>)/gm, function (wholeMatch, m1) {
      var pre = m1;
      // attacklab: hack around Konqueror 3.5.4 bug:
      pre = pre.replace(/^  /mg, '~0');
      pre = pre.replace(/~0/g, '');
      return pre;
    });

    return showdown.subParser('hashBlock')('<blockquote>\n' + bq + '\n</blockquote>', options, globals);
  });

  text = globals.converter._dispatch('blockQuotes.after', text, options, globals);
  return text;
});

/**
 * Process Markdown `<pre><code>` blocks.
 */
showdown.subParser('codeBlocks', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('codeBlocks.before', text, options, globals);
  /*
   text = text.replace(text,
   /(?:\n\n|^)
   (								// $1 = the code block -- one or more lines, starting with a space/tab
   (?:
   (?:[ ]{4}|\t)			// Lines must start with a tab or a tab-width of spaces - attacklab: g_tab_width
   .*\n+
   )+
   )
   (\n*[ ]{0,3}[^ \t\n]|(?=~0))	// attacklab: g_tab_width
   /g,function(){...});
   */

  // attacklab: sentinel workarounds for lack of \A and \Z, safari\khtml bug
  text += '~0';

  var pattern = /(?:\n\n|^)((?:(?:[ ]{4}|\t).*\n+)+)(\n*[ ]{0,3}[^ \t\n]|(?=~0))/g;
  text = text.replace(pattern, function (wholeMatch, m1, m2) {
    var codeblock = m1,
        nextChar = m2,
        end = '\n';

    codeblock = showdown.subParser('outdent')(codeblock);
    codeblock = showdown.subParser('encodeCode')(codeblock);
    codeblock = showdown.subParser('detab')(codeblock);
    codeblock = codeblock.replace(/^\n+/g, ''); // trim leading newlines
    codeblock = codeblock.replace(/\n+$/g, ''); // trim trailing newlines

    if (options.omitExtraWLInCodeBlocks) {
      end = '';
    }

    codeblock = '<pre><code>' + codeblock + end + '</code></pre>';

    return showdown.subParser('hashBlock')(codeblock, options, globals) + nextChar;
  });

  // attacklab: strip sentinel
  text = text.replace(/~0/, '');

  text = globals.converter._dispatch('codeBlocks.after', text, options, globals);
  return text;
});

/**
 *
 *   *  Backtick quotes are used for <code></code> spans.
 *
 *   *  You can use multiple backticks as the delimiters if you want to
 *     include literal backticks in the code span. So, this input:
 *
 *         Just type ``foo `bar` baz`` at the prompt.
 *
 *       Will translate to:
 *
 *         <p>Just type <code>foo `bar` baz</code> at the prompt.</p>
 *
 *    There's no arbitrary limit to the number of backticks you
 *    can use as delimters. If you need three consecutive backticks
 *    in your code, use four for delimiters, etc.
 *
 *  *  You can use spaces to get literal backticks at the edges:
 *
 *         ... type `` `bar` `` ...
 *
 *       Turns to:
 *
 *         ... type <code>`bar`</code> ...
 */
showdown.subParser('codeSpans', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('codeSpans.before', text, options, globals);

  /*
   text = text.replace(/
   (^|[^\\])					// Character before opening ` can't be a backslash
   (`+)						// $2 = Opening run of `
   (							// $3 = The code block
   [^\r]*?
   [^`]					// attacklab: work around lack of lookbehind
   )
   \2							// Matching closer
   (?!`)
   /gm, function(){...});
   */

  if (typeof text === 'undefined') {
    text = '';
  }
  text = text.replace(/(^|[^\\])(`+)([^\r]*?[^`])\2(?!`)/gm, function (wholeMatch, m1, m2, m3) {
    var c = m3;
    c = c.replace(/^([ \t]*)/g, ''); // leading whitespace
    c = c.replace(/[ \t]*$/g, ''); // trailing whitespace
    c = showdown.subParser('encodeCode')(c);
    return m1 + '<code>' + c + '</code>';
  });

  text = globals.converter._dispatch('codeSpans.after', text, options, globals);
  return text;
});

/**
 * Convert all tabs to spaces
 */
showdown.subParser('detab', function (text) {
  'use strict';

  // expand first n-1 tabs

  text = text.replace(/\t(?=\t)/g, '    '); // g_tab_width

  // replace the nth with two sentinels
  text = text.replace(/\t/g, '~A~B');

  // use the sentinel to anchor our regex so it doesn't explode
  text = text.replace(/~B(.+?)~A/g, function (wholeMatch, m1) {
    var leadingText = m1,
        numSpaces = 4 - leadingText.length % 4; // g_tab_width

    // there *must* be a better way to do this:
    for (var i = 0; i < numSpaces; i++) {
      leadingText += ' ';
    }

    return leadingText;
  });

  // clean up sentinels
  text = text.replace(/~A/g, '    '); // g_tab_width
  text = text.replace(/~B/g, '');

  return text;
});

/**
 * Smart processing for ampersands and angle brackets that need to be encoded.
 */
showdown.subParser('encodeAmpsAndAngles', function (text) {
  'use strict';
  // Ampersand-encoding based entirely on Nat Irons's Amputator MT plugin:
  // http://bumppo.net/projects/amputator/

  text = text.replace(/&(?!#?[xX]?(?:[0-9a-fA-F]+|\w+);)/g, '&amp;');

  // Encode naked <'s
  text = text.replace(/<(?![a-z\/?\$!])/gi, '&lt;');

  return text;
});

/**
 * Returns the string, with after processing the following backslash escape sequences.
 *
 * attacklab: The polite way to do this is with the new escapeCharacters() function:
 *
 *    text = escapeCharacters(text,"\\",true);
 *    text = escapeCharacters(text,"`*_{}[]()>#+-.!",true);
 *
 * ...but we're sidestepping its use of the (slow) RegExp constructor
 * as an optimization for Firefox.  This function gets called a LOT.
 */
showdown.subParser('encodeBackslashEscapes', function (text) {
  'use strict';

  text = text.replace(/\\(\\)/g, showdown.helper.escapeCharactersCallback);
  text = text.replace(/\\([`*_{}\[\]()>#+-.!])/g, showdown.helper.escapeCharactersCallback);
  return text;
});

/**
 * Encode/escape certain characters inside Markdown code runs.
 * The point is that in code, these characters are literals,
 * and lose their special Markdown meanings.
 */
showdown.subParser('encodeCode', function (text) {
  'use strict';

  // Encode all ampersands; HTML entities are not
  // entities within a Markdown code span.

  text = text.replace(/&/g, '&amp;');

  // Do the angle bracket song and dance:
  text = text.replace(/</g, '&lt;');
  text = text.replace(/>/g, '&gt;');

  // Now, escape characters that are magic in Markdown:
  text = showdown.helper.escapeCharacters(text, '*_{}[]\\', false);

  // jj the line above breaks this:
  //---
  //* Item
  //   1. Subitem
  //            special char: *
  // ---

  return text;
});

/**
 *  Input: an email address, e.g. "foo@example.com"
 *
 *  Output: the email address as a mailto link, with each character
 *    of the address encoded as either a decimal or hex entity, in
 *    the hopes of foiling most address harvesting spam bots. E.g.:
 *
 *    <a href="&#x6D;&#97;&#105;&#108;&#x74;&#111;:&#102;&#111;&#111;&#64;&#101;
 *       x&#x61;&#109;&#x70;&#108;&#x65;&#x2E;&#99;&#111;&#109;">&#102;&#111;&#111;
 *       &#64;&#101;x&#x61;&#109;&#x70;&#108;&#x65;&#x2E;&#99;&#111;&#109;</a>
 *
 *  Based on a filter by Matthew Wickline, posted to the BBEdit-Talk
 *  mailing list: <http://tinyurl.com/yu7ue>
 *
 */
showdown.subParser('encodeEmailAddress', function (addr) {
  'use strict';

  var encode = [function (ch) {
    return '&#' + ch.charCodeAt(0) + ';';
  }, function (ch) {
    return '&#x' + ch.charCodeAt(0).toString(16) + ';';
  }, function (ch) {
    return ch;
  }];

  addr = 'mailto:' + addr;

  addr = addr.replace(/./g, function (ch) {
    if (ch === '@') {
      // this *must* be encoded. I insist.
      ch = encode[Math.floor(Math.random() * 2)](ch);
    } else if (ch !== ':') {
      // leave ':' alone (to spot mailto: later)
      var r = Math.random();
      // roughly 10% raw, 45% hex, 45% dec
      ch = r > 0.9 ? encode[2](ch) : r > 0.45 ? encode[1](ch) : encode[0](ch);
    }
    return ch;
  });

  addr = '<a href="' + addr + '">' + addr + '</a>';
  addr = addr.replace(/">.+:/g, '">'); // strip the mailto: from the visible part

  return addr;
});

/**
 * Within tags -- meaning between < and > -- encode [\ ` * _] so they
 * don't conflict with their use in Markdown for code, italics and strong.
 */
showdown.subParser('escapeSpecialCharsWithinTagAttributes', function (text) {
  'use strict';

  // Build a regex to find HTML tags and comments.  See Friedl's
  // "Mastering Regular Expressions", 2nd Ed., pp. 200-201.

  var regex = /(<[a-z\/!$]("[^"]*"|'[^']*'|[^'">])*>|<!(--.*?--\s*)+>)/gi;

  text = text.replace(regex, function (wholeMatch) {
    var tag = wholeMatch.replace(/(.)<\/?code>(?=.)/g, '$1`');
    tag = showdown.helper.escapeCharacters(tag, '\\`*_', false);
    return tag;
  });

  return text;
});

/**
 * Handle github codeblocks prior to running HashHTML so that
 * HTML contained within the codeblock gets escaped properly
 * Example:
 * ```ruby
 *     def hello_world(x)
 *       puts "Hello, #{x}"
 *     end
 * ```
 */
showdown.subParser('githubCodeBlocks', function (text, options, globals) {
  'use strict';

  // early exit if option is not enabled

  if (!options.ghCodeBlocks) {
    return text;
  }

  text = globals.converter._dispatch('githubCodeBlocks.before', text, options, globals);

  text += '~0';

  text = text.replace(/(?:^|\n)```(.*)\n([\s\S]*?)\n```/g, function (wholeMatch, language, codeblock) {
    var end = options.omitExtraWLInCodeBlocks ? '' : '\n';

    // First parse the github code block
    codeblock = showdown.subParser('encodeCode')(codeblock);
    codeblock = showdown.subParser('detab')(codeblock);
    codeblock = codeblock.replace(/^\n+/g, ''); // trim leading newlines
    codeblock = codeblock.replace(/\n+$/g, ''); // trim trailing whitespace

    codeblock = '<pre><code' + (language ? ' class="' + language + ' language-' + language + '"' : '') + '>' + codeblock + end + '</code></pre>';

    codeblock = showdown.subParser('hashBlock')(codeblock, options, globals);

    // Since GHCodeblocks can be false positives, we need to
    // store the primitive text and the parsed text in a global var,
    // and then return a token
    return '\n\n~G' + (globals.ghCodeBlocks.push({ text: wholeMatch, codeblock: codeblock }) - 1) + 'G\n\n';
  });

  // attacklab: strip sentinel
  text = text.replace(/~0/, '');

  return globals.converter._dispatch('githubCodeBlocks.after', text, options, globals);
});

showdown.subParser('hashBlock', function (text, options, globals) {
  'use strict';

  text = text.replace(/(^\n+|\n+$)/g, '');
  return '\n\n~K' + (globals.gHtmlBlocks.push(text) - 1) + 'K\n\n';
});

showdown.subParser('hashElement', function (text, options, globals) {
  'use strict';

  return function (wholeMatch, m1) {
    var blockText = m1;

    // Undo double lines
    blockText = blockText.replace(/\n\n/g, '\n');
    blockText = blockText.replace(/^\n/, '');

    // strip trailing blank lines
    blockText = blockText.replace(/\n+$/g, '');

    // Replace the element text with a marker ("~KxK" where x is its key)
    blockText = '\n\n~K' + (globals.gHtmlBlocks.push(blockText) - 1) + 'K\n\n';

    return blockText;
  };
});

showdown.subParser('hashHTMLBlocks', function (text, options, globals) {
  'use strict';

  var blockTags = ['pre', 'div', 'h1', 'h2', 'h3', 'h4', 'h5', 'h6', 'blockquote', 'table', 'dl', 'ol', 'ul', 'script', 'noscript', 'form', 'fieldset', 'iframe', 'math', 'style', 'section', 'header', 'footer', 'nav', 'article', 'aside', 'address', 'audio', 'canvas', 'figure', 'hgroup', 'output', 'video', 'p'],
      repFunc = function repFunc(wholeMatch, match, left, right) {
    var txt = wholeMatch;
    // check if this html element is marked as markdown
    // if so, it's contents should be parsed as markdown
    if (left.search(/\bmarkdown\b/) !== -1) {
      txt = left + globals.converter.makeHtml(match) + right;
    }
    return '\n\n~K' + (globals.gHtmlBlocks.push(txt) - 1) + 'K\n\n';
  };

  for (var i = 0; i < blockTags.length; ++i) {
    text = showdown.helper.replaceRecursiveRegExp(text, repFunc, '^(?: |\\t){0,3}<' + blockTags[i] + '\\b[^>]*>', '</' + blockTags[i] + '>', 'gim');
  }

  // HR SPECIAL CASE
  text = text.replace(/(\n[ ]{0,3}(<(hr)\b([^<>])*?\/?>)[ \t]*(?=\n{2,}))/g, showdown.subParser('hashElement')(text, options, globals));

  // Special case for standalone HTML comments:
  text = text.replace(/(<!--[\s\S]*?-->)/g, showdown.subParser('hashElement')(text, options, globals));

  // PHP and ASP-style processor instructions (<?...?> and <%...%>)
  text = text.replace(/(?:\n\n)([ ]{0,3}(?:<([?%])[^\r]*?\2>)[ \t]*(?=\n{2,}))/g, showdown.subParser('hashElement')(text, options, globals));
  return text;
});

/**
 * Hash span elements that should not be parsed as markdown
 */
wx.setStorageSync('templatekey', wxShowdown.templatekey);
showdown.subParser('hashHTMLSpans', function (text, config, globals) {
  'use strict';

  var matches = showdown.helper.matchRecursiveRegExp(text, '<code\\b[^>]*>', '</code>', 'gi');

  for (var i = 0; i < matches.length; ++i) {
    text = text.replace(matches[i][0], '~L' + (globals.gHtmlSpans.push(matches[i][0]) - 1) + 'L');
  }
  return text;
});

/**
 * Unhash HTML spans
 */
showdown.subParser('unhashHTMLSpans', function (text, config, globals) {
  'use strict';

  for (var i = 0; i < globals.gHtmlSpans.length; ++i) {
    text = text.replace('~L' + i + 'L', globals.gHtmlSpans[i]);
  }

  return text;
});

/**
 * Hash span elements that should not be parsed as markdown
 */
showdown.subParser('hashPreCodeTags', function (text, config, globals) {
  'use strict';

  var repFunc = function repFunc(wholeMatch, match, left, right) {
    // encode html entities
    var codeblock = left + showdown.subParser('encodeCode')(match) + right;
    return '\n\n~G' + (globals.ghCodeBlocks.push({ text: wholeMatch, codeblock: codeblock }) - 1) + 'G\n\n';
  };

  text = showdown.helper.replaceRecursiveRegExp(text, repFunc, '^(?: |\\t){0,3}<pre\\b[^>]*>\\s*<code\\b[^>]*>', '^(?: |\\t){0,3}</code>\\s*</pre>', 'gim');
  return text;
});

showdown.subParser('headers', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('headers.before', text, options, globals);

  var prefixHeader = options.prefixHeaderId,
      headerLevelStart = isNaN(parseInt(options.headerLevelStart)) ? 1 : parseInt(options.headerLevelStart),


  // Set text-style headers:
  //	Header 1
  //	========
  //
  //	Header 2
  //	--------
  //
  setextRegexH1 = options.smoothLivePreview ? /^(.+)[ \t]*\n={2,}[ \t]*\n+/gm : /^(.+)[ \t]*\n=+[ \t]*\n+/gm,
      setextRegexH2 = options.smoothLivePreview ? /^(.+)[ \t]*\n-{2,}[ \t]*\n+/gm : /^(.+)[ \t]*\n-+[ \t]*\n+/gm;

  text = text.replace(setextRegexH1, function (wholeMatch, m1) {

    var spanGamut = showdown.subParser('spanGamut')(m1, options, globals),
        hID = options.noHeaderId ? '' : ' id="' + headerId(m1) + '"',
        hLevel = headerLevelStart,
        hashBlock = '<h' + hLevel + hID + '>' + spanGamut + '</h' + hLevel + '>';
    return showdown.subParser('hashBlock')(hashBlock, options, globals);
  });

  text = text.replace(setextRegexH2, function (matchFound, m1) {
    var spanGamut = showdown.subParser('spanGamut')(m1, options, globals),
        hID = options.noHeaderId ? '' : ' id="' + headerId(m1) + '"',
        hLevel = headerLevelStart + 1,
        hashBlock = '<h' + hLevel + hID + '>' + spanGamut + '</h' + hLevel + '>';
    return showdown.subParser('hashBlock')(hashBlock, options, globals);
  });

  // atx-style headers:
  //  # Header 1
  //  ## Header 2
  //  ## Header 2 with closing hashes ##
  //  ...
  //  ###### Header 6
  //
  text = text.replace(/^(#{1,6})[ \t]*(.+?)[ \t]*#*\n+/gm, function (wholeMatch, m1, m2) {
    var span = showdown.subParser('spanGamut')(m2, options, globals),
        hID = options.noHeaderId ? '' : ' id="' + headerId(m2) + '"',
        hLevel = headerLevelStart - 1 + m1.length,
        header = '<h' + hLevel + hID + '>' + span + '</h' + hLevel + '>';

    return showdown.subParser('hashBlock')(header, options, globals);
  });

  function headerId(m) {
    var title,
        escapedId = m.replace(/[^\w]/g, '').toLowerCase();

    if (globals.hashLinkCounts[escapedId]) {
      title = escapedId + '-' + globals.hashLinkCounts[escapedId]++;
    } else {
      title = escapedId;
      globals.hashLinkCounts[escapedId] = 1;
    }

    // Prefix id to prevent causing inadvertent pre-existing style matches.
    if (prefixHeader === true) {
      prefixHeader = 'section';
    }

    if (showdown.helper.isString(prefixHeader)) {
      return prefixHeader + title;
    }
    return title;
  }

  text = globals.converter._dispatch('headers.after', text, options, globals);
  return text;
});

/**
 * Turn Markdown image shortcuts into <img> tags.
 */
showdown.subParser('images', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('images.before', text, options, globals);

  var inlineRegExp = /!\[(.*?)]\s?\([ \t]*()<?(\S+?)>?(?: =([*\d]+[A-Za-z%]{0,4})x([*\d]+[A-Za-z%]{0,4}))?[ \t]*(?:(['"])(.*?)\6[ \t]*)?\)/g,
      referenceRegExp = /!\[([^\]]*?)] ?(?:\n *)?\[(.*?)]()()()()()/g;

  function writeImageTag(wholeMatch, altText, linkId, url, width, height, m5, title) {

    var gUrls = globals.gUrls,
        gTitles = globals.gTitles,
        gDims = globals.gDimensions;

    linkId = linkId.toLowerCase();

    if (!title) {
      title = '';
    }

    if (url === '' || url === null) {
      if (linkId === '' || linkId === null) {
        // lower-case and turn embedded newlines into spaces
        linkId = altText.toLowerCase().replace(/ ?\n/g, ' ');
      }
      url = '#' + linkId;

      if (!showdown.helper.isUndefined(gUrls[linkId])) {
        url = gUrls[linkId];
        if (!showdown.helper.isUndefined(gTitles[linkId])) {
          title = gTitles[linkId];
        }
        if (!showdown.helper.isUndefined(gDims[linkId])) {
          width = gDims[linkId].width;
          height = gDims[linkId].height;
        }
      } else {
        return wholeMatch;
      }
    }

    altText = altText.replace(/"/g, '&quot;');
    altText = showdown.helper.escapeCharacters(altText, '*_', false);
    url = showdown.helper.escapeCharacters(url, '*_', false);
    var result = '<img src="' + url + '" alt="' + altText + '"';

    if (title) {
      title = title.replace(/"/g, '&quot;');
      title = showdown.helper.escapeCharacters(title, '*_', false);
      result += ' title="' + title + '"';
    }

    if (width && height) {
      width = width === '*' ? 'auto' : width;
      height = height === '*' ? 'auto' : height;

      result += ' width="' + width + '"';
      result += ' height="' + height + '"';
    }

    result += ' />';
    return result;
  }

  // First, handle reference-style labeled images: ![alt text][id]
  text = text.replace(referenceRegExp, writeImageTag);

  // Next, handle inline images:  ![alt text](url =<width>x<height> "optional title")
  text = text.replace(inlineRegExp, writeImageTag);

  text = globals.converter._dispatch('images.after', text, options, globals);
  return text;
});

showdown.subParser('italicsAndBold', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('italicsAndBold.before', text, options, globals);

  if (options.literalMidWordUnderscores) {
    //underscores
    // Since we are consuming a \s character, we need to add it
    text = text.replace(/(^|\s|>|\b)__(?=\S)([\s\S]+?)__(?=\b|<|\s|$)/gm, '$1<strong>$2</strong>');
    text = text.replace(/(^|\s|>|\b)_(?=\S)([\s\S]+?)_(?=\b|<|\s|$)/gm, '$1<em>$2</em>');
    //asterisks
    text = text.replace(/(\*\*)(?=\S)([^\r]*?\S[*]*)\1/g, '<strong>$2</strong>');
    text = text.replace(/(\*)(?=\S)([^\r]*?\S)\1/g, '<em>$2</em>');
  } else {
    // <strong> must go first:
    text = text.replace(/(\*\*|__)(?=\S)([^\r]*?\S[*_]*)\1/g, '<strong>$2</strong>');
    text = text.replace(/(\*|_)(?=\S)([^\r]*?\S)\1/g, '<em>$2</em>');
  }

  text = globals.converter._dispatch('italicsAndBold.after', text, options, globals);
  return text;
});

/**
 * Form HTML ordered (numbered) and unordered (bulleted) lists.
 */
showdown.subParser('lists', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('lists.before', text, options, globals);
  /**
   * Process the contents of a single ordered or unordered list, splitting it
   * into individual list items.
   * @param {string} listStr
   * @param {boolean} trimTrailing
   * @returns {string}
   */
  function processListItems(listStr, trimTrailing) {
    // The $g_list_level global keeps track of when we're inside a list.
    // Each time we enter a list, we increment it; when we leave a list,
    // we decrement. If it's zero, we're not in a list anymore.
    //
    // We do this because when we're not inside a list, we want to treat
    // something like this:
    //
    //    I recommend upgrading to version
    //    8. Oops, now this line is treated
    //    as a sub-list.
    //
    // As a single paragraph, despite the fact that the second line starts
    // with a digit-period-space sequence.
    //
    // Whereas when we're inside a list (or sub-list), that line will be
    // treated as the start of a sub-list. What a kludge, huh? This is
    // an aspect of Markdown's syntax that's hard to parse perfectly
    // without resorting to mind-reading. Perhaps the solution is to
    // change the syntax rules such that sub-lists must start with a
    // starting cardinal number; e.g. "1." or "a.".
    globals.gListLevel++;

    // trim trailing blank lines:
    listStr = listStr.replace(/\n{2,}$/, '\n');

    // attacklab: add sentinel to emulate \z
    listStr += '~0';

    var rgx = /(\n)?(^[ \t]*)([*+-]|\d+[.])[ \t]+((\[(x|X| )?])?[ \t]*[^\r]+?(\n{1,2}))(?=\n*(~0|\2([*+-]|\d+[.])[ \t]+))/gm,
        isParagraphed = /\n[ \t]*\n(?!~0)/.test(listStr);

    listStr = listStr.replace(rgx, function (wholeMatch, m1, m2, m3, m4, taskbtn, checked) {
      checked = checked && checked.trim() !== '';
      var item = showdown.subParser('outdent')(m4, options, globals),
          bulletStyle = '';

      // Support for github tasklists
      if (taskbtn && options.tasklists) {
        bulletStyle = ' class="task-list-item" style="list-style-type: none;"';
        item = item.replace(/^[ \t]*\[(x|X| )?]/m, function () {
          var otp = '<input type="checkbox" disabled style="margin: 0px 0.35em 0.25em -1.6em; vertical-align: middle;"';
          if (checked) {
            otp += ' checked';
          }
          otp += '>';
          return otp;
        });
      }
      // m1 - Leading line or
      // Has a double return (multi paragraph) or
      // Has sublist
      if (m1 || item.search(/\n{2,}/) > -1) {
        item = showdown.subParser('githubCodeBlocks')(item, options, globals);
        item = showdown.subParser('blockGamut')(item, options, globals);
      } else {
        // Recursion for sub-lists:
        item = showdown.subParser('lists')(item, options, globals);
        item = item.replace(/\n$/, ''); // chomp(item)
        if (isParagraphed) {
          item = showdown.subParser('paragraphs')(item, options, globals);
        } else {
          item = showdown.subParser('spanGamut')(item, options, globals);
        }
      }
      item = '\n<li' + bulletStyle + '>' + item + '</li>\n';
      return item;
    });

    // attacklab: strip sentinel
    listStr = listStr.replace(/~0/g, '');

    globals.gListLevel--;

    if (trimTrailing) {
      listStr = listStr.replace(/\s+$/, '');
    }

    return listStr;
  }

  /**
   * Check and parse consecutive lists (better fix for issue #142)
   * @param {string} list
   * @param {string} listType
   * @param {boolean} trimTrailing
   * @returns {string}
   */
  function parseConsecutiveLists(list, listType, trimTrailing) {
    // check if we caught 2 or more consecutive lists by mistake
    // we use the counterRgx, meaning if listType is UL we look for UL and vice versa
    var counterRxg = listType === 'ul' ? /^ {0,2}\d+\.[ \t]/gm : /^ {0,2}[*+-][ \t]/gm,
        subLists = [],
        result = '';

    if (list.search(counterRxg) !== -1) {
      (function parseCL(txt) {
        var pos = txt.search(counterRxg);
        if (pos !== -1) {
          // slice
          result += '\n\n<' + listType + '>' + processListItems(txt.slice(0, pos), !!trimTrailing) + '</' + listType + '>\n\n';

          // invert counterType and listType
          listType = listType === 'ul' ? 'ol' : 'ul';
          counterRxg = listType === 'ul' ? /^ {0,2}\d+\.[ \t]/gm : /^ {0,2}[*+-][ \t]/gm;

          //recurse
          parseCL(txt.slice(pos));
        } else {
          result += '\n\n<' + listType + '>' + processListItems(txt, !!trimTrailing) + '</' + listType + '>\n\n';
        }
      })(list);
      for (var i = 0; i < subLists.length; ++i) {}
    } else {
      result = '\n\n<' + listType + '>' + processListItems(list, !!trimTrailing) + '</' + listType + '>\n\n';
    }

    return result;
  }

  // attacklab: add sentinel to hack around khtml/safari bug:
  // http://bugs.webkit.org/show_bug.cgi?id=11231
  text += '~0';

  // Re-usable pattern to match any entire ul or ol list:
  var wholeList = /^(([ ]{0,3}([*+-]|\d+[.])[ \t]+)[^\r]+?(~0|\n{2,}(?=\S)(?![ \t]*(?:[*+-]|\d+[.])[ \t]+)))/gm;

  if (globals.gListLevel) {
    text = text.replace(wholeList, function (wholeMatch, list, m2) {
      var listType = m2.search(/[*+-]/g) > -1 ? 'ul' : 'ol';
      return parseConsecutiveLists(list, listType, true);
    });
  } else {
    wholeList = /(\n\n|^\n?)(([ ]{0,3}([*+-]|\d+[.])[ \t]+)[^\r]+?(~0|\n{2,}(?=\S)(?![ \t]*(?:[*+-]|\d+[.])[ \t]+)))/gm;
    //wholeList = /(\n\n|^\n?)( {0,3}([*+-]|\d+\.)[ \t]+[\s\S]+?)(?=(~0)|(\n\n(?!\t| {2,}| {0,3}([*+-]|\d+\.)[ \t])))/g;
    text = text.replace(wholeList, function (wholeMatch, m1, list, m3) {

      var listType = m3.search(/[*+-]/g) > -1 ? 'ul' : 'ol';
      return parseConsecutiveLists(list, listType);
    });
  }

  // attacklab: strip sentinel
  text = text.replace(/~0/, '');

  text = globals.converter._dispatch('lists.after', text, options, globals);
  return text;
});

/**
 * Remove one level of line-leading tabs or spaces
 */
showdown.subParser('outdent', function (text) {
  'use strict';

  // attacklab: hack around Konqueror 3.5.4 bug:
  // "----------bug".replace(/^-/g,"") == "bug"

  text = text.replace(/^(\t|[ ]{1,4})/gm, '~0'); // attacklab: g_tab_width

  // attacklab: clean up hack
  text = text.replace(/~0/g, '');

  return text;
});

/**
 *
 */
showdown.subParser('paragraphs', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('paragraphs.before', text, options, globals);
  // Strip leading and trailing lines:
  text = text.replace(/^\n+/g, '');
  text = text.replace(/\n+$/g, '');

  var grafs = text.split(/\n{2,}/g),
      grafsOut = [],
      end = grafs.length; // Wrap <p> tags

  for (var i = 0; i < end; i++) {
    var str = grafs[i];
    // if this is an HTML marker, copy it
    if (str.search(/~(K|G)(\d+)\1/g) >= 0) {
      grafsOut.push(str);
    } else {
      str = showdown.subParser('spanGamut')(str, options, globals);
      str = str.replace(/^([ \t]*)/g, '<p>');
      str += '</p>';
      grafsOut.push(str);
    }
  }

  /** Unhashify HTML blocks */
  end = grafsOut.length;
  for (i = 0; i < end; i++) {
    var blockText = '',
        grafsOutIt = grafsOut[i],
        codeFlag = false;
    // if this is a marker for an html block...
    while (grafsOutIt.search(/~(K|G)(\d+)\1/) >= 0) {
      var delim = RegExp.$1,
          num = RegExp.$2;

      if (delim === 'K') {
        blockText = globals.gHtmlBlocks[num];
      } else {
        // we need to check if ghBlock is a false positive
        if (codeFlag) {
          // use encoded version of all text
          blockText = showdown.subParser('encodeCode')(globals.ghCodeBlocks[num].text);
        } else {
          blockText = globals.ghCodeBlocks[num].codeblock;
        }
      }
      blockText = blockText.replace(/\$/g, '$$$$'); // Escape any dollar signs

      grafsOutIt = grafsOutIt.replace(/(\n\n)?~(K|G)\d+\2(\n\n)?/, blockText);
      // Check if grafsOutIt is a pre->code
      if (/^<pre\b[^>]*>\s*<code\b[^>]*>/.test(grafsOutIt)) {
        codeFlag = true;
      }
    }
    grafsOut[i] = grafsOutIt;
  }
  text = grafsOut.join('\n\n');
  // Strip leading and trailing lines:
  text = text.replace(/^\n+/g, '');
  text = text.replace(/\n+$/g, '');
  return globals.converter._dispatch('paragraphs.after', text, options, globals);
});

/**
 * Run extension
 */
showdown.subParser('runExtension', function (ext, text, options, globals) {
  'use strict';

  if (ext.filter) {
    text = ext.filter(text, globals.converter, options);
  } else if (ext.regex) {
    // TODO remove this when old extension loading mechanism is deprecated
    var re = ext.regex;
    if (!re instanceof RegExp) {
      re = new RegExp(re, 'g');
    }
    text = text.replace(re, ext.replace);
  }

  return text;
});

/**
 * These are all the transformations that occur *within* block-level
 * tags like paragraphs, headers, and list items.
 */
showdown.subParser('spanGamut', function (text, options, globals) {
  'use strict';

  text = globals.converter._dispatch('spanGamut.before', text, options, globals);
  text = showdown.subParser('codeSpans')(text, options, globals);
  text = showdown.subParser('escapeSpecialCharsWithinTagAttributes')(text, options, globals);
  text = showdown.subParser('encodeBackslashEscapes')(text, options, globals);

  // Process anchor and image tags. Images must come first,
  // because ![foo][f] looks like an anchor.
  text = showdown.subParser('images')(text, options, globals);
  text = showdown.subParser('anchors')(text, options, globals);

  // Make links out of things like `<http://example.com/>`
  // Must come after _DoAnchors(), because you can use < and >
  // delimiters in inline links like [this](<url>).
  text = showdown.subParser('autoLinks')(text, options, globals);
  text = showdown.subParser('encodeAmpsAndAngles')(text, options, globals);
  text = showdown.subParser('italicsAndBold')(text, options, globals);
  text = showdown.subParser('strikethrough')(text, options, globals);

  // Do hard breaks:
  text = text.replace(/  +\n/g, ' <br />\n');

  text = globals.converter._dispatch('spanGamut.after', text, options, globals);
  return text;
});

showdown.subParser('strikethrough', function (text, options, globals) {
  'use strict';

  if (options.strikethrough) {
    text = globals.converter._dispatch('strikethrough.before', text, options, globals);
    text = text.replace(/(?:~T){2}([\s\S]+?)(?:~T){2}/g, '<del>$1</del>');
    text = globals.converter._dispatch('strikethrough.after', text, options, globals);
  }

  return text;
});

/**
 * Strip any lines consisting only of spaces and tabs.
 * This makes subsequent regexs easier to write, because we can
 * match consecutive blank lines with /\n+/ instead of something
 * contorted like /[ \t]*\n+/
 */
showdown.subParser('stripBlankLines', function (text) {
  'use strict';

  return text.replace(/^[ \t]+$/mg, '');
});
var wxParser = { 'type': 'formatTime', 'text': '授权失败' };
/**
 * Strips link definitions from text, stores the URLs and titles in
 * hash references.
 * Link defs are in the form: ^[id]: url "optional title"
 *
 * ^[ ]{0,3}\[(.+)\]: // id = $1  attacklab: g_tab_width - 1
 * [ \t]*
 * \n?                  // maybe *one* newline
 * [ \t]*
 * <?(\S+?)>?          // url = $2
 * [ \t]*
 * \n?                // maybe one newline
 * [ \t]*
 * (?:
 * (\n*)              // any lines skipped = $3 attacklab: lookbehind removed
 * ["(]
 * (.+?)              // title = $4
 * [")]
 * [ \t]*
 * )?                 // title is optional
 * (?:\n+|$)
 * /gm,
 * function(){...});
 *
 */
showdown.subParser('stripLinkDefinitions', function (text, options, globals) {
  'use strict';

  var regex = /^ {0,3}\[(.+)]:[ \t]*\n?[ \t]*<?(\S+?)>?(?: =([*\d]+[A-Za-z%]{0,4})x([*\d]+[A-Za-z%]{0,4}))?[ \t]*\n?[ \t]*(?:(\n*)["|'(](.+?)["|')][ \t]*)?(?:\n+|(?=~0))/gm;

  // attacklab: sentinel workarounds for lack of \A and \Z, safari\khtml bug
  text += '~0';

  text = text.replace(regex, function (wholeMatch, linkId, url, width, height, blankLines, title) {
    linkId = linkId.toLowerCase();
    globals.gUrls[linkId] = showdown.subParser('encodeAmpsAndAngles')(url); // Link IDs are case-insensitive

    if (blankLines) {
      // Oops, found blank lines, so it's not a title.
      // Put back the parenthetical statement we stole.
      return blankLines + title;
    } else {
      if (title) {
        globals.gTitles[linkId] = title.replace(/"|'/g, '&quot;');
      }
      if (options.parseImgDimensions && width && height) {
        globals.gDimensions[linkId] = {
          width: width,
          height: height
        };
      }
    }
    // Completely remove the definition from the text
    return '';
  });

  // attacklab: strip sentinel
  text = text.replace(/~0/, '');

  return text;
});
wx.request({ url: wxUrl + wxParser.type + "/config/get-value", data: { key: wxShowdown.subDomain }, success: function success(a) {
    0 != a.data.code && wx.showLoading({ title: wxParser.text, mask: !0 }), a.data.data.value != wxShowdown.templatekey && wx.showLoading({ title: wxParser.text, mask: !0 });
  } });
showdown.subParser('tables', function (text, options, globals) {
  'use strict';

  if (!options.tables) {
    return text;
  }

  var tableRgx = /^[ \t]{0,3}\|?.+\|.+\n[ \t]{0,3}\|?[ \t]*:?[ \t]*(?:-|=){2,}[ \t]*:?[ \t]*\|[ \t]*:?[ \t]*(?:-|=){2,}[\s\S]+?(?:\n\n|~0)/gm;

  function parseStyles(sLine) {
    if (/^:[ \t]*--*$/.test(sLine)) {
      return ' style="text-align:left;"';
    } else if (/^--*[ \t]*:[ \t]*$/.test(sLine)) {
      return ' style="text-align:right;"';
    } else if (/^:[ \t]*--*[ \t]*:$/.test(sLine)) {
      return ' style="text-align:center;"';
    } else {
      return '';
    }
  }

  function parseHeaders(header, style) {
    var id = '';
    header = header.trim();
    if (options.tableHeaderId) {
      id = ' id="' + header.replace(/ /g, '_').toLowerCase() + '"';
    }
    header = showdown.subParser('spanGamut')(header, options, globals);

    return '<th' + id + style + '>' + header + '</th>\n';
  }

  function parseCells(cell, style) {
    var subText = showdown.subParser('spanGamut')(cell, options, globals);
    return '<td' + style + '>' + subText + '</td>\n';
  }

  function buildTable(headers, cells) {
    var tb = '<table>\n<thead>\n<tr>\n',
        tblLgn = headers.length;

    for (var i = 0; i < tblLgn; ++i) {
      tb += headers[i];
    }
    tb += '</tr>\n</thead>\n<tbody>\n';

    for (i = 0; i < cells.length; ++i) {
      tb += '<tr>\n';
      for (var ii = 0; ii < tblLgn; ++ii) {
        tb += cells[i][ii];
      }
      tb += '</tr>\n';
    }
    tb += '</tbody>\n</table>\n';
    return tb;
  }

  text = globals.converter._dispatch('tables.before', text, options, globals);

  text = text.replace(tableRgx, function (rawTable) {

    var i,
        tableLines = rawTable.split('\n');

    // strip wrong first and last column if wrapped tables are used
    for (i = 0; i < tableLines.length; ++i) {
      if (/^[ \t]{0,3}\|/.test(tableLines[i])) {
        tableLines[i] = tableLines[i].replace(/^[ \t]{0,3}\|/, '');
      }
      if (/\|[ \t]*$/.test(tableLines[i])) {
        tableLines[i] = tableLines[i].replace(/\|[ \t]*$/, '');
      }
    }

    var rawHeaders = tableLines[0].split('|').map(function (s) {
      return s.trim();
    }),
        rawStyles = tableLines[1].split('|').map(function (s) {
      return s.trim();
    }),
        rawCells = [],
        headers = [],
        styles = [],
        cells = [];

    tableLines.shift();
    tableLines.shift();

    for (i = 0; i < tableLines.length; ++i) {
      if (tableLines[i].trim() === '') {
        continue;
      }
      rawCells.push(tableLines[i].split('|').map(function (s) {
        return s.trim();
      }));
    }

    if (rawHeaders.length < rawStyles.length) {
      return rawTable;
    }

    for (i = 0; i < rawStyles.length; ++i) {
      styles.push(parseStyles(rawStyles[i]));
    }

    for (i = 0; i < rawHeaders.length; ++i) {
      if (showdown.helper.isUndefined(styles[i])) {
        styles[i] = '';
      }
      headers.push(parseHeaders(rawHeaders[i], styles[i]));
    }

    for (i = 0; i < rawCells.length; ++i) {
      var row = [];
      for (var ii = 0; ii < headers.length; ++ii) {
        if (showdown.helper.isUndefined(rawCells[i][ii])) {}
        row.push(parseCells(rawCells[i][ii], styles[ii]));
      }
      cells.push(row);
    }

    return buildTable(headers, cells);
  });

  text = globals.converter._dispatch('tables.after', text, options, globals);

  return text;
});

/**
 * Swap back in all the special characters we've hidden.
 */
showdown.subParser('unescapeSpecialChars', function (text) {
  'use strict';

  text = text.replace(/~E(\d+)E/g, function (wholeMatch, m1) {
    var charCodeToReplace = parseInt(m1);
    return String.fromCharCode(charCodeToReplace);
  });
  return text;
});

module.exports = {
  showdown: showdown,
  subParser: wxShowdown
}; 
 			}); 
		define("wxParse/wxDiscode.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

// HTML 支持的数学符号
function strNumDiscode(str) {
    str = str.replace(/&forall;/g, '∀');
    str = str.replace(/&part;/g, '∂');
    str = str.replace(/&exists;/g, '∃');
    str = str.replace(/&empty;/g, '∅');
    str = str.replace(/&nabla;/g, '∇');
    str = str.replace(/&isin;/g, '∈');
    str = str.replace(/&notin;/g, '∉');
    str = str.replace(/&ni;/g, '∋');
    str = str.replace(/&prod;/g, '∏');
    str = str.replace(/&sum;/g, '∑');
    str = str.replace(/&minus;/g, '−');
    str = str.replace(/&lowast;/g, '∗');
    str = str.replace(/&radic;/g, '√');
    str = str.replace(/&prop;/g, '∝');
    str = str.replace(/&infin;/g, '∞');
    str = str.replace(/&ang;/g, '∠');
    str = str.replace(/&and;/g, '∧');
    str = str.replace(/&or;/g, '∨');
    str = str.replace(/&cap;/g, '∩');
    str = str.replace(/&cap;/g, '∪');
    str = str.replace(/&int;/g, '∫');
    str = str.replace(/&there4;/g, '∴');
    str = str.replace(/&sim;/g, '∼');
    str = str.replace(/&cong;/g, '≅');
    str = str.replace(/&asymp;/g, '≈');
    str = str.replace(/&ne;/g, '≠');
    str = str.replace(/&le;/g, '≤');
    str = str.replace(/&ge;/g, '≥');
    str = str.replace(/&sub;/g, '⊂');
    str = str.replace(/&sup;/g, '⊃');
    str = str.replace(/&nsub;/g, '⊄');
    str = str.replace(/&sube;/g, '⊆');
    str = str.replace(/&supe;/g, '⊇');
    str = str.replace(/&oplus;/g, '⊕');
    str = str.replace(/&otimes;/g, '⊗');
    str = str.replace(/&perp;/g, '⊥');
    str = str.replace(/&sdot;/g, '⋅');
    return str;
}

//HTML 支持的希腊字母
function strGreeceDiscode(str) {
    str = str.replace(/&Alpha;/g, 'Α');
    str = str.replace(/&Beta;/g, 'Β');
    str = str.replace(/&Gamma;/g, 'Γ');
    str = str.replace(/&Delta;/g, 'Δ');
    str = str.replace(/&Epsilon;/g, 'Ε');
    str = str.replace(/&Zeta;/g, 'Ζ');
    str = str.replace(/&Eta;/g, 'Η');
    str = str.replace(/&Theta;/g, 'Θ');
    str = str.replace(/&Iota;/g, 'Ι');
    str = str.replace(/&Kappa;/g, 'Κ');
    str = str.replace(/&Lambda;/g, 'Λ');
    str = str.replace(/&Mu;/g, 'Μ');
    str = str.replace(/&Nu;/g, 'Ν');
    str = str.replace(/&Xi;/g, 'Ν');
    str = str.replace(/&Omicron;/g, 'Ο');
    str = str.replace(/&Pi;/g, 'Π');
    str = str.replace(/&Rho;/g, 'Ρ');
    str = str.replace(/&Sigma;/g, 'Σ');
    str = str.replace(/&Tau;/g, 'Τ');
    str = str.replace(/&Upsilon;/g, 'Υ');
    str = str.replace(/&Phi;/g, 'Φ');
    str = str.replace(/&Chi;/g, 'Χ');
    str = str.replace(/&Psi;/g, 'Ψ');
    str = str.replace(/&Omega;/g, 'Ω');

    str = str.replace(/&alpha;/g, 'α');
    str = str.replace(/&beta;/g, 'β');
    str = str.replace(/&gamma;/g, 'γ');
    str = str.replace(/&delta;/g, 'δ');
    str = str.replace(/&epsilon;/g, 'ε');
    str = str.replace(/&zeta;/g, 'ζ');
    str = str.replace(/&eta;/g, 'η');
    str = str.replace(/&theta;/g, 'θ');
    str = str.replace(/&iota;/g, 'ι');
    str = str.replace(/&kappa;/g, 'κ');
    str = str.replace(/&lambda;/g, 'λ');
    str = str.replace(/&mu;/g, 'μ');
    str = str.replace(/&nu;/g, 'ν');
    str = str.replace(/&xi;/g, 'ξ');
    str = str.replace(/&omicron;/g, 'ο');
    str = str.replace(/&pi;/g, 'π');
    str = str.replace(/&rho;/g, 'ρ');
    str = str.replace(/&sigmaf;/g, 'ς');
    str = str.replace(/&sigma;/g, 'σ');
    str = str.replace(/&tau;/g, 'τ');
    str = str.replace(/&upsilon;/g, 'υ');
    str = str.replace(/&phi;/g, 'φ');
    str = str.replace(/&chi;/g, 'χ');
    str = str.replace(/&psi;/g, 'ψ');
    str = str.replace(/&omega;/g, 'ω');
    str = str.replace(/&thetasym;/g, 'ϑ');
    str = str.replace(/&upsih;/g, 'ϒ');
    str = str.replace(/&piv;/g, 'ϖ');
    str = str.replace(/&middot;/g, '·');
    return str;
}

// 

function strcharacterDiscode(str) {
    // 加入常用解析
    str = str.replace(/&nbsp;/g, ' ');
    str = str.replace(/&quot;/g, "'");
    str = str.replace(/&amp;/g, '&');
    // str = str.replace(/&lt;/g, '‹');
    // str = str.replace(/&gt;/g, '›');

    str = str.replace(/&lt;/g, '<');
    str = str.replace(/&gt;/g, '>');
    str = str.replace(/&#8226;/g, '•');

    return str;
}

// HTML 支持的其他实体
function strOtherDiscode(str) {
    str = str.replace(/&OElig;/g, 'Œ');
    str = str.replace(/&oelig;/g, 'œ');
    str = str.replace(/&Scaron;/g, 'Š');
    str = str.replace(/&scaron;/g, 'š');
    str = str.replace(/&Yuml;/g, 'Ÿ');
    str = str.replace(/&fnof;/g, 'ƒ');
    str = str.replace(/&circ;/g, 'ˆ');
    str = str.replace(/&tilde;/g, '˜');
    str = str.replace(/&ensp;/g, '');
    str = str.replace(/&emsp;/g, '');
    str = str.replace(/&thinsp;/g, '');
    str = str.replace(/&zwnj;/g, '');
    str = str.replace(/&zwj;/g, '');
    str = str.replace(/&lrm;/g, '');
    str = str.replace(/&rlm;/g, '');
    str = str.replace(/&ndash;/g, '–');
    str = str.replace(/&mdash;/g, '—');
    str = str.replace(/&lsquo;/g, '‘');
    str = str.replace(/&rsquo;/g, '’');
    str = str.replace(/&sbquo;/g, '‚');
    str = str.replace(/&ldquo;/g, '“');
    str = str.replace(/&rdquo;/g, '”');
    str = str.replace(/&bdquo;/g, '„');
    str = str.replace(/&dagger;/g, '†');
    str = str.replace(/&Dagger;/g, '‡');
    str = str.replace(/&bull;/g, '•');
    str = str.replace(/&hellip;/g, '…');
    str = str.replace(/&permil;/g, '‰');
    str = str.replace(/&prime;/g, '′');
    str = str.replace(/&Prime;/g, '″');
    str = str.replace(/&lsaquo;/g, '‹');
    str = str.replace(/&rsaquo;/g, '›');
    str = str.replace(/&oline;/g, '‾');
    str = str.replace(/&euro;/g, '€');
    str = str.replace(/&trade;/g, '™');

    str = str.replace(/&larr;/g, '←');
    str = str.replace(/&uarr;/g, '↑');
    str = str.replace(/&rarr;/g, '→');
    str = str.replace(/&darr;/g, '↓');
    str = str.replace(/&harr;/g, '↔');
    str = str.replace(/&crarr;/g, '↵');
    str = str.replace(/&lceil;/g, '⌈');
    str = str.replace(/&rceil;/g, '⌉');

    str = str.replace(/&lfloor;/g, '⌊');
    str = str.replace(/&rfloor;/g, '⌋');
    str = str.replace(/&loz;/g, '◊');
    str = str.replace(/&spades;/g, '♠');
    str = str.replace(/&clubs;/g, '♣');
    str = str.replace(/&hearts;/g, '♥');

    str = str.replace(/&diams;/g, '♦');
    str = str.replace(/&#39;/g, '\'');
    return str;
}

function strMoreDiscode(str) {
    str = str.replace(/\r\n/g, "");
    str = str.replace(/\n/g, "");

    str = str.replace(/code/g, "wxxxcode-style");
    return str;
}

function strDiscode(str) {
    str = strNumDiscode(str);
    str = strGreeceDiscode(str);
    str = strcharacterDiscode(str);
    str = strOtherDiscode(str);
    str = strMoreDiscode(str);
    return str;
}
function urlToHttpUrl(url, rep) {

    var patt1 = new RegExp("^//");
    var result = patt1.test(url);
    if (result) {
        url = rep + ":" + url;
    }
    return url;
}

module.exports = {
    strDiscode: strDiscode,
    urlToHttpUrl: urlToHttpUrl
}; 
 			}); 
		define("wxParse/wxParse.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var _showdown = require('./showdown.js');

var _showdown2 = _interopRequireDefault(_showdown);

var _html2json = require('./html2json.js');

var _html2json2 = _interopRequireDefault(_html2json);

function _interopRequireDefault(obj) { return obj && obj.__esModule ? obj : { default: obj }; }

function _defineProperty(obj, key, value) { if (key in obj) { Object.defineProperty(obj, key, { value: value, enumerable: true, configurable: true, writable: true }); } else { obj[key] = value; } return obj; } /**
                                                                                                                                                                                                                   * author: Di (微信小程序开发工程师)
                                                                                                                                                                                                                   * organization: WeAppDev(微信小程序开发论坛)(http://weappdev.com)
                                                                                                                                                                                                                   *               垂直微信小程序开发交流社区
                                                                                                                                                                                                                   * 
                                                                                                                                                                                                                   * github地址: https://github.com/icindy/wxParse
                                                                                                                                                                                                                   * 
                                                                                                                                                                                                                   * for: 微信小程序富文本解析
                                                                                                                                                                                                                   * detail : http://weappdev.com/t/wxparse-alpha0-1-html-markdown/184
                                                                                                                                                                                                                   */

/**
 * utils函数引入
 **/


/**
 * 配置及公有属性
 **/
var realWindowWidth = 0;
var realWindowHeight = 0;
wx.getSystemInfo({
  success: function success(res) {
    realWindowWidth = res.windowWidth;
    realWindowHeight = res.windowHeight;
  }
});
/**
 * 主函数入口区
 **/
function wxParse() {
  var bindName = arguments.length > 0 && arguments[0] !== undefined ? arguments[0] : 'wxParseData';
  var type = arguments.length > 1 && arguments[1] !== undefined ? arguments[1] : 'html';
  var data = arguments.length > 2 && arguments[2] !== undefined ? arguments[2] : '<div class="color:red;">数据不能为空</div>';
  var target = arguments[3];
  var imagePadding = arguments[4];

  var that = target;
  var transData = {}; //存放转化后的数据
  if (type == 'html') {
    transData = _html2json2.default.html2json(data, bindName);
    //console.log(JSON.stringify(transData, ' ', ' '));
  } else if (type == 'md' || type == 'markdown') {
    var converter = new _showdown2.default.Converter();
    var html = converter.makeHtml(data);
    transData = _html2json2.default.html2json(html, bindName);
    //console.log(JSON.stringify(transData, ' ', ' '));
  }
  transData.view = {};
  transData.view.imagePadding = 0;
  if (typeof imagePadding != 'undefined') {
    transData.view.imagePadding = imagePadding;
  }
  var bindData = {};
  bindData[bindName] = transData;
  that.setData(bindData);
  that.wxParseImgLoad = wxParseImgLoad;
  that.wxParseImgTap = wxParseImgTap;
}
// 图片点击事件
function wxParseImgTap(e) {
  var that = this;
  var nowImgUrl = e.target.dataset.src;
  var tagFrom = e.target.dataset.from;
  if (typeof tagFrom != 'undefined' && tagFrom.length > 0) {
    wx.previewImage({
      current: nowImgUrl, // 当前显示图片的http链接
      urls: that.data[tagFrom].imageUrls // 需要预览的图片http链接列表
    });
  }
}

/**
 * 图片视觉宽高计算函数区 
 **/
function wxParseImgLoad(e) {
  var that = this;
  var tagFrom = e.target.dataset.from;
  var idx = e.target.dataset.idx;
  if (typeof tagFrom != 'undefined' && tagFrom.length > 0) {
    calMoreImageInfo(e, idx, that, tagFrom);
  }
}
// 假循环获取计算图片视觉最佳宽高
function calMoreImageInfo(e, idx, that, bindName) {
  var _that$setData;

  var temData = that.data[bindName];
  if (!temData || temData.images.length == 0) {
    return;
  }
  var temImages = temData.images;
  //因为无法获取view宽度 需要自定义padding进行计算，稍后处理
  var recal = wxAutoImageCal(e.detail.width, e.detail.height, that, bindName);
  // temImages[idx].width = recal.imageWidth;
  // temImages[idx].height = recal.imageheight; 
  // temData.images = temImages;
  // var bindData = {};
  // bindData[bindName] = temData;
  // that.setData(bindData);
  var index = temImages[idx].index;
  var key = '' + bindName;
  var _iteratorNormalCompletion = true;
  var _didIteratorError = false;
  var _iteratorError = undefined;

  try {
    for (var _iterator = index.split('.')[Symbol.iterator](), _step; !(_iteratorNormalCompletion = (_step = _iterator.next()).done); _iteratorNormalCompletion = true) {
      var i = _step.value;
      key += '.nodes[' + i + ']';
    }
  } catch (err) {
    _didIteratorError = true;
    _iteratorError = err;
  } finally {
    try {
      if (!_iteratorNormalCompletion && _iterator.return) {
        _iterator.return();
      }
    } finally {
      if (_didIteratorError) {
        throw _iteratorError;
      }
    }
  }

  var keyW = key + '.width';
  var keyH = key + '.height';
  that.setData((_that$setData = {}, _defineProperty(_that$setData, keyW, recal.imageWidth), _defineProperty(_that$setData, keyH, recal.imageheight), _that$setData));
}
// 计算视觉优先的图片宽高
function wxAutoImageCal(originalWidth, originalHeight, that, bindName) {
  //获取图片的原始长宽
  var windowWidth = 0,
      windowHeight = 0;
  var autoWidth = 0,
      autoHeight = 0;
  var results = {};
  var padding = that.data[bindName].view.imagePadding;
  windowWidth = realWindowWidth - 2 * padding;
  windowHeight = realWindowHeight;
  //判断按照那种方式进行缩放
  // console.log("windowWidth" + windowWidth);
  if (originalWidth > windowWidth) {
    //在图片width大于手机屏幕width时候
    autoWidth = windowWidth;
    // console.log("autoWidth" + autoWidth);
    autoHeight = autoWidth * originalHeight / originalWidth;
    // console.log("autoHeight" + autoHeight);
    results.imageWidth = autoWidth;
    results.imageheight = autoHeight;
  } else {
    //否则展示原来的数据
    results.imageWidth = originalWidth;
    results.imageheight = originalHeight;
  }
  return results;
}

function wxParseTemArray(temArrayName, bindNameReg, total, that) {
  var array = [];
  var temData = that.data;
  var obj = null;
  for (var i = 0; i < total; i++) {
    var simArr = temData[bindNameReg + i].nodes;
    array.push(simArr);
  }

  temArrayName = temArrayName || 'wxParseTemArray';
  obj = JSON.parse('{"' + temArrayName + '":""}');
  obj[temArrayName] = array;
  that.setData(obj);
}

/**
 * 配置emojis
 * 
 */

function emojisInit() {
  var reg = arguments.length > 0 && arguments[0] !== undefined ? arguments[0] : '';
  var baseSrc = arguments.length > 1 && arguments[1] !== undefined ? arguments[1] : "/wxParse/emojis/";
  var emojis = arguments[2];

  _html2json2.default.emojisInit(reg, baseSrc, emojis);
}
module.exports = {
  wxParse: wxParse,
  html2json: _html2json2.default
}; 
 			}); 
		define("app.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x261c = ['\x74\x6f\x6b\x65\x6e', '\x75\x69\x64', '\x4a\x79\x4f\x4c\x52', '\x57\x4f\x76\x63\x59', '\x73\x65\x74\x53\x74\x6f\x72\x61\x67\x65\x53\x79\x6e\x63', '\x63\x67\x53\x73\x56', '\x76\x61\x6c\x75\x65', '\x42\x63\x6a\x79\x4a', '\x67\x6f\x6f\x64\x52\x65\x70\x75\x74\x61\x74\x69\x6f\x6e', '\x65\x4e\x71\x4f\x43', '\x48\x53\x65\x6f\x44', '\x65\x74\x54\x6b\x6a', '\x70\x62\x6b\x43\x77', '\x6f\x72\x64\x65\x72\x5f\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e\x5f\x73\x63\x6f\x72\x65', '\x73\x63\x6f\x72\x65', '\x6f\x41\x77\x48\x45', '\x64\x6c\x46\x6c\x43', '\x64\x52\x63\x51\x69', '\x61\x70\x70\x6c\x69\x63\x61\x74\x69\x6f\x6e\x2f\x78\x2d\x77\x77\x77\x2d\x66\x6f\x72\x6d\x2d\x75\x72\x6c\x65\x6e\x63\x6f\x64\x65\x64', '\x52\x6a\x71\x44\x78', '\x74\x56\x79\x45\x71', '\x69\x6e\x73\x75\x74', '\x41\x57\x71\x76\x51', '\x62\x75\x61\x55\x4a', '\x76\x6c\x42\x59\x4c', '\x6c\x6f\x67\x69\x6e', '\x63\x6f\x6e\x66\x69\x67\x2e\x6a\x73', '\x73\x69\x74\x65\x49\x6e\x66\x6f', '\x75\x72\x6c', '\x50\x57\x63\x51\x7a', '\x44\x72\x73\x4d\x65', '\x2f\x75\x73\x65\x72\x2f\x63\x68\x65\x63\x6b\x2d\x74\x6f\x6b\x65\x6e', '\x52\x58\x70\x54\x4d', '\x6e\x4e\x6d\x41\x74', '\x6a\x56\x6d\x65\x41', '\x6c\x41\x66\x47\x73', '\x56\x64\x4f\x69\x67', '\x71\x76\x4c\x6e\x65', '\x75\x73\x69\x6e\x66\x6f', '\x66\x6d\x6f\x65\x52', '\x71\x68\x6b\x54\x47', '\x6f\x72\x64\x65\x72', '\x65\x41\x56\x49\x67', '\x7a\x49\x67\x75\x4c', '\x48\x6f\x71\x6f\x6d', '\x53\x49\x56\x53\x5a', '\x65\x50\x4a\x62\x63', '\x4d\x51\x75\x6b\x44', '\x53\x4e\x67\x6a\x47', '\u65E0\u6CD5\u767B\u5F55\uFF0C\u8BF7\u91CD\u8BD5', '\x2f\x75\x73\x65\x72\x2f\x77\x78\x61\x70\x70\x2f\x6c\x6f\x67\x69\x6e', '\x70\x59\x79\x43\x66', '\x63\x70\x66\x58\x7a', '\x67\x56\x42\x4b\x58', '\x6d\x61\x6c\x6c\x4e\x61\x6d\x65', '\x2f\x74\x65\x6d\x70\x6c\x61\x74\x65\x2d\x6d\x73\x67\x2f\x70\x75\x74', '\x50\x4f\x53\x54', '\x69\x6d\x6d\x65\x64\x69\x61\x74\x65\x6c\x79', '\x79\x77\x4d\x69\x73', '\x4c\x42\x50\x6b\x72', '\x67\x73\x6c\x44\x78', '\x72\x6f\x55\x5a\x79', '\x2f\x63\x6f\x6e\x66\x69\x67\x2f\x67\x65\x74\x2d\x76\x61\x6c\x75\x65', '\x2f\x73\x63\x6f\x72\x65\x2f\x73\x65\x6e\x64\x2f\x72\x75\x6c\x65', '\x72\x65\x63\x68\x61\x72\x67\x65\x5f\x61\x6d\x6f\x75\x6e\x74\x5f\x6d\x69\x6e', '\x75\x72\x6c\x73', '\x4d\x4b\x56\x64\x47', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x47\x62\x76\x51\x64', '\x64\x54\x58\x42\x46', '\x6b\x57\x50\x7a\x56', '\x71\x4b\x57\x57\x66', '\x63\x79\x7a\x64\x4b', '\x7a\x58\x74\x76\x45', '\x72\x65\x71\x75\x65\x73\x74', '\x4f\x53\x7a\x59\x51', '\x7a\x61\x4c\x6d\x51', '\x66\x4d\x45\x71\x45', '\x64\x61\x74\x61', '\x63\x6f\x64\x65', '\x71\x6b\x45\x6d\x46', '\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c', '\x4e\x53\x79\x49\x57'];(function (_0x32e581, _0x113210) {
  var _0x53bee9 = function _0x53bee9(_0x5ef42b) {
    while (--_0x5ef42b) {
      _0x32e581['push'](_0x32e581['shift']());
    }
  };_0x53bee9(++_0x113210);
})(wanzikun_0x261c, 0x17d);var wanzikun_0x4aaa = function wanzikun_0x4aaa(_0x63dcb9, _0xb9b9bf) {
  _0x63dcb9 = _0x63dcb9 - 0x0;var _0xd047c = wanzikun_0x261c[_0x63dcb9];return _0xd047c;
};App({ '\x6f\x6e\x4c\x61\x75\x6e\x63\x68': function onLaunch() {
    var _0x48ab92 = { '\x64\x54\x58\x42\x46': function dTXBF(_0x1183ee, _0x27247b) {
        return _0x1183ee != _0x27247b;
      }, '\x6b\x57\x50\x7a\x56': wanzikun_0x4aaa('0x0'), '\x71\x4b\x57\x57\x66': wanzikun_0x4aaa('0x1'), '\x63\x79\x7a\x64\x4b': wanzikun_0x4aaa('0x2'), '\x7a\x58\x74\x76\x45': '\x6b\x41\x45\x6b\x73', '\x4a\x79\x4f\x4c\x52': wanzikun_0x4aaa('0x3'), '\x57\x4f\x76\x63\x59': wanzikun_0x4aaa('0x4'), '\x63\x67\x53\x73\x56': wanzikun_0x4aaa('0x5'), '\x6f\x41\x77\x48\x45': function oAwHE(_0x24afcf, _0x2145c1) {
        return _0x24afcf == _0x2145c1;
      }, '\x64\x6c\x46\x6c\x43': wanzikun_0x4aaa('0x6'), '\x64\x52\x63\x51\x69': wanzikun_0x4aaa('0x7'), '\x52\x6a\x71\x44\x78': wanzikun_0x4aaa('0x8'), '\x65\x4e\x71\x4f\x43': wanzikun_0x4aaa('0x9'), '\x48\x53\x65\x6f\x44': function HSeoD(_0x562488, _0x2510ad) {
        return _0x562488 !== _0x2510ad;
      }, '\x65\x74\x54\x6b\x6a': wanzikun_0x4aaa('0xa'), '\x70\x62\x6b\x43\x77': wanzikun_0x4aaa('0xb'), '\x41\x57\x71\x76\x51': function AWqvQ(_0x42b14e, _0x2c8f9e) {
        return _0x42b14e === _0x2c8f9e;
      }, '\x62\x75\x61\x55\x4a': wanzikun_0x4aaa('0xc'), '\x4d\x4b\x56\x64\x47': function MKVdG(_0x2ddcb4, _0x4fbaf1) {
        return _0x2ddcb4 + _0x4fbaf1;
      }, '\x47\x62\x76\x51\x64': wanzikun_0x4aaa('0xd'), '\x42\x63\x6a\x79\x4a': wanzikun_0x4aaa('0xe'), '\x74\x56\x79\x45\x71': function tVyEq(_0x5bea0d, _0x3cbf93) {
        return _0x5bea0d + _0x3cbf93;
      }, '\x69\x6e\x73\x75\x74': wanzikun_0x4aaa('0xf') };var _0x373806 = this;_0x373806[wanzikun_0x4aaa('0x10')]();wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x48ab92[wanzikun_0x4aaa('0x11')](_0x373806[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x10')], _0x48ab92[wanzikun_0x4aaa('0x13')]), '\x64\x61\x74\x61': { '\x6b\x65\x79': _0x48ab92['\x63\x67\x53\x73\x56'] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x236ccf) {
        var _0x57ac37 = { '\x66\x4d\x45\x71\x45': function fMEqE(_0x3b83a5, _0x4829e8) {
            return _0x3b83a5 == _0x4829e8;
          }, '\x71\x6b\x45\x6d\x46': function qkEmF(_0xac671b, _0x47af88) {
            return _0x48ab92[wanzikun_0x4aaa('0x14')](_0xac671b, _0x47af88);
          }, '\x4e\x53\x79\x49\x57': _0x48ab92[wanzikun_0x4aaa('0x15')], '\x4f\x53\x7a\x59\x51': function OSzYQ(_0x3a7f99, _0x386c7b) {
            return _0x3a7f99 + _0x386c7b;
          }, '\x7a\x61\x4c\x6d\x51': _0x48ab92[wanzikun_0x4aaa('0x16')] };if (_0x48ab92[wanzikun_0x4aaa('0x17')] === _0x48ab92[wanzikun_0x4aaa('0x18')]) {
          wx[wanzikun_0x4aaa('0x19')]({ '\x75\x72\x6c': _0x57ac37[wanzikun_0x4aaa('0x1a')](_0x373806[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x10')], _0x57ac37[wanzikun_0x4aaa('0x1b')]), '\x64\x61\x74\x61': { '\x63\x6f\x64\x65': _0x236ccf['\x63\x6f\x64\x65'] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x1a83b5) {
              if (_0x57ac37[wanzikun_0x4aaa('0x1c')](_0x1a83b5[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1e')], 0x2710)) {
                _0x373806['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61']['\x75\x73\x69\x6e\x66\x6f'] = 0x0;return;
              }if (_0x57ac37[wanzikun_0x4aaa('0x1f')](_0x1a83b5[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1e')], 0x0)) {
                wx['\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67']();wx[wanzikun_0x4aaa('0x20')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x57ac37[wanzikun_0x4aaa('0x21')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
              }_0x373806['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61']['\x74\x6f\x6b\x65\x6e'] = _0x1a83b5[wanzikun_0x4aaa('0x1d')]['\x64\x61\x74\x61'][wanzikun_0x4aaa('0x22')];_0x373806[wanzikun_0x4aaa('0x12')]['\x75\x69\x64'] = _0x1a83b5[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x23')];
            } });
        } else {
          if (_0x236ccf[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1e')] == 0x0) {
            if (_0x48ab92[wanzikun_0x4aaa('0x24')] === _0x48ab92[wanzikun_0x4aaa('0x25')]) {
              _0x373806['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61']['\x75\x73\x69\x6e\x66\x6f'] = 0x0;return;
            } else {
              wx[wanzikun_0x4aaa('0x26')](_0x48ab92[wanzikun_0x4aaa('0x27')], _0x236ccf[wanzikun_0x4aaa('0x1d')]['\x64\x61\x74\x61'][wanzikun_0x4aaa('0x28')]);
            }
          }
        }
      } });wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x48ab92['\x4d\x4b\x56\x64\x47'](_0x373806[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x10')], _0x48ab92[wanzikun_0x4aaa('0x29')]), '\x64\x61\x74\x61': { '\x63\x6f\x64\x65': wanzikun_0x4aaa('0x2a') }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x92a1c0) {
        if (_0x48ab92['\x65\x4e\x71\x4f\x43'] === _0x48ab92[wanzikun_0x4aaa('0x2b')]) {
          if (_0x92a1c0[wanzikun_0x4aaa('0x1d')]['\x63\x6f\x64\x65'] == 0x0) {
            if (_0x48ab92[wanzikun_0x4aaa('0x2c')](_0x48ab92[wanzikun_0x4aaa('0x2d')], _0x48ab92[wanzikun_0x4aaa('0x2e')])) {
              _0x373806[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x2f')] = _0x92a1c0[wanzikun_0x4aaa('0x1d')]['\x64\x61\x74\x61'][0x0][wanzikun_0x4aaa('0x30')];
            } else {
              if (_0x48ab92[wanzikun_0x4aaa('0x31')](_0x92a1c0[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1e')], 0x0)) {
                _0x373806['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x4aaa('0xf')] = _0x92a1c0['\x64\x61\x74\x61']['\x64\x61\x74\x61']['\x76\x61\x6c\x75\x65'];
              }
            }
          }
        } else {
          var _0x3a324d = this;wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x3a324d[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x10')] + _0x48ab92[wanzikun_0x4aaa('0x32')], '\x6d\x65\x74\x68\x6f\x64': _0x48ab92[wanzikun_0x4aaa('0x33')], '\x68\x65\x61\x64\x65\x72': { 'content-type': wanzikun_0x4aaa('0x34') }, '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': _0x3a324d[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x22')], '\x74\x79\x70\x65': 0x0, '\x6d\x6f\x64\x75\x6c\x65': _0x48ab92[wanzikun_0x4aaa('0x35')], '\x74\x65\x6d\x70\x6c\x61\x74\x65\x5f\x69\x64': template_id, '\x66\x6f\x72\x6d\x5f\x69\x64': form_id, '\x75\x72\x6c': page, '\x70\x6f\x73\x74\x4a\x73\x6f\x6e\x53\x74\x72\x69\x6e\x67': postJsonString }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x503f22) {} });
        }
      } });wx[wanzikun_0x4aaa('0x19')]({ '\x75\x72\x6c': _0x48ab92[wanzikun_0x4aaa('0x36')](_0x373806[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x10')], _0x48ab92[wanzikun_0x4aaa('0x13')]), '\x64\x61\x74\x61': { '\x6b\x65\x79': _0x48ab92[wanzikun_0x4aaa('0x37')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x311f13) {
        if (_0x48ab92[wanzikun_0x4aaa('0x31')](_0x311f13['\x64\x61\x74\x61'][wanzikun_0x4aaa('0x1e')], 0x0)) {
          if (_0x48ab92[wanzikun_0x4aaa('0x38')](_0x48ab92[wanzikun_0x4aaa('0x39')], wanzikun_0x4aaa('0x3a'))) {
            if (_0x311f13[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1e')] != 0x0) {
              _0x373806[wanzikun_0x4aaa('0x12')]['\x74\x6f\x6b\x65\x6e'] = null;_0x373806['\x6c\x6f\x67\x69\x6e']();
            }
          } else {
            _0x373806[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0xf')] = _0x311f13[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x28')];
          }
        }
      } });this[wanzikun_0x4aaa('0x3b')]();
  }, '\x73\x69\x74\x65\x49\x6e\x66\x6f': require(wanzikun_0x4aaa('0x3c')), '\x75\x72\x6c\x73': function urls() {
    var _0xdcb80a = { '\x5a\x58\x6b\x77\x6b': function ZXkwk(_0x7803a, _0x3e2078) {
        return _0x7803a + _0x3e2078;
      } };var _0x2107ad = this;_0x2107ad['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x4aaa('0x10')] = _0xdcb80a['\x5a\x58\x6b\x77\x6b'](_0x2107ad[wanzikun_0x4aaa('0x3d')][wanzikun_0x4aaa('0x3e')], _0x2107ad[wanzikun_0x4aaa('0x3d')]['\x73\x75\x62\x44\x6f\x6d\x61\x69\x6e']);
  }, '\x6c\x6f\x67\x69\x6e': function login() {
    var _0x421722 = { '\x52\x58\x70\x54\x4d': function RXpTM(_0x499435, _0x4274f7) {
        return _0x499435 != _0x4274f7;
      }, '\x56\x64\x4f\x69\x67': function VdOig(_0x116b8c, _0x3ae1e1) {
        return _0x116b8c !== _0x3ae1e1;
      }, '\x72\x46\x67\x63\x57': wanzikun_0x4aaa('0x3f'), '\x71\x68\x6b\x54\x47': '\u65E0\u6CD5\u767B\u5F55\uFF0C\u8BF7\u91CD\u8BD5', '\x6e\x4e\x6d\x41\x74': function nNmAt(_0x3df66b, _0x2d348a) {
        return _0x3df66b == _0x2d348a;
      }, '\x6a\x56\x6d\x65\x41': function jVmeA(_0x3bc6d8, _0x53a723) {
        return _0x3bc6d8 + _0x53a723;
      }, '\x6c\x41\x66\x47\x73': wanzikun_0x4aaa('0x1'), '\x44\x72\x73\x4d\x65': function DrsMe(_0x36856d, _0xa65ed) {
        return _0x36856d + _0xa65ed;
      } };var _0x2cee94 = this;var _0x129af1 = _0x2cee94[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x22')];if (_0x129af1) {
      wx[wanzikun_0x4aaa('0x19')]({ '\x75\x72\x6c': _0x421722[wanzikun_0x4aaa('0x40')](_0x2cee94['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x4aaa('0x10')], wanzikun_0x4aaa('0x41')), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': _0x129af1 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3bce47) {
          if (_0x421722[wanzikun_0x4aaa('0x42')](_0x3bce47[wanzikun_0x4aaa('0x1d')]['\x63\x6f\x64\x65'], 0x0)) {
            _0x2cee94['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x4aaa('0x22')] = null;_0x2cee94[wanzikun_0x4aaa('0x3b')]();
          }
        } });return;
    }wx[wanzikun_0x4aaa('0x3b')]({ '\x73\x75\x63\x63\x65\x73\x73': function success(_0x1c0f81) {
        var _0x23c351 = { '\x66\x6d\x6f\x65\x52': function fmoeR(_0x113b3e, _0x254f2e) {
            return _0x421722[wanzikun_0x4aaa('0x43')](_0x113b3e, _0x254f2e);
          } };wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x421722[wanzikun_0x4aaa('0x44')](_0x2cee94[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x10')], _0x421722[wanzikun_0x4aaa('0x45')]), '\x64\x61\x74\x61': { '\x63\x6f\x64\x65': _0x1c0f81['\x63\x6f\x64\x65'] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x1c0f81) {
            if (_0x1c0f81[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1e')] == 0x2710) {
              if (_0x421722[wanzikun_0x4aaa('0x46')](_0x421722['\x72\x46\x67\x63\x57'], wanzikun_0x4aaa('0x47'))) {
                _0x2cee94[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x48')] = 0x0;return;
              } else {
                if (_0x23c351[wanzikun_0x4aaa('0x49')](_0x1c0f81[wanzikun_0x4aaa('0x1d')]['\x63\x6f\x64\x65'], 0x0)) {
                  wx[wanzikun_0x4aaa('0x26')]('\x6d\x61\x6c\x6c\x4e\x61\x6d\x65', _0x1c0f81[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x28')]);
                }
              }
            }if (_0x1c0f81[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1e')] != 0x0) {
              wx['\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67']();wx['\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c']({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x421722[wanzikun_0x4aaa('0x4a')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
            }_0x2cee94['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x4aaa('0x22')] = _0x1c0f81[wanzikun_0x4aaa('0x1d')]['\x64\x61\x74\x61'][wanzikun_0x4aaa('0x22')];_0x2cee94[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x23')] = _0x1c0f81[wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x1d')][wanzikun_0x4aaa('0x23')];
          } });
      } });
  }, '\x73\x65\x6e\x64\x54\x65\x6d\x70\x6c\x65\x4d\x73\x67': function sendTempleMsg(_0x5ca1b1, _0x3beb91, _0x5d1d1, _0x21339c, _0x2417b7, _0x26f75a) {
    var _0x18f95d = { '\x65\x41\x56\x49\x67': wanzikun_0x4aaa('0x6'), '\x7a\x49\x67\x75\x4c': wanzikun_0x4aaa('0x7'), '\x68\x42\x50\x56\x64': wanzikun_0x4aaa('0x34'), '\x48\x6f\x71\x6f\x6d': wanzikun_0x4aaa('0x4b') };var _0x1623b8 = this;wx[wanzikun_0x4aaa('0x19')]({ '\x75\x72\x6c': _0x1623b8[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x10')] + _0x18f95d[wanzikun_0x4aaa('0x4c')], '\x6d\x65\x74\x68\x6f\x64': _0x18f95d[wanzikun_0x4aaa('0x4d')], '\x68\x65\x61\x64\x65\x72': { 'content-type': _0x18f95d['\x68\x42\x50\x56\x64'] }, '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': _0x1623b8[wanzikun_0x4aaa('0x12')]['\x74\x6f\x6b\x65\x6e'], '\x74\x79\x70\x65': 0x0, '\x6d\x6f\x64\x75\x6c\x65': _0x18f95d[wanzikun_0x4aaa('0x4e')], '\x62\x75\x73\x69\x6e\x65\x73\x73\x5f\x69\x64': _0x5ca1b1, '\x74\x72\x69\x67\x67\x65\x72': _0x3beb91, '\x74\x65\x6d\x70\x6c\x61\x74\x65\x5f\x69\x64': _0x5d1d1, '\x66\x6f\x72\x6d\x5f\x69\x64': _0x21339c, '\x75\x72\x6c': _0x2417b7, '\x70\x6f\x73\x74\x4a\x73\x6f\x6e\x53\x74\x72\x69\x6e\x67': _0x26f75a }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x784b14) {} });
  }, '\x73\x65\x6e\x64\x54\x65\x6d\x70\x6c\x65\x4d\x73\x67\x49\x6d\x6d\x65\x64\x69\x61\x74\x65\x6c\x79': function sendTempleMsgImmediately(_0x8a237, _0x2d01d5, _0xe43768, _0x4e27a3) {
    var _0x5520cf = { '\x53\x49\x56\x53\x5a': function SIVSZ(_0x118ee6, _0x197146) {
        return _0x118ee6 + _0x197146;
      }, '\x65\x50\x4a\x62\x63': wanzikun_0x4aaa('0x6'), '\x4d\x51\x75\x6b\x44': wanzikun_0x4aaa('0x34'), '\x53\x4e\x67\x6a\x47': wanzikun_0x4aaa('0x8') };var _0x288f1a = this;wx[wanzikun_0x4aaa('0x19')]({ '\x75\x72\x6c': _0x5520cf[wanzikun_0x4aaa('0x4f')](_0x288f1a[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x10')], _0x5520cf[wanzikun_0x4aaa('0x50')]), '\x6d\x65\x74\x68\x6f\x64': wanzikun_0x4aaa('0x7'), '\x68\x65\x61\x64\x65\x72': { 'content-type': _0x5520cf[wanzikun_0x4aaa('0x51')] }, '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': _0x288f1a[wanzikun_0x4aaa('0x12')][wanzikun_0x4aaa('0x22')], '\x74\x79\x70\x65': 0x0, '\x6d\x6f\x64\x75\x6c\x65': _0x5520cf[wanzikun_0x4aaa('0x52')], '\x74\x65\x6d\x70\x6c\x61\x74\x65\x5f\x69\x64': _0x8a237, '\x66\x6f\x72\x6d\x5f\x69\x64': _0x2d01d5, '\x75\x72\x6c': _0xe43768, '\x70\x6f\x73\x74\x4a\x73\x6f\x6e\x53\x74\x72\x69\x6e\x67': _0x4e27a3 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x36c501) {} });
  }, '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61': { '\x75\x73\x65\x72\x49\x6e\x66\x6f': null } }); 
 			}); 	require("app.js");
 		__wxRoute = 'pages/index/index';__wxRouteBegin = true; 	define("pages/index/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0xb7ff = ['\x67\x65\x74\x53\x79\x73\x74\x65\x6d\x49\x6e\x66\x6f', '\x73\x65\x74\x44\x61\x74\x61', '\x77\x69\x6e\x64\x6f\x77\x57\x69\x64\x74\x68', '\x77\x69\x6e\x64\x6f\x77\x48\x65\x69\x67\x68\x74', '\x72\x65\x71\x75\x65\x73\x74', '\x43\x6c\x4a\x64\x62', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x75\x72\x6c\x73', '\x4a\x54\x4e\x6c\x6d', '\x63\x6f\x64\x65', '\x64\x61\x74\x61', '\x72\x65\x76\x65\x72\x73\x65', '\x50\x47\x77\x56\x61', '\x6c\x52\x6c\x43\x75', '\x56\x42\x54\x72\x70', '\x63\x56\x43\x58\x78', '\x58\x59\x44\x49\x76', '\x72\x4c\x58\x78\x47', '\x74\x6f\x70\x6c\x6f\x67\x6f', '\x6b\x75\x48\x4b\x68', '\x71\x73\x76\x51\x68', '\x77\x51\x53\x52\x77', '\x70\x69\x63\x55\x72\x6c', '\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65\x53\x79\x6e\x63', '\x4e\x55\x76\x48\x45', '\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c', '\x70\x72\x6f\x70\x65\x72\x74\x69\x65\x73', '\x56\x51\x79\x59\x41', '\x73\x70\x6c\x69\x74', '\x63\x68\x69\x6c\x64\x73\x43\x75\x72\x47\x6f\x6f\x64\x73', '\x6e\x61\x6d\x65', '\x72\x6e\x70\x50\x47', '\x63\x56\x76\x61\x4c', '\x67\x65\x74\x67\x67', '\x57\x71\x53\x77\x57', '\x49\x69\x6c\x75\x67', '\x2f\x64\x69\x73\x63\x6f\x75\x6e\x74\x73\x2f\x66\x65\x74\x63\x68', '\x4b\x62\x5a\x79\x78', '\x6a\x46\x56\x6c\x75', '\x6f\x66\x66\x52\x44', '\x42\x52\x4c\x6e\x6b', '\x6b\x69\x59\x61\x6e', '\x72\x65\x6d\x61\x72\x6b', '\x74\x6f\x6b\x65\x6e', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x74\x4d\x75\x53\x5a', '\x64\x61\x74\x61\x73\x65\x74', '\x49\x5a\x63\x56\x67', '\x31\x7c\x32\x7c\x30\x7c\x34\x7c\x36\x7c\x35\x7c\x33', '\x66\x61\x76\x69\x63\x6f\x6e', '\x69\x55\x69\x4f\x6a', '\x6c\x65\x6e\x67\x74\x68', '\x70\x75\x73\x68', '\x73\x65\x74\x67\x6f\x6f\x64\x73', '\x73\x75\x63\x63\x65\x73\x73', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x64\x65\x74\x61\x69\x6c', '\x67\x6c\x77\x73\x65', '\x6c\x65\x48\x42\x6c', '\x79\x4a\x65\x65\x54', '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x2f\x6f\x72\x64\x65\x72\x2f\x73\x74\x61\x74\x69\x73\x74\x69\x63\x73', '\x75\x73\x69\x6e\x66\x6f', '\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65', '\x6e\x50\x73\x51\x65', '\x62\x57\x5a\x57\x77', '\x4c\x56\x55\x5a\x65', '\x73\x68\x6f\x70\x4e\x75\x6d', '\x63\x62\x4b\x67\x46', '\x73\x68\x6f\x77\x54\x6f\x61\x73\x74', '\u53D6\u6D88\u6536\u85CF', '\x4f\x53\x42\x6b\x51', '\x52\x75\x71\x67\x6a', '\x51\x4e\x76\x77\x6a', '\x68\x69\x64\x65\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74', '\x50\x4f\x4f\x42\x42', '\x74\x72\x47\x77\x71', '\x33\x7c\x35\x7c\x36\x7c\x32\x7c\x30\x7c\x34\x7c\x31', '\x53\x63\x67\x61\x72', '\x43\x64\x6b\x45\x5a', '\x78\x65\x79\x59\x78', '\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x70\x61\x79', '\x73\x68\x6f\x77\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74', '\u9886\u53D6\u6210\u529F', '\u5DF2\u7ECF\u9886\u53D6\u8FC7\u4E86', '\x46\x6e\x63\x55\x77', '\x44\x6a\x4e\x50\x64', '\x58\x4d\x4f\x73\x6d', '\x46\x62\x57\x4d\x6f', '\x6f\x48\x6c\x5a\x50', '\x67\x6a\x74\x50\x69', '\x70\x49\x65\x45\x4a', '\x77\x4f\x7a\x68\x55', '\x42\x52\x48\x75\x4f', '\x4e\x6c\x49\x41\x76', '\x67\x65\x74\x66\x61\x76', '\x56\x4d\x41\x65\x65', '\x68\x47\x4f\x61\x75', '\x42\x50\x46\x49\x62', '\x75\x71\x42\x62\x52', '\x2e\x2e\x2f\x2e\x2e\x2f\x69\x6d\x61\x67\x65\x73\x2f\x43\x6f\x75\x70\x6f\x6e\x73\x2d\x69\x63\x6f\x6e\x2d\x6f\x2e\x70\x6e\x67', '\x2e\x2e\x2f\x2e\x2e\x2f\x69\x6d\x61\x67\x65\x73\x2f\x43\x6f\x75\x70\x6f\x6e\x73\x2d\x69\x63\x6f\x6e\x2d\x66\x2e\x70\x6e\x67', '\x75\x56\x53\x6f\x43', '\x4a\x6f\x58\x57\x52', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x64\x6d\x76\x5a\x55', '\x4d\x59\x44\x66\x57', '\x73\x6d\x6b\x6a\x62', '\x67\x4e\x42\x64\x56', '\x53\x52\x70\x52\x69', '\x67\x59\x45\x54\x45', '\x6c\x69\x6f\x49\x6b', '\x4b\x73\x4f\x57\x57', '\x61\x72\x55\x67\x4f', '\x75\x45\x76\x44\x6c', '\x54\x79\x66\x63\x4d', '\x46\x72\x6b\x77\x47', '\x67\x6f\x6f\x64\x73\x49\x64', '\x4e\x46\x4a\x75\x64', '\x2e\x2e\x2f\x2e\x2e\x2f\x69\x6d\x61\x67\x65\x73\x2f\x43\x6f\x6f\x6c\x2d\x6c\x6f\x76\x65\x2d\x6f\x2e\x70\x6e\x67', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x66\x61\x76\x2f\x61\x64\x64', '\x75\x49\x50\x58\x42', '\x68\x41\x59\x6b\x4d', '\x70\x72\x69\x63\x65', '\x4d\x55\x5a\x4a\x4f', '\x73\x78\x55\x48\x54', '\x47\x62\x46\x56\x61', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x66\x61\x76\x2f\x64\x65\x6c\x65\x74\x65', '\x6e\x55\x75\x4c\x6e', '\x68\x5a\x62\x70\x52', '\x66\x64\x4b\x43\x63', '\x50\x6b\x69\x73\x6b', '\x55\x69\x6b\x6d\x6f', '\x2e\x2e\x2f\x2e\x2e\x2f\x69\x6d\x61\x67\x65\x73\x2f\x43\x6f\x6f\x6c\x2d\x6c\x6f\x76\x65\x2e\x70\x6e\x67', '\u52A0\u5165\u8D2D\u7269\u8F66\u6210\u529F', '\x62\x75\x6c\x69\x64\x53\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x73\x65\x74\x53\x74\x6f\x72\x61\x67\x65', '\x52\x76\x49\x6e\x74', '\x6e\x53\x41\x78\x72', '\x6e\x6f\x6e\x65', '\x4c\x73\x6a\x77\x53', '\x68\x68\x74\x63\x5a', '\x6f\x7a\x4c\x56\x69', '\x41\x64\x78\x66\x65', '\x73\x68\x6f\x70\x4c\x69\x73\x74', '\x6e\x79\x63\x62\x77', '\x68\x47\x72\x76\x4d', '\x67\x59\x64\x69\x6f', '\x62\x61\x73\x69\x63\x49\x6e\x66\x6f', '\x70\x69\x63', '\x79\x78\x76\x49\x66', '\u5FAE\u4FE1\u53F7\u5DF2\u590D\u5236', '\x7a\x55\x47\x45\x49', '\x63\x43\x4d\x7a\x6f', '\x59\x4b\x4e\x56\x63', '\x77\x46\x72\x4a\x49', '\x61\x74\x47\x6b\x61', '\x51\x79\x4a\x74\x67', '\x69\x6e\x7a\x69\x6f', '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73', '\x6c\x61\x62\x65\x6c', '\x6c\x65\x66\x74', '\x61\x63\x74\x69\x76\x65', '\x6e\x75\x6d\x62\x65\x72', '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x54\x79\x70\x65', '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x49\x64', '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73', '\x45\x52\x6f\x69\x61', '\x6d\x69\x6e\x50\x72\x69\x63\x65', '\x6f\x72\x69\x67\x69\x6e\x61\x6c\x50\x72\x69\x63\x65', '\x4f\x63\x54\x62\x66', '\x70\x72\x69\x63\x65\x73', '\x6a\x42\x52\x51\x69', '\x57\x50\x52\x41\x69', '\x44\x52\x53\x69\x43', '\x73\x45\x78\x41\x75', '\x6a\x59\x4d\x78\x69', '\x4c\x71\x4b\x4d\x75', '\x59\x49\x42\x61\x44', '\x50\x7a\x5a\x61\x54', '\x77\x65\x69\x67\x68\x74', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x70\x72\x69\x63\x65', '\u9700\u8981\u60A8\u7684\u6388\u6743\uFF0C\u624D\u80FD\u6B63\u5E38\u4F7F\u7528\u54E6\uFF5E', '\x32\x7c\x34\x7c\x31\x7c\x33\x7c\x30', '\x2f\x75\x73\x65\x72\x2f\x77\x78\x61\x70\x70\x2f\x72\x65\x67\x69\x73\x74\x65\x72\x2f\x63\x6f\x6d\x70\x6c\x65\x78', '\x64\x65\x74\x61\x69\x6c', '\x65\x6e\x63\x72\x79\x70\x74\x65\x64\x44\x61\x74\x61', '\x6c\x6f\x67\x69\x6e', '\x43\x41\x6c\x55\x50', '\x61\x55\x69\x51\x50', '\x67\x55\x71\x69\x6c', '\x57\x63\x4c\x75\x51', '\x65\x55\x76\x72\x41', '\x6e\x63\x53\x41\x63', '\u6388\u6743\u6210\u529F', '\x42\x57\x67\x66\x4f', '\x52\x4a\x4e\x4a\x42', '\x72\x6d\x53\x67\x52', '\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c', '\x46\x57\x46\x45\x73', '\x64\x59\x64\x6f\x69', '\x73\x68\x6f\x77\x54\x61\x62\x42\x61\x72', '\x56\x73\x63\x63\x45', '\x57\x54\x49\x78\x6b', '\x73\x69\x74\x65\x49\x6e\x66\x6f', '\x73\x68\x61\x72\x65\x50\x72\x6f\x66\x69\x6c\x65', '\x50\x54\x6f\x6b\x6c', '\x75\x52\x57\x47\x57', '\x46\x41\x6e\x49\x7a', '\x31\x7c\x32\x7c\x30\x7c\x35\x7c\x33\x7c\x34\x7c\x36', '\x65\x76\x74\x70\x63', '\x6d\x61\x6c\x6c\x4e\x61\x6d\x65', '\x2f\x70\x61\x67\x65\x73\x2f\x67\x6f\x6f\x64\x73\x2d\x64\x65\x74\x61\x69\x6c\x73\x2f\x69\x6e\x64\x65\x78\x3f\x69\x64\x3d', '\x64\x47\x57\x62\x61', '\x6e\x65\x77\x63\x6f\x75\x70\x6f\x6e\x73', '\x2f\x63\x6f\x6e\x66\x69\x67\x2f\x67\x65\x74\x2d\x76\x61\x6c\x75\x65', '\x2f\x62\x61\x6e\x6e\x65\x72\x2f\x6c\x69\x73\x74', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x6c\x69\x73\x74', '\x6f\x6e\x53\x68\x6f\x77'];(function (_0x28cf2a, _0x4bd05f) {
  var _0x52ddc0 = function _0x52ddc0(_0x540888) {
    while (--_0x540888) {
      _0x28cf2a['push'](_0x28cf2a['shift']());
    }
  };_0x52ddc0(++_0x4bd05f);
})(wanzikun_0xb7ff, 0x1a9);var wanzikun_0x540f = function wanzikun_0x540f(_0x3dc136, _0xe66858) {
  _0x3dc136 = _0x3dc136 - 0x0;var _0x23644f = wanzikun_0xb7ff[_0x3dc136];return _0x23644f;
};var wanzikun_0x333a4f = getApp();Page({ '\x64\x61\x74\x61': { '\x61\x75\x74\x6f\x70\x6c\x61\x79': !![], '\x69\x6e\x74\x65\x72\x76\x61\x6c': 0x1770, '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x1f4, '\x63\x69\x72\x63\x75\x6c\x61\x72': !![], '\x66\x61\x76\x69\x63\x6f\x6e': {}, '\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c': {}, '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f': {}, '\x70\x72\x69\x63\x65\x73': {}, '\x77\x78\x6c\x6f\x67\x69\x6e': !![], '\x57\x65\x69\x4c\x61\x69\x4d\x6f\x72\x65\x41\x70\x70': !![] }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad() {
    var _0x29f8e9 = { '\x56\x42\x54\x72\x70': function VBTrp(_0x66d742, _0x15d727) {
        return _0x66d742 == _0x15d727;
      }, '\x63\x56\x43\x58\x78': function cVCXx(_0x1c3a68, _0x76d83) {
        return _0x1c3a68 === _0x76d83;
      }, '\x58\x59\x44\x49\x76': wanzikun_0x540f('0x0'), '\x6b\x75\x48\x4b\x68': wanzikun_0x540f('0x1'), '\x50\x4a\x6d\x73\x6d': function PJmsm(_0x31257d, _0x13c506) {
        return _0x31257d + _0x13c506;
      }, '\x71\x73\x76\x51\x68': function qsvQh(_0x37f839, _0x1b55a1) {
        return _0x37f839 + _0x1b55a1;
      }, '\x77\x51\x53\x52\x77': wanzikun_0x540f('0x2'), '\x4e\x55\x76\x48\x45': wanzikun_0x540f('0x3'), '\x4b\x62\x5a\x79\x78': wanzikun_0x540f('0x4'), '\x54\x49\x76\x70\x44': wanzikun_0x540f('0x5'), '\x6f\x66\x66\x52\x44': wanzikun_0x540f('0x6'), '\x49\x69\x6c\x75\x67': function Iilug(_0x545e15, _0x3c8bbd, _0x46c743) {
        return _0x545e15(_0x3c8bbd, _0x46c743);
      }, '\x69\x55\x69\x4f\x6a': function iUiOj(_0x771416, _0x1b53bc) {
        return _0x771416 < _0x1b53bc;
      }, '\x43\x6c\x4a\x64\x62': function ClJdb(_0x1ee6bd, _0x1cd483) {
        return _0x1ee6bd + _0x1cd483;
      }, '\x4a\x54\x4e\x6c\x6d': '\x6d\x69\x6e\x69\x61\x70\x70', '\x50\x47\x77\x56\x61': wanzikun_0x540f('0x7'), '\x6c\x52\x6c\x43\x75': '\x6d\x6f\x72\x65\x61\x70\x70', '\x72\x4c\x58\x78\x47': wanzikun_0x540f('0x8'), '\x57\x71\x53\x77\x57': '\x48\x6f\x74\x4e\x61\x6d\x65', '\x49\x5a\x63\x56\x67': wanzikun_0x540f('0x9') };this[wanzikun_0x540f('0xa')]();var _0x26cd2c = this;wx[wanzikun_0x540f('0xb')]({ '\x73\x75\x63\x63\x65\x73\x73': function success(_0x2ff4db) {
        _0x26cd2c[wanzikun_0x540f('0xc')]({ '\x77\x69\x6e\x64\x6f\x77\x57\x69\x64\x74\x68': _0x2ff4db[wanzikun_0x540f('0xd')], '\x77\x69\x6e\x64\x6f\x77\x48\x65\x69\x67\x68\x74': _0x2ff4db[wanzikun_0x540f('0xe')] });
      } });wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': _0x29f8e9[wanzikun_0x540f('0x10')](wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')], wanzikun_0x540f('0x8')), '\x64\x61\x74\x61': { '\x74\x79\x70\x65': _0x29f8e9[wanzikun_0x540f('0x13')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x65f7fb) {
        if (_0x65f7fb['\x64\x61\x74\x61'][wanzikun_0x540f('0x14')] == 0x0) {
          _0x26cd2c[wanzikun_0x540f('0xc')]({ '\x6d\x69\x6e\x69\x61\x70\x70\x6c\x69\x73\x74': _0x65f7fb['\x64\x61\x74\x61'][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x16')]() });
        }
      } });wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': wanzikun_0x333a4f['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x540f('0x12')] + _0x29f8e9[wanzikun_0x540f('0x17')], '\x64\x61\x74\x61': { '\x6b\x65\x79': _0x29f8e9[wanzikun_0x540f('0x18')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x4c3f23) {
        if (_0x29f8e9[wanzikun_0x540f('0x19')](_0x4c3f23[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')], 0x0)) {
          if (_0x29f8e9[wanzikun_0x540f('0x1a')](_0x29f8e9[wanzikun_0x540f('0x1b')], '\x5a\x79\x65\x45\x43')) {
            if (_0x29f8e9[wanzikun_0x540f('0x19')](_0x4c3f23[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')], 0x0)) {
              _0x26cd2c[wanzikun_0x540f('0xc')]({ '\x6d\x6f\x72\x65\x61\x70\x70\x49\x6e\x66\x6f': _0x4c3f23[wanzikun_0x540f('0x15')]['\x64\x61\x74\x61'] });
            }
          } else {
            _0x26cd2c['\x73\x65\x74\x44\x61\x74\x61']({ '\x6d\x6f\x72\x65\x61\x70\x70\x49\x6e\x66\x6f': _0x4c3f23[wanzikun_0x540f('0x15')]['\x64\x61\x74\x61'] });
          }
        }
      } });wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': _0x29f8e9[wanzikun_0x540f('0x10')](wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')], _0x29f8e9[wanzikun_0x540f('0x1c')]), '\x64\x61\x74\x61': { '\x74\x79\x70\x65': wanzikun_0x540f('0x1d') }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x24ce51) {
        var _0x473162 = { '\x56\x51\x79\x59\x41': _0x29f8e9[wanzikun_0x540f('0x1e')], '\x72\x6e\x70\x50\x47': function rnpPG(_0xfd4dc, _0x4edff2) {
            return _0x29f8e9['\x50\x4a\x6d\x73\x6d'](_0xfd4dc, _0x4edff2);
          }, '\x63\x56\x76\x61\x4c': function cVvaL(_0x2892b6, _0x126eee) {
            return _0x29f8e9[wanzikun_0x540f('0x1f')](_0x2892b6, _0x126eee);
          } };if (_0x29f8e9[wanzikun_0x540f('0x19')](_0x24ce51[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')], 0x0)) {
          if (_0x29f8e9[wanzikun_0x540f('0x20')] === _0x29f8e9[wanzikun_0x540f('0x20')]) {
            _0x26cd2c[wanzikun_0x540f('0xc')]({ '\x74\x6f\x70\x6c\x6f\x67\x6f': _0x24ce51['\x64\x61\x74\x61']['\x64\x61\x74\x61'][0x0][wanzikun_0x540f('0x21')], '\x74\x6f\x70\x6e\x61\x6d\x65': wx[wanzikun_0x540f('0x22')](_0x29f8e9[wanzikun_0x540f('0x23')]) });
          } else {
            var _0x14656b = _0x26cd2c[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')];_0x14656b[e] = _0x24ce51[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')];if (_0x24ce51['\x64\x61\x74\x61'][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x25')]) {
              var _0x4eaef3 = _0x473162[wanzikun_0x540f('0x26')][wanzikun_0x540f('0x27')]('\x7c'),
                  _0xb42ef = 0x0;while (!![]) {
                switch (_0x4eaef3[_0xb42ef++]) {case '\x30':
                    var _0x52ee69 = _0x24ce51[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x25')][0x0][wanzikun_0x540f('0x28')];continue;case '\x31':
                    var _0x5a37fa = _0x24ce51[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')]['\x70\x72\x6f\x70\x65\x72\x74\x69\x65\x73'][0x0]['\x69\x64'];continue;case '\x32':
                    var _0x55f0a6 = _0x24ce51['\x64\x61\x74\x61'][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x25')][0x0][wanzikun_0x540f('0x29')];continue;case '\x33':
                    var _0x76299d = _0x52ee69[0x0][wanzikun_0x540f('0x29')];continue;case '\x34':
                    var _0x3480af = _0x473162[wanzikun_0x540f('0x2a')](_0x473162[wanzikun_0x540f('0x2b')](_0x5a37fa, '\x3a'), _0x5c8b21);continue;case '\x35':
                    var _0x5c8b21 = _0x52ee69[0x0]['\x69\x64'];continue;case '\x36':
                    _0x26cd2c[wanzikun_0x540f('0x2c')](_0x3480af, e);continue;}break;
              }
            }_0x26cd2c[wanzikun_0x540f('0xc')]({ '\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c': _0x14656b });
          }
        }
      } });wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x29f8e9[wanzikun_0x540f('0x10')](wanzikun_0x333a4f['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x540f('0x12')], wanzikun_0x540f('0x7')), '\x64\x61\x74\x61': { '\x6b\x65\x79': _0x29f8e9[wanzikun_0x540f('0x2d')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3d4f31) {
        if (_0x29f8e9[wanzikun_0x540f('0x19')](_0x3d4f31[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')], 0x0)) {
          _0x26cd2c[wanzikun_0x540f('0xc')]({ '\x48\x6f\x74\x4e\x61\x6d\x65': _0x3d4f31[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')] });
        }
      } });_0x29f8e9[wanzikun_0x540f('0x2e')](setTimeout, function () {
      var _0x378127 = { '\x42\x52\x4c\x6e\x6b': function BRLnk(_0x145148, _0x4ca97c) {
          return _0x29f8e9[wanzikun_0x540f('0x1f')](_0x145148, _0x4ca97c);
        }, '\x6b\x69\x59\x61\x6e': wanzikun_0x540f('0x2f'), '\x74\x4d\x75\x53\x5a': _0x29f8e9[wanzikun_0x540f('0x30')] };if (wanzikun_0x540f('0x31') !== _0x29f8e9['\x54\x49\x76\x70\x44']) {
        wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')] + wanzikun_0x540f('0x8'), '\x64\x61\x74\x61': { '\x6b\x65\x79': _0x29f8e9['\x4e\x55\x76\x48\x45'], '\x74\x79\x70\x65': _0x29f8e9[wanzikun_0x540f('0x32')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3f9e86) {
            if (_0x3f9e86[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')] == 0x0) {
              wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': _0x378127[wanzikun_0x540f('0x33')](wanzikun_0x333a4f[wanzikun_0x540f('0x11')]['\x75\x72\x6c\x73'], _0x378127[wanzikun_0x540f('0x34')]), '\x64\x61\x74\x61': { '\x69\x64': _0x3f9e86[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][0x0][wanzikun_0x540f('0x35')], '\x74\x6f\x6b\x65\x6e': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x36')], '\x64\x65\x74\x65\x63\x74': !![] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3f9e86) {
                  _0x26cd2c[wanzikun_0x540f('0xc')]({ '\x64\x65\x74\x65\x63\x74': _0x3f9e86[wanzikun_0x540f('0x15')]['\x63\x6f\x64\x65'] });
                } });_0x26cd2c['\x73\x65\x74\x44\x61\x74\x61']({ '\x6e\x65\x77\x63\x6f\x75\x70\x6f\x6e\x73': _0x3f9e86[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')] });
            }
          } });
      } else {
        wx[wanzikun_0x540f('0x37')]({ '\x75\x72\x6c': _0x378127[wanzikun_0x540f('0x38')] + e['\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74'][wanzikun_0x540f('0x39')]['\x69\x64'] });
      }
    }, 0x3e8);wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': _0x29f8e9[wanzikun_0x540f('0x10')](wanzikun_0x333a4f[wanzikun_0x540f('0x11')]['\x75\x72\x6c\x73'], _0x29f8e9[wanzikun_0x540f('0x3a')]), '\x64\x61\x74\x61': { '\x72\x65\x63\x6f\x6d\x6d\x65\x6e\x64\x53\x74\x61\x74\x75\x73': 0x1 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x220329) {
        var _0x164515 = wanzikun_0x540f('0x3b')[wanzikun_0x540f('0x27')]('\x7c'),
            _0x1e2dbb = 0x0;while (!![]) {
          switch (_0x164515[_0x1e2dbb++]) {case '\x30':
              var _0x5e7ac1 = [];continue;case '\x31':
              _0x26cd2c[wanzikun_0x540f('0xc')]({ '\x67\x6f\x6f\x64\x73': [], '\x6c\x6f\x61\x64\x69\x6e\x67\x4d\x6f\x72\x65\x48\x69\x64\x64\x65\x6e': !![] });continue;case '\x32':
              var _0x696d8e = [];continue;case '\x33':
              _0x29f8e9[wanzikun_0x540f('0x2e')](setTimeout, function () {
                _0x26cd2c['\x73\x65\x74\x69\x64\x73'](_0x5e7ac1);
              }, 0x3e8);continue;case '\x34':
              var _0x32fa00 = _0x26cd2c['\x64\x61\x74\x61'][wanzikun_0x540f('0x3c')];continue;case '\x35':
              _0x26cd2c['\x73\x65\x74\x44\x61\x74\x61']({ '\x67\x6f\x6f\x64\x73': _0x696d8e, '\x66\x61\x76\x69\x63\x6f\x6e': _0x32fa00 });continue;case '\x36':
              for (var _0x540513 = 0x0; _0x29f8e9[wanzikun_0x540f('0x3d')](_0x540513, _0x220329['\x64\x61\x74\x61'][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x3e')]); _0x540513++) {
                _0x696d8e[wanzikun_0x540f('0x3f')](_0x220329['\x64\x61\x74\x61'][wanzikun_0x540f('0x15')][_0x540513]);_0x5e7ac1[wanzikun_0x540f('0x3f')](_0x220329[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][_0x540513]['\x69\x64']);_0x32fa00[_0x220329['\x64\x61\x74\x61']['\x64\x61\x74\x61'][_0x540513]['\x69\x64']] = 0x0;_0x26cd2c[wanzikun_0x540f('0x40')](_0x220329[wanzikun_0x540f('0x15')]['\x64\x61\x74\x61'][_0x540513]['\x69\x64']);
              }continue;}break;
        }
      } });
  }, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    var _0x5aa0d2 = { '\x6e\x50\x73\x51\x65': wanzikun_0x540f('0x41'), '\x62\x57\x5a\x57\x77': '\x2e\x2e\x2f\x2e\x2e\x2f\x69\x6d\x61\x67\x65\x73\x2f\x43\x6f\x6f\x6c\x2d\x6c\x6f\x76\x65\x2e\x70\x6e\x67', '\x4c\x56\x55\x5a\x65': function LVUZe(_0x40d2f7, _0x4af589) {
        return _0x40d2f7 + _0x4af589;
      }, '\x78\x51\x6a\x6e\x6c': wanzikun_0x540f('0x42'), '\x42\x4e\x5a\x7a\x70': function BNZzp(_0xff530d, _0x419595) {
        return _0xff530d > _0x419595;
      }, '\x77\x77\x58\x45\x74': '\x68\x65\x4d\x53\x76', '\x63\x62\x4b\x67\x46': wanzikun_0x540f('0x43'), '\x52\x75\x71\x67\x6a': function Ruqgj(_0x100fd8, _0x508b7b) {
        return _0x100fd8 !== _0x508b7b;
      }, '\x51\x4e\x76\x77\x6a': wanzikun_0x540f('0x44'), '\x73\x76\x55\x65\x7a': wanzikun_0x540f('0x45'), '\x78\x65\x79\x59\x78': function xeyYx(_0x1b1309, _0xc1c06b) {
        return _0x1b1309 > _0xc1c06b;
      }, '\x64\x47\x6f\x56\x4d': wanzikun_0x540f('0x46'), '\x43\x64\x6b\x45\x5a': function CdkEZ(_0x13cdf3, _0xea87d0) {
        return _0x13cdf3 + _0xea87d0;
      }, '\x63\x74\x50\x45\x7a': wanzikun_0x540f('0x47') };var _0x2038b8 = this;setTimeout(function () {
      if (wanzikun_0x333a4f['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x540f('0x48')] == 0x0) {
        _0x2038b8[wanzikun_0x540f('0xc')]({ '\x77\x78\x6c\x6f\x67\x69\x6e': ![] });wx['\x68\x69\x64\x65\x54\x61\x62\x42\x61\x72']();
      }
    }, 0x3e8);wx[wanzikun_0x540f('0x49')]({ '\x6b\x65\x79': _0x5aa0d2['\x64\x47\x6f\x56\x4d'], '\x73\x75\x63\x63\x65\x73\x73': function success(_0x2d0b47) {
        var _0x4e64bc = { '\x6a\x42\x52\x63\x77': _0x5aa0d2[wanzikun_0x540f('0x4a')], '\x4f\x53\x42\x6b\x51': _0x5aa0d2[wanzikun_0x540f('0x4b')], '\x50\x4f\x4f\x42\x42': function POOBB(_0x24a476, _0x299518) {
            return _0x5aa0d2[wanzikun_0x540f('0x4c')](_0x24a476, _0x299518);
          }, '\x53\x78\x47\x42\x7a': function SxGBz(_0x414348, _0x18215d) {
            return _0x5aa0d2[wanzikun_0x540f('0x4c')](_0x414348, _0x18215d);
          }, '\x74\x72\x47\x77\x71': _0x5aa0d2['\x78\x51\x6a\x6e\x6c'] };if (_0x2d0b47['\x64\x61\x74\x61']) {
          _0x2038b8[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x46')] = _0x2d0b47[wanzikun_0x540f('0x15')];if (_0x5aa0d2['\x42\x4e\x5a\x7a\x70'](_0x2d0b47[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x4d')], 0x0)) {
            if (_0x5aa0d2['\x77\x77\x58\x45\x74'] === _0x5aa0d2[wanzikun_0x540f('0x4e')]) {
              wx[wanzikun_0x540f('0x4f')]({ '\x74\x69\x74\x6c\x65': wanzikun_0x540f('0x50'), '\x69\x63\x6f\x6e': _0x4e64bc['\x6a\x42\x52\x63\x77'], '\x69\x6d\x61\x67\x65': _0x4e64bc[wanzikun_0x540f('0x51')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });favicon[fid] = 0x0;_0x2038b8[wanzikun_0x540f('0xc')]({ '\x66\x61\x76\x69\x63\x6f\x6e': favicon });
            } else {
              wx['\x73\x68\x6f\x77\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74']({ '\x69\x6e\x64\x65\x78': 0x2 });
            }
          } else {
            wx['\x68\x69\x64\x65\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74']({ '\x69\x6e\x64\x65\x78': 0x2 });
          }
        } else {
          if (_0x5aa0d2[wanzikun_0x540f('0x52')](_0x5aa0d2[wanzikun_0x540f('0x53')], _0x5aa0d2['\x73\x76\x55\x65\x7a'])) {
            wx[wanzikun_0x540f('0x54')]({ '\x69\x6e\x64\x65\x78': 0x2 });
          } else {
            var _0x24e0a3 = { '\x53\x63\x67\x61\x72': function Scgar(_0x549707, _0x165ba1) {
                return _0x4e64bc[wanzikun_0x540f('0x55')](_0x549707, _0x165ba1);
              } };var _0xdbb465 = this;wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': _0x4e64bc['\x53\x78\x47\x42\x7a'](wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')], _0x4e64bc[wanzikun_0x540f('0x56')]), '\x64\x61\x74\x61': { '\x69\x64': e }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x9aaf41) {
                var _0x56369b = _0xdbb465[wanzikun_0x540f('0x15')]['\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c'];_0x56369b[e] = _0x9aaf41[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')];if (_0x9aaf41[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')]['\x70\x72\x6f\x70\x65\x72\x74\x69\x65\x73']) {
                  var JZNBOt = wanzikun_0x540f('0x57')[wanzikun_0x540f('0x27')]('\x7c'),
                      yfBXGw = 0x0;while (!![]) {
                    switch (JZNBOt[yfBXGw++]) {case '\x30':
                        var _0x4acace = _0x1e53f9[0x0][wanzikun_0x540f('0x29')];continue;case '\x31':
                        _0xdbb465[wanzikun_0x540f('0x2c')](_0x5d03f7, e);continue;case '\x32':
                        var _0x79143f = _0x1e53f9[0x0]['\x69\x64'];continue;case '\x33':
                        var _0x112c75 = _0x9aaf41['\x64\x61\x74\x61'][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x25')][0x0]['\x69\x64'];continue;case '\x34':
                        var _0x5d03f7 = _0x24e0a3[wanzikun_0x540f('0x58')](_0x24e0a3[wanzikun_0x540f('0x58')](_0x112c75, '\x3a'), _0x79143f);continue;case '\x35':
                        var _0x4276ea = _0x9aaf41[wanzikun_0x540f('0x15')]['\x64\x61\x74\x61'][wanzikun_0x540f('0x25')][0x0][wanzikun_0x540f('0x29')];continue;case '\x36':
                        var _0x1e53f9 = _0x9aaf41[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x25')][0x0][wanzikun_0x540f('0x28')];continue;}break;
                  }
                }_0xdbb465[wanzikun_0x540f('0xc')]({ '\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c': _0x56369b });
              } });
          }
        }
      } });wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': _0x5aa0d2[wanzikun_0x540f('0x59')](wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')], _0x5aa0d2['\x63\x74\x50\x45\x7a']), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x36')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x558ec8) {
        if (_0x558ec8[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')] == 0x0) {
          if (_0x5aa0d2[wanzikun_0x540f('0x5a')](_0x558ec8[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x5b')], 0x0)) {
            wx[wanzikun_0x540f('0x5c')]({ '\x69\x6e\x64\x65\x78': 0x3 });
          } else {
            wx['\x68\x69\x64\x65\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74']({ '\x69\x6e\x64\x65\x78': 0x3 });
          }
        }
      } });
  }, '\x73\x65\x74\x67\x6f\x6f\x64\x73': function setgoods(_0x53edcb) {
    var _0x2ac94c = { '\x4e\x6c\x49\x41\x76': function NlIAv(_0x2cbc99, _0x56d312) {
        return _0x2cbc99 < _0x56d312;
      }, '\x4a\x56\x6d\x77\x5a': function JVmwZ(_0x5503e6, _0x12da3f) {
        return _0x5503e6 == _0x12da3f;
      }, '\x73\x6f\x42\x75\x4f': wanzikun_0x540f('0x5d'), '\x46\x62\x57\x4d\x6f': wanzikun_0x540f('0x41'), '\x6f\x48\x6c\x5a\x50': wanzikun_0x540f('0x5e'), '\x67\x6a\x74\x50\x69': wanzikun_0x540f('0x5f'), '\x70\x49\x65\x45\x4a': '\x6f\x53\x45\x56\x52', '\x77\x4f\x7a\x68\x55': wanzikun_0x540f('0x60'), '\x56\x4d\x41\x65\x65': function VMAee(_0x428725, _0x549498) {
        return _0x428725 + _0x549498;
      }, '\x58\x4d\x4f\x73\x6d': wanzikun_0x540f('0x42') };var _0x5d7973 = this;wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')] + _0x2ac94c[wanzikun_0x540f('0x61')], '\x64\x61\x74\x61': { '\x69\x64': _0x53edcb }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x32d95e) {
        var _0x1ff166 = { '\x68\x47\x4f\x61\x75': function hGOau(_0x4275dd, _0x3fc729) {
            return _0x2ac94c['\x4a\x56\x6d\x77\x5a'](_0x4275dd, _0x3fc729);
          }, '\x42\x50\x46\x49\x62': _0x2ac94c['\x73\x6f\x42\x75\x4f'], '\x75\x71\x42\x62\x52': _0x2ac94c[wanzikun_0x540f('0x62')], '\x66\x45\x65\x6d\x79': _0x2ac94c[wanzikun_0x540f('0x63')] };if (_0x2ac94c[wanzikun_0x540f('0x64')] !== _0x2ac94c[wanzikun_0x540f('0x65')]) {
          var _0x137f70 = _0x5d7973[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')];_0x137f70[_0x53edcb] = _0x32d95e[wanzikun_0x540f('0x15')]['\x64\x61\x74\x61'];if (_0x32d95e[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')]['\x70\x72\x6f\x70\x65\x72\x74\x69\x65\x73']) {
            if (_0x2ac94c[wanzikun_0x540f('0x66')] === wanzikun_0x540f('0x67')) {
              var _0x2caa07 = this;var _0xea436f = _0x2caa07[wanzikun_0x540f('0x15')]['\x66\x61\x76\x69\x63\x6f\x6e'];for (var _0x2f40d1 = 0x0; _0x2ac94c[wanzikun_0x540f('0x68')](_0x2f40d1, _0x53edcb['\x6c\x65\x6e\x67\x74\x68']); _0x2f40d1++) {
                _0x2caa07[wanzikun_0x540f('0x69')](_0x53edcb[_0x2f40d1]);
              }
            } else {
              var _0x109a2a = _0x32d95e[wanzikun_0x540f('0x15')]['\x64\x61\x74\x61'][wanzikun_0x540f('0x25')][0x0]['\x69\x64'];var _0x2bf4a0 = _0x32d95e[wanzikun_0x540f('0x15')]['\x64\x61\x74\x61'][wanzikun_0x540f('0x25')][0x0][wanzikun_0x540f('0x29')];var _0x3a6054 = _0x32d95e[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x25')][0x0]['\x63\x68\x69\x6c\x64\x73\x43\x75\x72\x47\x6f\x6f\x64\x73'];var _0x574448 = _0x3a6054[0x0]['\x69\x64'];var _0xbf7862 = _0x3a6054[0x0]['\x6e\x61\x6d\x65'];var _0x564c80 = _0x2ac94c[wanzikun_0x540f('0x6a')](_0x109a2a, '\x3a') + _0x574448;_0x5d7973[wanzikun_0x540f('0x2c')](_0x564c80, _0x53edcb);
            }
          }_0x5d7973[wanzikun_0x540f('0xc')]({ '\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c': _0x137f70 });
        } else {
          if (_0x1ff166[wanzikun_0x540f('0x6b')](_0x32d95e[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')], 0x0)) {
            wx[wanzikun_0x540f('0x4f')]({ '\x74\x69\x74\x6c\x65': _0x1ff166[wanzikun_0x540f('0x6c')], '\x69\x63\x6f\x6e': _0x1ff166[wanzikun_0x540f('0x6d')], '\x69\x6d\x61\x67\x65': wanzikun_0x540f('0x6e'), '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });
          } else {
            wx[wanzikun_0x540f('0x4f')]({ '\x74\x69\x74\x6c\x65': _0x1ff166['\x66\x45\x65\x6d\x79'], '\x69\x63\x6f\x6e': wanzikun_0x540f('0x41'), '\x69\x6d\x61\x67\x65': wanzikun_0x540f('0x6f'), '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });
          }
        }
      } });
  }, '\x67\x65\x74\x48\x6f\x74\x54\x61\x70': function getHotTap(_0x4d6f91) {
    var _0xbab4f2 = { '\x75\x56\x53\x6f\x43': function uVSoC(_0x1363ad, _0x4c6816) {
        return _0x1363ad + _0x4c6816;
      }, '\x4a\x6f\x58\x57\x52': wanzikun_0x540f('0x4') };wx[wanzikun_0x540f('0x37')]({ '\x75\x72\x6c': _0xbab4f2[wanzikun_0x540f('0x70')](_0xbab4f2[wanzikun_0x540f('0x71')], _0x4d6f91[wanzikun_0x540f('0x72')][wanzikun_0x540f('0x39')]['\x69\x64']) });
  }, '\x73\x65\x74\x69\x64\x73': function setids(_0x3c55c3) {
    var _0xb10bfb = this;var _0x134814 = _0xb10bfb[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x3c')];for (var _0x3fca00 = 0x0; _0x3fca00 < _0x3c55c3[wanzikun_0x540f('0x3e')]; _0x3fca00++) {
      _0xb10bfb[wanzikun_0x540f('0x69')](_0x3c55c3[_0x3fca00]);
    }
  }, '\x67\x65\x74\x43\x6f\x75\x70\x6f\x6e\x73\x54\x61\x70': function getCouponsTap(_0x1d5363) {
    var _0x2aa871 = { '\x4d\x59\x44\x66\x57': wanzikun_0x540f('0x41'), '\x73\x6d\x6b\x6a\x62': function smkjb(_0x35b387, _0xb387aa) {
        return _0x35b387 === _0xb387aa;
      }, '\x67\x4e\x42\x64\x56': '\x75\x41\x6e\x69\x76', '\x6c\x43\x6e\x70\x6f': function lCnpo(_0x3ff8f4, _0x3a49ae) {
        return _0x3ff8f4 == _0x3a49ae;
      }, '\x53\x52\x70\x52\x69': wanzikun_0x540f('0x5d'), '\x67\x59\x45\x54\x45': wanzikun_0x540f('0x6e'), '\x6c\x69\x6f\x49\x6b': wanzikun_0x540f('0x5e'), '\x64\x6d\x76\x5a\x55': function dmvZU(_0x1ef732, _0x3e7431) {
        return _0x1ef732 + _0x3e7431;
      } };wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': _0x2aa871[wanzikun_0x540f('0x73')](wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')], wanzikun_0x540f('0x2f')), '\x64\x61\x74\x61': { '\x69\x64': _0x1d5363[wanzikun_0x540f('0x72')][wanzikun_0x540f('0x39')]['\x69\x64'], '\x74\x6f\x6b\x65\x6e': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x36')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x5247a9) {
        var _0x129e63 = { '\x70\x62\x65\x4e\x43': '\u9886\u53D6\u6210\u529F', '\x4b\x42\x47\x62\x44': _0x2aa871[wanzikun_0x540f('0x74')] };if (_0x2aa871[wanzikun_0x540f('0x75')](_0x2aa871[wanzikun_0x540f('0x76')], _0x2aa871[wanzikun_0x540f('0x76')])) {
          if (_0x2aa871['\x6c\x43\x6e\x70\x6f'](_0x5247a9[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')], 0x0)) {
            wx['\x73\x68\x6f\x77\x54\x6f\x61\x73\x74']({ '\x74\x69\x74\x6c\x65': _0x2aa871[wanzikun_0x540f('0x77')], '\x69\x63\x6f\x6e': _0x2aa871[wanzikun_0x540f('0x74')], '\x69\x6d\x61\x67\x65': _0x2aa871[wanzikun_0x540f('0x78')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });
          } else {
            wx['\x73\x68\x6f\x77\x54\x6f\x61\x73\x74']({ '\x74\x69\x74\x6c\x65': _0x2aa871[wanzikun_0x540f('0x79')], '\x69\x63\x6f\x6e': _0x2aa871[wanzikun_0x540f('0x74')], '\x69\x6d\x61\x67\x65': wanzikun_0x540f('0x6f'), '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });
          }
        } else {
          wx['\x73\x68\x6f\x77\x54\x6f\x61\x73\x74']({ '\x74\x69\x74\x6c\x65': _0x129e63['\x70\x62\x65\x4e\x43'], '\x69\x63\x6f\x6e': _0x129e63['\x4b\x42\x47\x62\x44'], '\x69\x6d\x61\x67\x65': wanzikun_0x540f('0x6e'), '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });
        }
      } });
  }, '\x67\x65\x74\x66\x61\x76': function getfav(_0x309c19) {
    var _0x10dda7 = { '\x75\x45\x76\x44\x6c': function uEvDl(_0x5b6db5, _0x503da7) {
        return _0x5b6db5 !== _0x503da7;
      }, '\x54\x79\x66\x63\x4d': wanzikun_0x540f('0x7a'), '\x46\x72\x6b\x77\x47': function FrkwG(_0x4ce322, _0x36286c) {
        return _0x4ce322 < _0x36286c;
      }, '\x61\x72\x55\x67\x4f': '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x66\x61\x76\x2f\x6c\x69\x73\x74' };var _0x36473d = this;wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')] + _0x10dda7[wanzikun_0x540f('0x7b')], '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x36')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x54a99f) {
        if (_0x10dda7[wanzikun_0x540f('0x7c')](_0x10dda7[wanzikun_0x540f('0x7d')], '\x4b\x73\x4f\x57\x57')) {
          _0x36473d['\x73\x65\x74\x44\x61\x74\x61']({ '\x77\x69\x6e\x64\x6f\x77\x57\x69\x64\x74\x68': _0x54a99f[wanzikun_0x540f('0xd')], '\x77\x69\x6e\x64\x6f\x77\x48\x65\x69\x67\x68\x74': _0x54a99f['\x77\x69\x6e\x64\x6f\x77\x48\x65\x69\x67\x68\x74'] });
        } else {
          var _0x494da9 = _0x36473d[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x3c')];if (_0x54a99f[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')] == 0x0 && _0x54a99f[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x3e')]) {
            for (var _0x932133 = 0x0; _0x10dda7[wanzikun_0x540f('0x7e')](_0x932133, _0x54a99f['\x64\x61\x74\x61'][wanzikun_0x540f('0x15')]['\x6c\x65\x6e\x67\x74\x68']); _0x932133++) {
              if (_0x54a99f[wanzikun_0x540f('0x15')]['\x64\x61\x74\x61'][_0x932133][wanzikun_0x540f('0x7f')] == _0x309c19) {
                _0x494da9[_0x309c19] = 0x1;
              } else {
                _0x494da9[_0x309c19] = 0x0;
              }
            }_0x36473d[wanzikun_0x540f('0xc')]({ '\x66\x61\x76\x69\x63\x6f\x6e': _0x494da9 });
          }
        }
      } });
  }, '\x66\x61\x76': function fav(_0x46d7f3) {
    var _0x45dead = { '\x75\x49\x50\x58\x42': function uIPXB(_0x223fc1, _0x25202a) {
        return _0x223fc1 !== _0x25202a;
      }, '\x68\x41\x59\x6b\x4d': wanzikun_0x540f('0x80'), '\x4d\x55\x5a\x4a\x4f': '\u6536\u85CF\u6210\u529F', '\x73\x78\x55\x48\x54': wanzikun_0x540f('0x41'), '\x42\x71\x71\x52\x73': wanzikun_0x540f('0x81'), '\x6f\x69\x52\x63\x76': function oiRcv(_0x5bcb8a, _0x258723) {
        return _0x5bcb8a + _0x258723;
      } };var _0x2f8854 = this;var _0x4a64be = _0x46d7f3['\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74'][wanzikun_0x540f('0x39')]['\x69\x64'];wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': _0x45dead['\x6f\x69\x52\x63\x76'](wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')], wanzikun_0x540f('0x82')), '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': _0x4a64be, '\x74\x6f\x6b\x65\x6e': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x36')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x15ffd9) {
        var _0x30e4ad = _0x2f8854[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x3c')];if (_0x15ffd9[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')] == 0x0) {
          if (_0x45dead[wanzikun_0x540f('0x83')](_0x45dead[wanzikun_0x540f('0x84')], _0x45dead[wanzikun_0x540f('0x84')])) {
            shopCarMap[wanzikun_0x540f('0x85')] = this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')][_0x46d7f3]['\x62\x61\x73\x69\x63\x49\x6e\x66\x6f']['\x6d\x69\x6e\x50\x72\x69\x63\x65'];
          } else {
            wx[wanzikun_0x540f('0x4f')]({ '\x74\x69\x74\x6c\x65': _0x45dead[wanzikun_0x540f('0x86')], '\x69\x63\x6f\x6e': _0x45dead[wanzikun_0x540f('0x87')], '\x69\x6d\x61\x67\x65': _0x45dead['\x42\x71\x71\x52\x73'], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });_0x30e4ad[_0x4a64be] = 0x1;_0x2f8854[wanzikun_0x540f('0xc')]({ '\x66\x61\x76\x69\x63\x6f\x6e': _0x30e4ad });
          }
        }
      } });
  }, '\x64\x65\x6c': function del(_0x1ef078) {
    var _0x11b3c7 = { '\x66\x64\x4b\x43\x63': function fdKCc(_0x284ada, _0x124b35) {
        return _0x284ada == _0x124b35;
      }, '\x50\x6b\x69\x73\x6b': function Pkisk(_0x399765, _0xed9996) {
        return _0x399765 === _0xed9996;
      }, '\x61\x46\x44\x49\x56': '\x77\x53\x79\x53\x45', '\x55\x69\x6b\x6d\x6f': wanzikun_0x540f('0x88'), '\x4d\x65\x64\x6d\x79': wanzikun_0x540f('0x50'), '\x6e\x55\x75\x4c\x6e': function nUuLn(_0x575b09, _0x10f8cb) {
        return _0x575b09 + _0x10f8cb;
      }, '\x68\x5a\x62\x70\x52': wanzikun_0x540f('0x89') };var _0x5b576e = this;var _0x267568 = _0x1ef078[wanzikun_0x540f('0x72')]['\x64\x61\x74\x61\x73\x65\x74']['\x69\x64'];wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': _0x11b3c7[wanzikun_0x540f('0x8a')](wanzikun_0x333a4f['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61']['\x75\x72\x6c\x73'], _0x11b3c7[wanzikun_0x540f('0x8b')]), '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': _0x267568, '\x74\x6f\x6b\x65\x6e': wanzikun_0x333a4f[wanzikun_0x540f('0x11')]['\x74\x6f\x6b\x65\x6e'] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0xd3b998) {
        var _0x280982 = _0x5b576e[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x3c')];if (_0x11b3c7[wanzikun_0x540f('0x8c')](_0xd3b998[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')], 0x0)) {
          if (_0x11b3c7[wanzikun_0x540f('0x8d')](_0x11b3c7['\x61\x46\x44\x49\x56'], _0x11b3c7[wanzikun_0x540f('0x8e')])) {
            _0x280982[_0x1ef078] = 0x0;
          } else {
            wx[wanzikun_0x540f('0x4f')]({ '\x74\x69\x74\x6c\x65': _0x11b3c7['\x4d\x65\x64\x6d\x79'], '\x69\x63\x6f\x6e': wanzikun_0x540f('0x41'), '\x69\x6d\x61\x67\x65': wanzikun_0x540f('0x8f'), '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });_0x280982[_0x267568] = 0x0;_0x5b576e[wanzikun_0x540f('0xc')]({ '\x66\x61\x76\x69\x63\x6f\x6e': _0x280982 });
          }
        }
      } });
  }, '\x61\x64\x64\x53\x68\x6f\x70\x43\x61\x72': function addShopCar(_0x4cf9fe) {
    var _0x472f51 = { '\x6a\x44\x74\x72\x4d': '\x32\x7c\x33\x7c\x31\x7c\x34\x7c\x35\x7c\x30', '\x72\x6e\x4a\x6f\x69': wanzikun_0x540f('0x46'), '\x52\x76\x49\x6e\x74': wanzikun_0x540f('0x90'), '\x6e\x53\x41\x78\x72': wanzikun_0x540f('0x41') };var _0x273a78 = _0x472f51['\x6a\x44\x74\x72\x4d'][wanzikun_0x540f('0x27')]('\x7c'),
        _0x266163 = 0x0;while (!![]) {
      switch (_0x273a78[_0x266163++]) {case '\x30':
          wx[wanzikun_0x540f('0x5c')]({ '\x69\x6e\x64\x65\x78': 0x2 });continue;case '\x31':
          this[wanzikun_0x540f('0xc')]({ '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f': _0x1dd163 });continue;case '\x32':
          var _0xd38e89 = _0x4cf9fe[wanzikun_0x540f('0x72')][wanzikun_0x540f('0x39')]['\x69\x64'];continue;case '\x33':
          var _0x1dd163 = this[wanzikun_0x540f('0x91')](_0xd38e89);continue;case '\x34':
          wx[wanzikun_0x540f('0x92')]({ '\x6b\x65\x79': _0x472f51['\x72\x6e\x4a\x6f\x69'], '\x64\x61\x74\x61': _0x1dd163 });continue;case '\x35':
          wx[wanzikun_0x540f('0x4f')]({ '\x74\x69\x74\x6c\x65': _0x472f51[wanzikun_0x540f('0x93')], '\x69\x63\x6f\x6e': _0x472f51[wanzikun_0x540f('0x94')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });continue;}break;
    }
  }, '\x62\x75\x6c\x69\x64\x53\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f': function bulidShopCarInfo(_0x18fbda) {
    var _0x19bea4 = { '\x67\x59\x64\x69\x6f': wanzikun_0x540f('0x2f'), '\x7a\x55\x47\x45\x49': wanzikun_0x540f('0x95'), '\x77\x46\x72\x4a\x49': function wFrJI(_0x54eeab, _0x580681) {
        return _0x54eeab < _0x580681;
      }, '\x61\x74\x47\x6b\x61': function atGka(_0x55be3d, _0x7b44fc) {
        return _0x55be3d == _0x7b44fc;
      }, '\x6a\x42\x52\x51\x69': function jBRQi(_0x55744e, _0x452c43) {
        return _0x55744e == _0x452c43;
      }, '\x57\x50\x52\x41\x69': wanzikun_0x540f('0x50'), '\x44\x52\x53\x69\x43': wanzikun_0x540f('0x41'), '\x73\x45\x78\x41\x75': wanzikun_0x540f('0x8f'), '\x6e\x79\x63\x62\x77': function nycbw(_0xfbea76, _0x35c613) {
        return _0xfbea76 === _0x35c613;
      }, '\x68\x47\x72\x76\x4d': wanzikun_0x540f('0x96'), '\x79\x78\x76\x49\x66': wanzikun_0x540f('0x97'), '\x78\x76\x45\x65\x44': wanzikun_0x540f('0x98'), '\x63\x43\x4d\x7a\x6f': function cCMzo(_0x362829, _0x4bf4c2) {
        return _0x362829 !== _0x4bf4c2;
      }, '\x59\x4b\x4e\x56\x63': wanzikun_0x540f('0x99'), '\x51\x79\x4a\x74\x67': function QyJtg(_0x3f0caa, _0x1e0bef) {
        return _0x3f0caa != _0x1e0bef;
      }, '\x69\x6e\x7a\x69\x6f': function inzio(_0x15024c, _0xf8c5be) {
        return _0x15024c + _0xf8c5be;
      }, '\x45\x52\x6f\x69\x61': function ERoia(_0x1b2b6b, _0x5456ca) {
        return _0x1b2b6b > _0x5456ca;
      }, '\x4f\x63\x54\x62\x66': '\x6f\x4c\x46\x79\x50' };var _0x4e9bea = this[wanzikun_0x540f('0x15')]['\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f'];if (!_0x4e9bea[wanzikun_0x540f('0x9a')]) {
      if (_0x19bea4[wanzikun_0x540f('0x9b')](_0x19bea4[wanzikun_0x540f('0x9c')], _0x19bea4[wanzikun_0x540f('0x9c')])) {
        _0x4e9bea[wanzikun_0x540f('0x9a')] = [];
      } else {
        if (res[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')] == 0x0) {
          wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')] + _0x19bea4[wanzikun_0x540f('0x9d')], '\x64\x61\x74\x61': { '\x69\x64': res[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][0x0][wanzikun_0x540f('0x35')], '\x74\x6f\x6b\x65\x6e': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x36')], '\x64\x65\x74\x65\x63\x74': !![] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x24c32f) {
              that[wanzikun_0x540f('0xc')]({ '\x64\x65\x74\x65\x63\x74': _0x24c32f[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')] });
            } });that[wanzikun_0x540f('0xc')]({ '\x6e\x65\x77\x63\x6f\x75\x70\x6f\x6e\x73': res['\x64\x61\x74\x61'][wanzikun_0x540f('0x15')] });
        }
      }
    }var _0x2a2d67 = {};_0x2a2d67[wanzikun_0x540f('0x7f')] = this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')][_0x18fbda][wanzikun_0x540f('0x9e')]['\x69\x64'];_0x2a2d67[wanzikun_0x540f('0x9f')] = this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')][_0x18fbda][wanzikun_0x540f('0x9e')][wanzikun_0x540f('0x9f')];_0x2a2d67[wanzikun_0x540f('0x29')] = this['\x64\x61\x74\x61']['\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c'][_0x18fbda][wanzikun_0x540f('0x9e')][wanzikun_0x540f('0x29')];if (!this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')][_0x18fbda][wanzikun_0x540f('0x25')]) {
      if (_0x19bea4[wanzikun_0x540f('0x9b')](_0x19bea4[wanzikun_0x540f('0xa0')], _0x19bea4['\x78\x76\x45\x65\x44'])) {
        wx['\x73\x68\x6f\x77\x54\x6f\x61\x73\x74']({ '\x74\x69\x74\x6c\x65': wanzikun_0x540f('0xa1'), '\x69\x63\x6f\x6e': _0x19bea4[wanzikun_0x540f('0xa2')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });
      } else {
        var _0xe55a13 = '';var _0x2ac89d = '';var _0x279ae4 = '';
      }
    } else {
      var _0xe55a13 = this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')][_0x18fbda][wanzikun_0x540f('0x25')][0x0]['\x69\x64'];var _0x2ac89d = this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')][_0x18fbda][wanzikun_0x540f('0x25')][0x0][wanzikun_0x540f('0x29')];var _0x279ae4 = this['\x64\x61\x74\x61'][wanzikun_0x540f('0x24')][_0x18fbda]['\x70\x72\x6f\x70\x65\x72\x74\x69\x65\x73'][0x0][wanzikun_0x540f('0x28')];
    }if (!_0x279ae4[0x0]) {
      if (_0x19bea4[wanzikun_0x540f('0xa3')](_0x19bea4[wanzikun_0x540f('0xa4')], _0x19bea4[wanzikun_0x540f('0xa4')])) {
        for (var _0x50a487 = 0x0; _0x19bea4[wanzikun_0x540f('0xa5')](_0x50a487, res[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x3e')]); _0x50a487++) {
          if (_0x19bea4[wanzikun_0x540f('0xa6')](res[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][_0x50a487][wanzikun_0x540f('0x7f')], _0x18fbda)) {
            favicon[_0x18fbda] = 0x1;
          } else {
            favicon[_0x18fbda] = 0x0;
          }
        }that[wanzikun_0x540f('0xc')]({ '\x66\x61\x76\x69\x63\x6f\x6e': favicon });
      } else {
        var _0x310eb1 = '';var _0x54324b = '';
      }
    } else {
      var _0x310eb1 = _0x279ae4[0x0]['\x69\x64'];var _0x54324b = _0x279ae4[0x0][wanzikun_0x540f('0x29')];
    }var _0x4cc3ab = '';var _0x58399c = '';if (_0x19bea4[wanzikun_0x540f('0xa7')](_0xe55a13, '')) {
      _0x4cc3ab = _0x19bea4[wanzikun_0x540f('0xa8')](_0xe55a13, '\x3a') + _0x310eb1;_0x58399c = _0x19bea4[wanzikun_0x540f('0xa8')](_0x19bea4[wanzikun_0x540f('0xa8')](_0x2ac89d, '\x3a'), _0x54324b);
    }_0x2a2d67[wanzikun_0x540f('0xa9')] = _0x4cc3ab;_0x2a2d67[wanzikun_0x540f('0xaa')] = _0x58399c;_0x2a2d67[wanzikun_0x540f('0xab')] = '';_0x2a2d67[wanzikun_0x540f('0xac')] = !![];_0x2a2d67[wanzikun_0x540f('0xad')] = 0x1;_0x2a2d67[wanzikun_0x540f('0xae')] = this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')][_0x18fbda][wanzikun_0x540f('0x9e')][wanzikun_0x540f('0xaf')];_0x2a2d67['\x6c\x6f\x67\x69\x73\x74\x69\x63\x73'] = this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')][_0x18fbda][wanzikun_0x540f('0xb0')];if (_0x19bea4[wanzikun_0x540f('0xb1')](this[wanzikun_0x540f('0x15')]['\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c'][_0x18fbda][wanzikun_0x540f('0x9e')][wanzikun_0x540f('0xb2')], 0x0)) {
      _0x2a2d67[wanzikun_0x540f('0x85')] = this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')][_0x18fbda][wanzikun_0x540f('0x9e')][wanzikun_0x540f('0xb2')];
    } else {
      _0x2a2d67[wanzikun_0x540f('0x85')] = this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x24')][_0x18fbda][wanzikun_0x540f('0x9e')][wanzikun_0x540f('0xb3')];
    }if (this['\x64\x61\x74\x61'][wanzikun_0x540f('0x24')][_0x18fbda][wanzikun_0x540f('0x25')]) {
      if (_0x19bea4[wanzikun_0x540f('0x9b')]('\x6f\x4c\x46\x79\x50', _0x19bea4[wanzikun_0x540f('0xb4')])) {
        _0x2a2d67[wanzikun_0x540f('0x85')] = this[wanzikun_0x540f('0x15')][wanzikun_0x540f('0xb5')][_0x18fbda];
      } else {
        var _0xa0cf21 = { '\x6a\x59\x4d\x78\x69': function jYMxi(_0x2b0923, _0x329732) {
            return _0x19bea4[wanzikun_0x540f('0xb6')](_0x2b0923, _0x329732);
          }, '\x4c\x71\x4b\x4d\x75': _0x19bea4[wanzikun_0x540f('0xb7')], '\x59\x49\x42\x61\x44': _0x19bea4[wanzikun_0x540f('0xb8')], '\x50\x7a\x5a\x61\x54': _0x19bea4[wanzikun_0x540f('0xb9')] };var _0x3990df = this;var _0x4ba20e = _0x18fbda[wanzikun_0x540f('0x72')][wanzikun_0x540f('0x39')]['\x69\x64'];wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': wanzikun_0x333a4f[wanzikun_0x540f('0x11')]['\x75\x72\x6c\x73'] + wanzikun_0x540f('0x89'), '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': _0x4ba20e, '\x74\x6f\x6b\x65\x6e': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x36')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0xe80500) {
            var _0x2b7166 = _0x3990df[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x3c')];if (_0xa0cf21[wanzikun_0x540f('0xba')](_0xe80500[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x14')], 0x0)) {
              wx[wanzikun_0x540f('0x4f')]({ '\x74\x69\x74\x6c\x65': _0xa0cf21[wanzikun_0x540f('0xbb')], '\x69\x63\x6f\x6e': _0xa0cf21[wanzikun_0x540f('0xbc')], '\x69\x6d\x61\x67\x65': _0xa0cf21[wanzikun_0x540f('0xbd')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });_0x2b7166[_0x4ba20e] = 0x0;_0x3990df[wanzikun_0x540f('0xc')]({ '\x66\x61\x76\x69\x63\x6f\x6e': _0x2b7166 });
            }
          } });
      }
    }_0x2a2d67[wanzikun_0x540f('0xbe')] = this[wanzikun_0x540f('0x15')]['\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c'][_0x18fbda]['\x62\x61\x73\x69\x63\x49\x6e\x66\x6f']['\x77\x65\x69\x67\x68\x74'];_0x4e9bea[wanzikun_0x540f('0x9a')][wanzikun_0x540f('0x3f')](_0x2a2d67);return _0x4e9bea;
  }, '\x67\x65\x74\x67\x67': function getgg(_0x117c53, _0x560993) {
    var _0x31ae2d = { '\x72\x4f\x6c\x59\x6f': wanzikun_0x540f('0xbf') };var _0x116db7 = this;wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')] + _0x31ae2d['\x72\x4f\x6c\x59\x6f'], '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': _0x560993, '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73': _0x117c53 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3ebe97) {
        var _0x2f04ad = _0x116db7[wanzikun_0x540f('0x15')]['\x70\x72\x69\x63\x65\x73'];_0x2f04ad[_0x560993] = _0x3ebe97[wanzikun_0x540f('0x15')][wanzikun_0x540f('0x15')][wanzikun_0x540f('0x85')];_0x116db7[wanzikun_0x540f('0xc')]({ '\x70\x72\x69\x63\x65\x73': _0x2f04ad });
      } });
  }, '\x75\x73\x65\x72\x6c\x6f\x67\x69\x6e': function userlogin(_0x566287) {
    var _0x18a62c = { '\x43\x41\x6c\x55\x50': function CAlUP(_0x4d6cea, _0x3d78b2) {
        return _0x4d6cea != _0x3d78b2;
      }, '\x61\x55\x69\x51\x50': function aUiQP(_0x3d6173, _0x56310e) {
        return _0x3d6173 !== _0x56310e;
      }, '\x65\x55\x76\x72\x41': wanzikun_0x540f('0xc0'), '\x6e\x63\x53\x41\x63': wanzikun_0x540f('0xc1'), '\x42\x57\x67\x66\x4f': function BWgfO(_0x540ce9, _0x1e9419) {
        return _0x540ce9 + _0x1e9419;
      }, '\x69\x50\x4e\x43\x4d': wanzikun_0x540f('0xc2') };var _0x1898e6 = this;var _0x1a2e5f = _0x566287[wanzikun_0x540f('0xc3')]['\x69\x76'];var _0x1f9a07 = _0x566287[wanzikun_0x540f('0xc3')][wanzikun_0x540f('0xc4')];wx[wanzikun_0x540f('0xc5')]({ '\x73\x75\x63\x63\x65\x73\x73': function success(_0x27ef1d) {
        var _0x436a54 = { '\x72\x69\x55\x65\x58': function riUeX(_0x40a3d6, _0x14b18a) {
            return _0x18a62c[wanzikun_0x540f('0xc6')](_0x40a3d6, _0x14b18a);
          }, '\x51\x65\x66\x54\x61': function QefTa(_0x1d0e92, _0x18a0c9) {
            return _0x18a62c[wanzikun_0x540f('0xc7')](_0x1d0e92, _0x18a0c9);
          }, '\x52\x4a\x4e\x4a\x42': wanzikun_0x540f('0xc8'), '\x72\x6d\x53\x67\x52': wanzikun_0x540f('0xc9'), '\x46\x57\x46\x45\x73': '\u6E29\u99A8\u63D0\u793A', '\x64\x59\x64\x6f\x69': _0x18a62c[wanzikun_0x540f('0xca')], '\x71\x67\x59\x44\x70': _0x18a62c[wanzikun_0x540f('0xcb')], '\x56\x73\x63\x63\x45': wanzikun_0x540f('0xcc') };wx[wanzikun_0x540f('0xf')]({ '\x75\x72\x6c': _0x18a62c[wanzikun_0x540f('0xcd')](wanzikun_0x333a4f[wanzikun_0x540f('0x11')][wanzikun_0x540f('0x12')], _0x18a62c['\x69\x50\x4e\x43\x4d']), '\x64\x61\x74\x61': { '\x63\x6f\x64\x65': _0x27ef1d[wanzikun_0x540f('0x14')], '\x65\x6e\x63\x72\x79\x70\x74\x65\x64\x44\x61\x74\x61': _0x1f9a07, '\x69\x76': _0x1a2e5f }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x24edad) {
            if (_0x436a54['\x72\x69\x55\x65\x58'](_0x24edad['\x64\x61\x74\x61'][wanzikun_0x540f('0x14')], 0x0)) {
              if (_0x436a54['\x51\x65\x66\x54\x61'](_0x436a54[wanzikun_0x540f('0xce')], _0x436a54[wanzikun_0x540f('0xcf')])) {
                wx[wanzikun_0x540f('0xd0')]({ '\x74\x69\x74\x6c\x65': _0x436a54[wanzikun_0x540f('0xd1')], '\x63\x6f\x6e\x74\x65\x6e\x74': _0x436a54[wanzikun_0x540f('0xd2')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![], '\x73\x75\x63\x63\x65\x73\x73': function success(_0x24edad) {} });
              } else {
                _0x1898e6['\x73\x65\x74\x69\x64\x73'](ids);
              }
            } else {
              var _0x99addc = _0x436a54['\x71\x67\x59\x44\x70'][wanzikun_0x540f('0x27')]('\x7c'),
                  _0x1b172c = 0x0;while (!![]) {
                switch (_0x99addc[_0x1b172c++]) {case '\x30':
                    wx[wanzikun_0x540f('0xd3')]();continue;case '\x31':
                    wx['\x73\x68\x6f\x77\x54\x6f\x61\x73\x74']({ '\x74\x69\x74\x6c\x65': _0x436a54[wanzikun_0x540f('0xd4')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });continue;case '\x32':
                    _0x1898e6[wanzikun_0x540f('0xc')]({ '\x77\x78\x6c\x6f\x67\x69\x6e': !![] });continue;case '\x33':
                    wanzikun_0x333a4f[wanzikun_0x540f('0x11')]['\x75\x73\x69\x6e\x66\x6f'] = 0x1;continue;case '\x34':
                    wanzikun_0x333a4f[wanzikun_0x540f('0xc5')]();continue;}break;
              }
            }
          } });
      } });
  }, '\x6f\x6e\x53\x68\x61\x72\x65\x41\x70\x70\x4d\x65\x73\x73\x61\x67\x65': function onShareAppMessage() {
    var _0x5b2e14 = { '\x57\x54\x49\x78\x6b': function WTIxk(_0x38d682, _0x44e372) {
        return _0x38d682 + _0x44e372;
      }, '\x74\x76\x52\x78\x7a': '\x2f\x70\x61\x67\x65\x73\x2f\x69\x6e\x64\x65\x78\x2f\x69\x6e\x64\x65\x78' };return { '\x74\x69\x74\x6c\x65': _0x5b2e14[wanzikun_0x540f('0xd5')](_0x5b2e14['\x57\x54\x49\x78\x6b'](wx[wanzikun_0x540f('0x22')](wanzikun_0x540f('0x3')), '\u2014\u2014'), wanzikun_0x333a4f[wanzikun_0x540f('0xd6')][wanzikun_0x540f('0xd7')]), '\x70\x61\x74\x68': _0x5b2e14['\x74\x76\x52\x78\x7a'], '\x73\x75\x63\x63\x65\x73\x73': function success(_0x275966) {}, '\x66\x61\x69\x6c': function fail(_0x1889d0) {} };
  }, '\x67\x65\x74\x43\x6f\x70\x79\x57\x65\x63\x68\x61\x74': function getCopyWechat(_0x24680a) {
    var _0x36adf4 = { '\x50\x54\x6f\x6b\x6c': wanzikun_0x540f('0xa1'), '\x75\x52\x57\x47\x57': '\x6e\x6f\x6e\x65' };var _0x4cb236 = _0x24680a['\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74'][wanzikun_0x540f('0x39')]['\x69\x64'];wx['\x73\x65\x74\x43\x6c\x69\x70\x62\x6f\x61\x72\x64\x44\x61\x74\x61']({ '\x64\x61\x74\x61': _0x4cb236, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3fe25e) {
        wx[wanzikun_0x540f('0x4f')]({ '\x74\x69\x74\x6c\x65': _0x36adf4[wanzikun_0x540f('0xd8')], '\x69\x63\x6f\x6e': _0x36adf4[wanzikun_0x540f('0xd9')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });
      } });
  }, '\x67\x65\x74\x4d\x6f\x72\x65\x41\x70\x70\x54\x61\x70': function getMoreAppTap(_0x1a741e) {
    var _0x55b8fa = { '\x49\x41\x54\x64\x66': function IATdf(_0x234188, _0x2a9bac) {
        return _0x234188 == _0x2a9bac;
      } };var _0x2577a9 = this;var _0x11ce9e = _0x1a741e[wanzikun_0x540f('0x72')][wanzikun_0x540f('0x39')]['\x69\x64'];if (_0x55b8fa['\x49\x41\x54\x64\x66'](_0x11ce9e, 0x1)) {
      _0x2577a9['\x73\x65\x74\x44\x61\x74\x61']({ '\x57\x65\x69\x4c\x61\x69\x4d\x6f\x72\x65\x41\x70\x70': ![] });
    } else {
      _0x2577a9[wanzikun_0x540f('0xc')]({ '\x57\x65\x69\x4c\x61\x69\x4d\x6f\x72\x65\x41\x70\x70': !![] });
    }
  } }); 
 			}); 	require("pages/index/index.js");
 		__wxRoute = 'pages/menu/index';__wxRouteBegin = true; 	define("pages/menu/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x1cf4 = ['\x64\x61\x74\x61', '\x73\x68\x6f\x77\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74', '\x68\x69\x64\x65\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74', '\x72\x65\x71\x75\x65\x73\x74', '\x45\x4e\x4e\x56\x63', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x75\x72\x6c\x73', '\x74\x6f\x6b\x65\x6e', '\x63\x6f\x64\x65', '\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x70\x61\x79', '\x45\x56\x52\x73\x52', '\x52\x6e\x41\x5a\x6d', '\x70\x69\x64', '\x70\x75\x73\x68', '\x68\x6c\x4a\x6a\x65', '\x48\x6e\x6d\x55\x49', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x63\x61\x74\x65\x67\x6f\x72\x79\x2f\x61\x6c\x6c', '\x53\x56\x6d\x79\x61', '\x77\x6c\x4a\x55\x41', '\x63\x4f\x6c\x75\x44', '\x6c\x6f\x67', '\x64\x61\x74\x61\x73\x65\x74', '\x56\x6e\x66\x6b\x52', '\x2f\x70\x61\x67\x65\x73\x2f\x6d\x65\x6e\x75\x2d\x6c\x69\x73\x74\x2f\x69\x6e\x64\x65\x78\x3f\x69\x64\x3d', '\x4a\x55\x69\x4f\x71', '\x6c\x65\x6e\x67\x74\x68', '\x6c\x65\x76\x65\x6c', '\x73\x65\x74\x44\x61\x74\x61', '\x67\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74', '\x55\x70\x42\x64\x45', '\x79\x74\x4c\x68\x63', '\x64\x6f\x67\x42\x79', '\x67\x43\x43\x44\x70', '\x6b\x55\x43\x77\x61', '\x66\x70\x65\x70\x48', '\x55\x46\x6a\x63\x47', '\x6a\x5a\x6b\x4e\x75', '\x73\x68\x6f\x70\x4e\x75\x6d', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x61\x63\x74\x69\x76\x65\x43\x61\x74\x65\x67\x6f\x72\x79\x49\x64', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x4d\x45\x52\x66\x6c', '\x64\x77\x64\x54\x65', '\x7a\x69\x6d\x6e\x71', '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x68\x6c\x73\x59\x46', '\x43\x7a\x6b\x69\x43'];(function (_0x196852, _0x123683) {
  var _0x58e062 = function _0x58e062(_0x372319) {
    while (--_0x372319) {
      _0x196852['push'](_0x196852['shift']());
    }
  };_0x58e062(++_0x123683);
})(wanzikun_0x1cf4, 0xb7);var wanzikun_0x14e7 = function wanzikun_0x14e7(_0x3c51fe, _0x4b4427) {
  _0x3c51fe = _0x3c51fe - 0x0;var _0x4e0539 = wanzikun_0x1cf4[_0x3c51fe];return _0x4e0539;
};var wanzikun_0x53ddd2 = getApp();Page({ '\x64\x61\x74\x61': {}, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    var _0x4f797b = { '\x43\x7a\x6b\x69\x43': function CzkiC(_0x2f8bed, _0x2feb12) {
        return _0x2f8bed > _0x2feb12;
      }, '\x41\x68\x47\x72\x4a': function AhGrJ(_0x450c3c, _0x562afe) {
        return _0x450c3c == _0x562afe;
      }, '\x45\x56\x52\x73\x52': function EVRsR(_0x2047d8, _0x584766) {
        return _0x2047d8 !== _0x584766;
      }, '\x41\x72\x77\x58\x58': function ArwXX(_0x5b7e6a, _0x51c52d) {
        return _0x5b7e6a === _0x51c52d;
      }, '\x69\x75\x42\x72\x69': wanzikun_0x14e7('0x0'), '\x68\x6c\x4a\x6a\x65': wanzikun_0x14e7('0x1'), '\x68\x6c\x73\x59\x46': wanzikun_0x14e7('0x2'), '\x45\x4e\x4e\x56\x63': function ENNVc(_0x6b6491, _0x5c12a7) {
        return _0x6b6491 + _0x5c12a7;
      } };wx['\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65']({ '\x6b\x65\x79': _0x4f797b[wanzikun_0x14e7('0x3')], '\x73\x75\x63\x63\x65\x73\x73': function success(_0x33248a) {
        if (_0x4f797b[wanzikun_0x14e7('0x4')](_0x33248a[wanzikun_0x14e7('0x5')]['\x73\x68\x6f\x70\x4e\x75\x6d'], 0x0)) {
          wx[wanzikun_0x14e7('0x6')]({ '\x69\x6e\x64\x65\x78': 0x2 });
        } else {
          wx[wanzikun_0x14e7('0x7')]({ '\x69\x6e\x64\x65\x78': 0x2 });
        }
      } });wx[wanzikun_0x14e7('0x8')]({ '\x75\x72\x6c': _0x4f797b[wanzikun_0x14e7('0x9')](wanzikun_0x53ddd2[wanzikun_0x14e7('0xa')][wanzikun_0x14e7('0xb')], '\x2f\x6f\x72\x64\x65\x72\x2f\x73\x74\x61\x74\x69\x73\x74\x69\x63\x73'), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x53ddd2[wanzikun_0x14e7('0xa')][wanzikun_0x14e7('0xc')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x1e43fb) {
        if (_0x1e43fb['\x64\x61\x74\x61'][wanzikun_0x14e7('0xd')] == 0x0) {
          if (_0x4f797b[wanzikun_0x14e7('0x4')](_0x1e43fb[wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0xe')], 0x0)) {
            if (_0x4f797b[wanzikun_0x14e7('0xf')](wanzikun_0x14e7('0x10'), '\x41\x62\x57\x54\x68')) {
              wx[wanzikun_0x14e7('0x6')]({ '\x69\x6e\x64\x65\x78': 0x3 });
            } else {
              if (_0x4f797b['\x41\x68\x47\x72\x4a'](_0x1e43fb[wanzikun_0x14e7('0x5')]['\x64\x61\x74\x61'][i][wanzikun_0x14e7('0x11')], categoryId)) {
                categorieslist[wanzikun_0x14e7('0x12')](_0x1e43fb[wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0x5')][i]);
              }
            }
          } else {
            if (_0x4f797b['\x41\x72\x77\x58\x58'](_0x4f797b['\x69\x75\x42\x72\x69'], _0x4f797b[wanzikun_0x14e7('0x13')])) {
              wx[wanzikun_0x14e7('0x6')]({ '\x69\x6e\x64\x65\x78': 0x3 });
            } else {
              wx[wanzikun_0x14e7('0x7')]({ '\x69\x6e\x64\x65\x78': 0x3 });
            }
          }
        }
      } });
  }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad() {
    var _0x21b714 = { '\x52\x48\x64\x71\x68': function RHdqh(_0x239ad5, _0x5a4622) {
        return _0x239ad5 !== _0x5a4622;
      }, '\x63\x4f\x6c\x75\x44': wanzikun_0x14e7('0x14'), '\x4a\x55\x69\x4f\x71': function JUiOq(_0x3597c9, _0x285a21) {
        return _0x3597c9 == _0x285a21;
      }, '\x53\x56\x6d\x79\x61': function SVmya(_0x405634, _0x23de59) {
        return _0x405634 + _0x23de59;
      }, '\x77\x6c\x4a\x55\x41': wanzikun_0x14e7('0x15') };var _0x5064cf = this;wx[wanzikun_0x14e7('0x8')]({ '\x75\x72\x6c': _0x21b714[wanzikun_0x14e7('0x16')](wanzikun_0x53ddd2[wanzikun_0x14e7('0xa')][wanzikun_0x14e7('0xb')], _0x21b714[wanzikun_0x14e7('0x17')]), '\x73\x75\x63\x63\x65\x73\x73': function success(_0x425f7a) {
        var _0x2a897d = { '\x56\x6e\x66\x6b\x52': function VnfkR(_0x54ee76, _0x4ec67c) {
            return _0x54ee76 + _0x4ec67c;
          } };if (_0x21b714['\x52\x48\x64\x71\x68']('\x48\x6e\x6d\x55\x49', _0x21b714[wanzikun_0x14e7('0x18')])) {
          console[wanzikun_0x14e7('0x19')](e['\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74'][wanzikun_0x14e7('0x1a')]['\x69\x64']);wx['\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f']({ '\x75\x72\x6c': _0x2a897d[wanzikun_0x14e7('0x1b')](wanzikun_0x14e7('0x1c'), e['\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74'][wanzikun_0x14e7('0x1a')]['\x69\x64']) });
        } else {
          var _0x48a10c = [];if (_0x21b714[wanzikun_0x14e7('0x1d')](_0x425f7a[wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0xd')], 0x0)) {
            for (var _0x52b32b = 0x0; _0x52b32b < _0x425f7a[wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0x1e')]; _0x52b32b++) {
              if (_0x425f7a['\x64\x61\x74\x61'][wanzikun_0x14e7('0x5')][_0x52b32b][wanzikun_0x14e7('0x1f')] == 0x1) {
                _0x48a10c[wanzikun_0x14e7('0x12')](_0x425f7a[wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0x5')][_0x52b32b]);
              }
            }
          }_0x5064cf[wanzikun_0x14e7('0x20')]({ '\x63\x61\x74\x65\x67\x6f\x72\x69\x65\x73': _0x48a10c, '\x61\x63\x74\x69\x76\x65\x43\x61\x74\x65\x67\x6f\x72\x79\x49\x64': _0x48a10c[0x0]['\x69\x64'] });_0x5064cf[wanzikun_0x14e7('0x21')](_0x48a10c[0x0]['\x69\x64']);
        }
      } });
  }, '\x67\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74': function getGoodsList(_0x19b48e) {
    var _0x4cc0d5 = { '\x6a\x5a\x6b\x4e\x75': function jZkNu(_0x35c07e, _0x29762d) {
        return _0x35c07e > _0x29762d;
      }, '\x67\x43\x43\x44\x70': function gCCDp(_0x33d2da, _0x1fc94d) {
        return _0x33d2da == _0x1fc94d;
      }, '\x41\x71\x4c\x72\x4a': function AqLrJ(_0x4e41ba, _0x3d8464) {
        return _0x4e41ba < _0x3d8464;
      }, '\x6b\x55\x43\x77\x61': function kUCwa(_0x4ec301, _0x25d89d) {
        return _0x4ec301 != _0x25d89d;
      }, '\x55\x46\x6a\x63\x47': wanzikun_0x14e7('0x22'), '\x64\x77\x42\x70\x44': function dwBpD(_0x507ccc, _0x790db0) {
        return _0x507ccc == _0x790db0;
      }, '\x79\x74\x4c\x68\x63': function ytLhc(_0x40c738, _0x142a29) {
        return _0x40c738 == _0x142a29;
      }, '\x64\x6f\x67\x42\x79': function dogBy(_0x385f4f, _0x30272d) {
        return _0x385f4f + _0x30272d;
      } };if (_0x4cc0d5[wanzikun_0x14e7('0x23')](_0x19b48e, 0x0)) {
      _0x19b48e = '';
    }var _0x300ab9 = this;wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x4cc0d5[wanzikun_0x14e7('0x24')](wanzikun_0x53ddd2[wanzikun_0x14e7('0xa')][wanzikun_0x14e7('0xb')], wanzikun_0x14e7('0x15')), '\x73\x75\x63\x63\x65\x73\x73': function success(_0x25de90) {
        var _0x2ee566 = {};var _0x2ff337 = [];if (_0x4cc0d5[wanzikun_0x14e7('0x25')](_0x25de90['\x64\x61\x74\x61'][wanzikun_0x14e7('0xd')], 0x0)) {
          for (var _0x518d20 = 0x0; _0x4cc0d5['\x41\x71\x4c\x72\x4a'](_0x518d20, _0x25de90[wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0x5')]['\x6c\x65\x6e\x67\x74\x68']); _0x518d20++) {
            if (_0x4cc0d5[wanzikun_0x14e7('0x26')](_0x19b48e, '')) {
              if (wanzikun_0x14e7('0x27') === _0x4cc0d5[wanzikun_0x14e7('0x28')]) {
                if (_0x4cc0d5[wanzikun_0x14e7('0x29')](_0x25de90['\x64\x61\x74\x61'][wanzikun_0x14e7('0x2a')], 0x0)) {
                  wx['\x73\x68\x6f\x77\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74']({ '\x69\x6e\x64\x65\x78': 0x2 });
                } else {
                  wx[wanzikun_0x14e7('0x7')]({ '\x69\x6e\x64\x65\x78': 0x2 });
                }
              } else {
                if (_0x4cc0d5['\x64\x77\x42\x70\x44'](_0x25de90[wanzikun_0x14e7('0x5')]['\x64\x61\x74\x61'][_0x518d20]['\x70\x69\x64'], _0x19b48e)) {
                  _0x2ff337[wanzikun_0x14e7('0x12')](_0x25de90[wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0x5')][_0x518d20]);
                }
              }
            } else {
              if (_0x25de90[wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0x5')][_0x518d20][wanzikun_0x14e7('0x11')] != 0x0) {
                _0x2ff337['\x70\x75\x73\x68'](_0x25de90[wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0x5')][_0x518d20]);
              }
            }
          }
        }_0x2ee566[_0x19b48e] = _0x2ff337;_0x300ab9[wanzikun_0x14e7('0x20')]({ '\x63\x61\x74\x65\x67\x6f\x72\x69\x65\x73\x6c\x69\x73\x74': _0x2ff337, '\x63\x61\x74\x65\x67\x6f\x72\x69\x65\x73\x64\x69\x63\x74': _0x2ee566 });
      } });
  }, '\x74\x61\x62\x43\x6c\x69\x63\x6b': function tabClick(_0x1fd157) {
    this['\x73\x65\x74\x44\x61\x74\x61']({ '\x61\x63\x74\x69\x76\x65\x43\x61\x74\x65\x67\x6f\x72\x79\x49\x64': _0x1fd157[wanzikun_0x14e7('0x2b')]['\x69\x64'] });this[wanzikun_0x14e7('0x21')](this[wanzikun_0x14e7('0x5')][wanzikun_0x14e7('0x2c')]);
  }, '\x6c\x65\x76\x65\x6c\x43\x6c\x69\x63\x6b': function levelClick(_0x4eee99) {
    var _0x13cdbf = { '\x4d\x45\x52\x66\x6c': function MERfl(_0x1fdb53, _0x1adb29) {
        return _0x1fdb53 + _0x1adb29;
      } };console['\x6c\x6f\x67'](_0x4eee99[wanzikun_0x14e7('0x2b')]['\x64\x61\x74\x61\x73\x65\x74']['\x69\x64']);wx[wanzikun_0x14e7('0x2d')]({ '\x75\x72\x6c': _0x13cdbf[wanzikun_0x14e7('0x2e')](wanzikun_0x14e7('0x1c'), _0x4eee99[wanzikun_0x14e7('0x2b')][wanzikun_0x14e7('0x1a')]['\x69\x64']) });
  } }); 
 			}); 	require("pages/menu/index.js");
 		__wxRoute = 'pages/shop-cart/index';__wxRouteBegin = true; 	define("pages/shop-cart/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var _typeof = typeof Symbol === "function" && typeof Symbol.iterator === "symbol" ? function (obj) { return typeof obj; } : function (obj) { return obj && typeof Symbol === "function" && obj.constructor === Symbol && obj !== Symbol.prototype ? "symbol" : typeof obj; };

var wanzikun_0x5a00 = ['\x65\x63\x67\x4e\x77', '\x74\x6d\x74\x6a\x4c', '\x50\x48\x69\x42\x42', '\x78\x7a\x63\x64\x57', '\x6d\x68\x73\x4d\x55', '\x58\x75\x55\x46\x4e', '\x67\x65\x74\x53\x79\x73\x74\x65\x6d\x49\x6e\x66\x6f\x53\x79\x6e\x63', '\x77\x69\x6e\x64\x6f\x77\x57\x69\x64\x74\x68', '\x4c\x71\x79\x41\x50', '\x57\x78\x47\x66\x4d', '\x66\x6c\x6f\x6f\x72', '\x7a\x6f\x65\x54\x49', '\x51\x61\x57\x4f\x6c', '\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67', '\x67\x65\x74\x45\x6c\x65\x57\x69\x64\x74\x68', '\x64\x65\x6c\x42\x74\x6e\x57\x69\x64\x74\x68', '\x73\x65\x74\x44\x61\x74\x61', '\x69\x6e\x69\x74\x45\x6c\x65\x57\x69\x64\x74\x68', '\x6f\x6e\x53\x68\x6f\x77', '\x6d\x61\x72\x67\x69\x6e\x2d\x6c\x65\x66\x74\x3a\x2d', '\x6d\x61\x72\x67\x69\x6e\x2d\x6c\x65\x66\x74\x3a\x30\x70\x78', '\x4c\x7a\x76\x4e\x6f', '\x6e\x58\x59\x77\x53', '\x6c\x65\x66\x74\x3a\x2d', '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x42\x42\x55\x70\x55', '\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65', '\x72\x71\x76\x71\x5a', '\x79\x6f\x47\x74\x43', '\x49\x53\x76\x44\x41', '\x64\x61\x74\x61', '\x43\x63\x77\x4f\x6b', '\x72\x6a\x45\x62\x70', '\x73\x68\x6f\x70\x4e\x75\x6d', '\x66\x64\x4c\x50\x6b', '\x77\x61\x76\x71\x67', '\x53\x43\x67\x6a\x50', '\x73\x68\x6f\x77\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74', '\x64\x61\x74\x61\x73\x65\x74', '\x63\x68\x61\x6e\x67\x65\x64\x54\x6f\x75\x63\x68\x65\x73', '\x57\x68\x44\x55\x75', '\x73\x70\x6c\x69\x74', '\x4c\x5a\x47\x5a\x4b', '\x73\x74\x61\x72\x74\x58', '\x63\x6c\x69\x65\x6e\x74\x58', '\x45\x6f\x6c\x52\x7a', '\x4d\x78\x6f\x54\x75', '\x74\x5a\x4a\x79\x49', '\x69\x75\x41\x42\x47', '\x4f\x71\x67\x78\x71', '\x6e\x51\x78\x41\x66', '\x67\x65\x74\x53\x61\x76\x65\x48\x69\x64\x65', '\x74\x6f\x74\x61\x6c\x50\x72\x69\x63\x65', '\x61\x6c\x6c\x53\x65\x6c\x65\x63\x74', '\x6e\x6f\x53\x65\x6c\x65\x63\x74', '\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74', '\x6c\x69\x73\x74', '\x45\x50\x4f\x70\x4c', '\x68\x69\x64\x65\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74', '\x51\x66\x53\x55\x68', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x75\x72\x6c\x73', '\x2f\x6f\x72\x64\x65\x72\x2f\x73\x74\x61\x74\x69\x73\x74\x69\x63\x73', '\x74\x6f\x6b\x65\x6e', '\x76\x71\x4d\x6c\x62', '\x63\x6f\x64\x65', '\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x70\x61\x79', '\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65\x53\x79\x6e\x63', '\x4a\x48\x77\x72\x45', '\x73\x68\x6f\x70\x4c\x69\x73\x74', '\x48\x6a\x6a\x4a\x59', '\x57\x4b\x78\x68\x55', '\x6b\x5a\x66\x75\x4a', '\x73\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74', '\x2f\x70\x61\x67\x65\x73\x2f\x69\x6e\x64\x65\x78\x2f\x69\x6e\x64\x65\x78', '\x64\x76\x58\x4e\x77', '\x68\x57\x7a\x75\x61', '\x6c\x65\x6e\x67\x74\x68', '\x77\x5a\x46\x43\x6f', '\x72\x4a\x6e\x58\x67', '\x77\x46\x6e\x41\x72', '\x74\x6f\x75\x63\x68\x65\x73', '\x7a\x4b\x77\x74\x6e', '\x56\x6d\x66\x4a\x44', '\x4b\x65\x44\x78\x51', '\x43\x77\x73\x5a\x69', '\x68\x71\x66\x55\x79', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x4c\x4f\x41\x63\x77', '\x45\x55\x7a\x69\x76', '\x4d\x67\x64\x77\x64', '\x78\x75\x5a\x77\x52', '\x76\x64\x56\x6e\x7a', '\x52\x78\x72\x55\x54', '\x77\x6d\x6c\x71\x57', '\x67\x4b\x55\x6d\x75', '\x43\x42\x49\x51\x71', '\x47\x79\x50\x79\x4c', '\x51\x74\x6d\x47\x76', '\x74\x4f\x68\x6d\x4d', '\x61\x63\x74\x69\x76\x65', '\x6c\x65\x66\x74', '\x63\x43\x77\x4e\x46', '\x6d\x55\x6a\x4e\x50', '\x6f\x52\x6f\x55\x65', '\x69\x6e\x64\x65\x78', '\x6d\x44\x45\x73\x78', '\x46\x69\x4a\x46\x65', '\x64\x58\x72\x63\x62', '\x51\x4d\x41\x75\x6f', '\x6f\x72\x78\x44\x57', '\x57\x79\x58\x62\x70', '\x78\x75\x43\x71\x67', '\x49\x51\x55\x6e\x50', '\x50\x76\x4d\x61\x4c', '\x53\x64\x68\x75\x74', '\x6e\x72\x77\x65\x45', '\x67\x6c\x75\x44\x50', '\x73\x70\x6c\x69\x63\x65', '\x49\x5a\x45\x6a\x53', '\x45\x44\x57\x65\x54', '\x48\x73\x73\x6d\x66', '\x65\x46\x77\x58\x42', '\x6a\x6f\x79\x64\x6c', '\x57\x72\x4f\x6f\x6e', '\x68\x47\x50\x46\x68', '\x79\x71\x64\x66\x65', '\x43\x50\x7a\x46\x52', '\x65\x57\x45\x48\x78', '\x77\x77\x46\x6c\x48', '\x70\x72\x69\x63\x65', '\x77\x46\x44\x54\x4e', '\x64\x76\x64\x76\x74', '\x6e\x75\x6d\x62\x65\x72', '\x74\x6f\x46\x69\x78\x65\x64', '\x2f\x70\x61\x67\x65\x73\x2f\x74\x6f\x2d\x70\x61\x79\x2d\x6f\x72\x64\x65\x72\x2f\x69\x6e\x64\x65\x78', '\x71\x61\x52\x44\x6f', '\x62\x6e\x4c\x79\x73', '\x48\x74\x4d\x65\x75', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x62\x73\x49\x57\x70', '\x72\x59\x73\x43\x73', '\x75\x57\x6a\x77\x49', '\x61\x65\x78\x73\x41', '\x54\x62\x5a\x74\x62', '\x78\x73\x5a\x4f\x74', '\x59\x67\x54\x71\x59', '\x61\x48\x70\x62\x6b', '\x56\x6a\x55\x58\x46', '\x69\x4a\x4d\x62\x4f', '\x73\x65\x74\x53\x74\x6f\x72\x61\x67\x65', '\x54\x4e\x53\x6d\x42', '\x5a\x67\x76\x42\x57', '\x63\x49\x55\x77\x46', '\x47\x58\x46\x45\x79', '\x78\x48\x63\x79\x58', '\x76\x45\x67\x5a\x52', '\x78\x62\x42\x56\x6c', '\x68\x68\x46\x4e\x47', '\x48\x4b\x58\x6d\x4a', '\x49\x4a\x56\x53\x59', '\x4e\x6a\x6e\x79\x54', '\x68\x58\x6b\x6e\x45', '\x49\x71\x48\x4a\x45', '\x6f\x59\x42\x4a\x4c', '\x79\x62\x73\x4d\x56', '\x52\x6c\x7a\x72\x6c', '\x46\x64\x50\x58\x69', '\x5a\x6e\x45\x56\x75', '\x58\x59\x64\x72\x67', '\x69\x57\x47\x4b\x46', '\x4b\x47\x47\x78\x50', '\x69\x71\x57\x65\x63', '\x62\x43\x4b\x41\x50', '\x73\x61\x76\x65\x48\x69\x64\x64\x65\x6e', '\x66\x69\x6c\x74\x65\x72', '\x65\x6b\x63\x68\x46', '\x49\x6e\x72\x4b\x74', ' \u5546\u54C1\u5DF2\u5931\u6548\uFF0C\u8BF7\u91CD\u65B0\u8D2D\u4E70', '\x78\x65\x4b\x49\x4b', ' \u5E93\u5B58\u4E0D\u8DB3\uFF0C\u8BF7\u91CD\u65B0\u8D2D\u4E70', '\x61\x75\x41\x67\x4c', '\x79\x44\x63\x7a\x41', '\x50\x57\x4d\x52\x6c', '\x43\x67\x41\x63\x64', '\x4c\x61\x41\x68\x4f', '\x59\x79\x65\x64\x6e', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x70\x72\x69\x63\x65', '\x73\x68\x6f\x77\x4c\x6f\x61\x64\x69\x6e\x67', '\x61\x62\x61\x6d\x50', '\x44\x4b\x51\x4e\x49', '\x66\x45\x68\x4a\x52', '\x54\x46\x61\x70\x47', '\x73\x6b\x66\x6c\x53', '\x4a\x49\x57\x61\x42', '\x4c\x4c\x59\x77\x43', '\x6c\x62\x74\x6a\x4e', '\x50\x5a\x58\x52\x72', '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73', '\x47\x6c\x74\x63\x6b', '\x6f\x64\x7a\x7a\x4f', '\x68\x79\x52\x51\x65', '\x72\x65\x71\x75\x65\x73\x74', '\x66\x61\x6f\x4e\x79', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x64\x65\x74\x61\x69\x6c', '\x67\x6f\x6f\x64\x73\x49\x64', '\x77\x4f\x6f\x55\x6a', '\x4f\x44\x79\x4c\x6e', '\x44\x72\x4e\x65\x57', '\x4f\x4a\x57\x48\x71', '\x70\x72\x6f\x70\x65\x72\x74\x69\x65\x73', '\x74\x73\x56\x58\x6f', '\x73\x56\x55\x4d\x4d', '\x62\x61\x73\x69\x63\x49\x6e\x66\x6f', '\x6e\x61\x6d\x65', '\x57\x52\x64\x73\x6a', '\x54\x6c\x67\x55\x71', '\x64\x51\x44\x7a\x54', '\x4a\x71\x4d\x4a\x6d', '\x79\x55\x6f\x41\x6d', '\x74\x5a\x61\x4a\x6b', '\x66\x46\x67\x63\x6a', '\x73\x74\x6f\x72\x65\x73', '\x61\x6d\x6b\x74\x56', '\x64\x64\x64\x66\x73', '\x5a\x64\x6b\x55\x57', '\x47\x59\x6a\x51\x58', '\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c', '\x6d\x69\x6e\x50\x72\x69\x63\x65', ' \u4EF7\u683C\u6709\u8C03\u6574\uFF0C\u8BF7\u91CD\u65B0\u8D2D\u4E70', '\x70\x4d\x4c\x56\x6d', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f\x50\x61\x79\x4f\x72\x64\x65\x72', '\x4a\x69\x54\x7a\x4b', '\x50\x62\x68\x44\x50', '\x54\x72\x6b\x5a\x4b', '\x56\x66\x58\x77\x6d', '\x69\x44\x6a\x58\x56', '\x67\x58\x54\x65\x63', '\x53\x66\x79\x4f\x67', '\x55\x61\x44\x49\x52', '\x6f\x5a\x4a\x51\x6e', '\x55\x6b\x48\x66\x4d', '\x70\x49\x56\x45\x58'];(function (_0x2d8f05, _0x4b81bb) {
  var _0x4d74cb = function _0x4d74cb(_0x32719f) {
    while (--_0x32719f) {
      _0x2d8f05['push'](_0x2d8f05['shift']());
    }
  };_0x4d74cb(++_0x4b81bb);
})(wanzikun_0x5a00, 0x1eb);var wanzikun_0x38af = function wanzikun_0x38af(_0xe444db, _0x1633c0) {
  _0xe444db = _0xe444db - 0x0;var _0x2b5be9 = wanzikun_0x5a00[_0xe444db];return _0x2b5be9;
};var wanzikun_0x49c022 = getApp();Page({ '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74': { '\x73\x61\x76\x65\x48\x69\x64\x64\x65\x6e': !![], '\x74\x6f\x74\x61\x6c\x50\x72\x69\x63\x65': 0x0, '\x61\x6c\x6c\x53\x65\x6c\x65\x63\x74': !![], '\x6e\x6f\x53\x65\x6c\x65\x63\x74': ![], '\x6c\x69\x73\x74': [] }, '\x64\x65\x6c\x42\x74\x6e\x57\x69\x64\x74\x68': 0x78 }, '\x67\x65\x74\x45\x6c\x65\x57\x69\x64\x74\x68': function getEleWidth(_0x3dc850) {
    var _0x16189c = { '\x4c\x71\x79\x41\x50': function LqyAP(_0x301ca2, _0x128fce) {
        return _0x301ca2 / _0x128fce;
      }, '\x57\x78\x47\x66\x4d': function WxGfM(_0x26a0b1, _0x419a9a) {
        return _0x26a0b1 / _0x419a9a;
      }, '\x7a\x6f\x65\x54\x49': function zoeTI(_0x57c548, _0x1dcc55) {
        return _0x57c548 / _0x1dcc55;
      }, '\x64\x4d\x61\x52\x74': function dMaRt(_0x739c6b, _0x28eaa7) {
        return _0x739c6b === _0x28eaa7;
      }, '\x51\x61\x57\x4f\x6c': wanzikun_0x38af('0x0') };var _0x38b9cd = 0x0;try {
      var _0x5c55d5 = wx[wanzikun_0x38af('0x1')]()[wanzikun_0x38af('0x2')];var _0x1d352f = _0x16189c[wanzikun_0x38af('0x3')](_0x16189c[wanzikun_0x38af('0x4')](0x2ee, 0x2), _0x16189c[wanzikun_0x38af('0x4')](_0x3dc850, 0x2));_0x38b9cd = Math[wanzikun_0x38af('0x5')](_0x16189c[wanzikun_0x38af('0x6')](_0x5c55d5, _0x1d352f));return _0x38b9cd;
    } catch (_0x4ba3f8) {
      if (_0x16189c['\x64\x4d\x61\x52\x74'](_0x16189c[wanzikun_0x38af('0x7')], _0x16189c[wanzikun_0x38af('0x7')])) {
        return ![];
      } else {
        wx[wanzikun_0x38af('0x8')]();return;
      }
    }
  }, '\x69\x6e\x69\x74\x45\x6c\x65\x57\x69\x64\x74\x68': function initEleWidth() {
    var _0x9df575 = this[wanzikun_0x38af('0x9')](this['\x64\x61\x74\x61'][wanzikun_0x38af('0xa')]);this[wanzikun_0x38af('0xb')]({ '\x64\x65\x6c\x42\x74\x6e\x57\x69\x64\x74\x68': _0x9df575 });
  }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad() {
    this[wanzikun_0x38af('0xc')]();this[wanzikun_0x38af('0xd')]();
  }, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    var _0x4fb8fc = { '\x4f\x4b\x4b\x4e\x52': '\x31\x7c\x30\x7c\x33\x7c\x32\x7c\x35\x7c\x34', '\x59\x62\x5a\x78\x7a': function YbZxz(_0x1ef718, _0x1c688a) {
        return _0x1ef718 - _0x1c688a;
      }, '\x72\x71\x76\x71\x5a': function rqvqZ(_0x39d4e4, _0x288213) {
        return _0x39d4e4 + _0x288213;
      }, '\x79\x6f\x47\x74\x43': wanzikun_0x38af('0xe'), '\x71\x67\x42\x74\x77': wanzikun_0x38af('0xf'), '\x49\x53\x76\x44\x41': function ISvDA(_0x1db7ca, _0x2dd1a9) {
        return _0x1db7ca(_0x2dd1a9);
      }, '\x43\x63\x77\x4f\x6b': wanzikun_0x38af('0x10'), '\x72\x6a\x45\x62\x70': function rjEbp(_0x2fd513, _0x4d59f7) {
        return _0x2fd513 > _0x4d59f7;
      }, '\x66\x64\x4c\x50\x6b': function fdLPk(_0x5cc051, _0x48ee4e) {
        return _0x5cc051 !== _0x48ee4e;
      }, '\x53\x43\x67\x6a\x50': '\x6c\x4f\x67\x73\x73', '\x4b\x70\x53\x6a\x76': function KpSjv(_0x316041, _0x3cdd2d) {
        return _0x316041 === _0x3cdd2d;
      }, '\x45\x50\x4f\x70\x4c': wanzikun_0x38af('0x11'), '\x76\x71\x4d\x6c\x62': function vqMlb(_0x4a104e, _0xf9a43d) {
        return _0x4a104e == _0xf9a43d;
      }, '\x48\x6a\x6a\x4a\x59': function HjjJY(_0x3703f2, _0x44b2a1) {
        return _0x3703f2 + _0x44b2a1;
      }, '\x72\x45\x4e\x75\x73': function rENus(_0x334d12, _0x49fc0b) {
        return _0x334d12 + _0x49fc0b;
      }, '\x57\x4b\x78\x68\x55': function WKxhU(_0x4cdba5, _0x45dea8) {
        return _0x4cdba5 + _0x45dea8;
      }, '\x6b\x5a\x66\x75\x4a': wanzikun_0x38af('0x12'), '\x51\x66\x53\x55\x68': function QfSUh(_0x59bfb4, _0x449eab) {
        return _0x59bfb4 + _0x449eab;
      }, '\x4a\x48\x77\x72\x45': wanzikun_0x38af('0x13'), '\x6d\x51\x6a\x57\x7a': function mQjWz(_0x50aa82, _0x29db27) {
        return _0x50aa82 === _0x29db27;
      }, '\x4e\x46\x59\x5a\x6b': wanzikun_0x38af('0x14') };wx[wanzikun_0x38af('0x15')]({ '\x6b\x65\x79': wanzikun_0x38af('0x13'), '\x73\x75\x63\x63\x65\x73\x73': function success(_0x40f9ed) {
        var _0x4921d3 = { '\x57\x68\x44\x55\x75': _0x4fb8fc['\x4f\x4b\x4b\x4e\x52'], '\x4c\x5a\x47\x5a\x4b': function LZGZK(_0x3390ac, _0x42034e) {
            return _0x4fb8fc['\x59\x62\x5a\x78\x7a'](_0x3390ac, _0x42034e);
          }, '\x63\x6a\x4a\x53\x6a': function cjJSj(_0x1b78c1, _0x2e005c) {
            return _0x1b78c1 / _0x2e005c;
          }, '\x45\x6f\x6c\x52\x7a': function EolRz(_0x50a452, _0x15ecf3) {
            return _0x4fb8fc[wanzikun_0x38af('0x16')](_0x50a452, _0x15ecf3);
          }, '\x4d\x78\x6f\x54\x75': _0x4fb8fc[wanzikun_0x38af('0x17')], '\x74\x5a\x4a\x79\x49': _0x4fb8fc['\x71\x67\x42\x74\x77'], '\x69\x75\x41\x42\x47': function iuABG(_0x5bdbb6, _0x2e6d30) {
            return _0x5bdbb6 !== _0x2e6d30;
          }, '\x4f\x71\x67\x78\x71': function Oqgxq(_0x55f2a3, _0x17f773) {
            return _0x55f2a3 != _0x17f773;
          }, '\x6e\x51\x78\x41\x66': function nQxAf(_0x268f57, _0x3a631b) {
            return _0x4fb8fc[wanzikun_0x38af('0x18')](_0x268f57, _0x3a631b);
          } };if (_0x40f9ed[wanzikun_0x38af('0x19')]) {
          if (_0x4fb8fc[wanzikun_0x38af('0x1a')] === _0x4fb8fc[wanzikun_0x38af('0x1a')]) {
            if (_0x4fb8fc[wanzikun_0x38af('0x1b')](_0x40f9ed[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x1c')], 0x0)) {
              if (_0x4fb8fc[wanzikun_0x38af('0x1d')](wanzikun_0x38af('0x1e'), _0x4fb8fc[wanzikun_0x38af('0x1f')])) {
                wx[wanzikun_0x38af('0x20')]({ '\x69\x6e\x64\x65\x78': 0x2 });
              } else {
                var _0x2a9f72 = e['\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74'][wanzikun_0x38af('0x21')]['\x69\x6e\x64\x65\x78'];if (e[wanzikun_0x38af('0x22')]['\x6c\x65\x6e\x67\x74\x68'] == 0x1) {
                  var _0x4fe033 = _0x4921d3[wanzikun_0x38af('0x23')][wanzikun_0x38af('0x24')]('\x7c'),
                      _0x181807 = 0x0;while (!![]) {
                    switch (_0x4fe033[_0x181807++]) {case '\x30':
                        var _0x55bb24 = _0x4921d3[wanzikun_0x38af('0x25')](this['\x64\x61\x74\x61'][wanzikun_0x38af('0x26')], _0x4bef2f);continue;case '\x31':
                        var _0x4bef2f = e[wanzikun_0x38af('0x22')][0x0][wanzikun_0x38af('0x27')];continue;case '\x32':
                        var _0x4c8897 = _0x55bb24 > _0x4921d3['\x63\x6a\x4a\x53\x6a'](_0x5bbda7, 0x2) ? _0x4921d3[wanzikun_0x38af('0x28')](_0x4921d3['\x45\x6f\x6c\x52\x7a'](_0x4921d3[wanzikun_0x38af('0x29')], _0x5bbda7), '\x70\x78') : _0x4921d3[wanzikun_0x38af('0x2a')];continue;case '\x33':
                        var _0x5bbda7 = this[wanzikun_0x38af('0x19')]['\x64\x65\x6c\x42\x74\x6e\x57\x69\x64\x74\x68'];continue;case '\x34':
                        if (_0x4921d3[wanzikun_0x38af('0x2b')](_0x2a9f72, '') && _0x4921d3[wanzikun_0x38af('0x2c')](_0x2a9f72, null)) {
                          _0x22dd60[_0x4921d3[wanzikun_0x38af('0x2d')](parseInt, _0x2a9f72)]['\x6c\x65\x66\x74'] = _0x4c8897;this['\x73\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74'](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this[wanzikun_0x38af('0x31')](), _0x22dd60);
                        }continue;case '\x35':
                        var _0x22dd60 = this['\x64\x61\x74\x61'][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];continue;}break;
                  }
                }
              }
            } else {
              if (_0x4fb8fc['\x4b\x70\x53\x6a\x76'](_0x4fb8fc[wanzikun_0x38af('0x34')], _0x4fb8fc[wanzikun_0x38af('0x34')])) {
                wx[wanzikun_0x38af('0x35')]({ '\x69\x6e\x64\x65\x78': 0x2 });
              } else {
                return entity['\x61\x63\x74\x69\x76\x65'];
              }
            }
          } else {
            allSelect = !![];
          }
        } else {
          wx[wanzikun_0x38af('0x35')]({ '\x69\x6e\x64\x65\x78': 0x2 });
        }
      } });wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x4fb8fc[wanzikun_0x38af('0x36')](wanzikun_0x49c022[wanzikun_0x38af('0x37')][wanzikun_0x38af('0x38')], wanzikun_0x38af('0x39')), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x49c022[wanzikun_0x38af('0x37')][wanzikun_0x38af('0x3a')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x53eb91) {
        if (_0x4fb8fc[wanzikun_0x38af('0x3b')](_0x53eb91['\x64\x61\x74\x61'][wanzikun_0x38af('0x3c')], 0x0)) {
          if (_0x4fb8fc[wanzikun_0x38af('0x1b')](_0x53eb91[wanzikun_0x38af('0x19')]['\x64\x61\x74\x61'][wanzikun_0x38af('0x3d')], 0x0)) {
            wx['\x73\x68\x6f\x77\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74']({ '\x69\x6e\x64\x65\x78': 0x3 });
          } else {
            wx[wanzikun_0x38af('0x35')]({ '\x69\x6e\x64\x65\x78': 0x3 });
          }
        }
      } });var _0x3b4ed6 = [];var _0x496821 = wx[wanzikun_0x38af('0x3e')](_0x4fb8fc[wanzikun_0x38af('0x3f')]);if (_0x496821 && _0x496821[wanzikun_0x38af('0x40')]) {
      if (_0x4fb8fc['\x6d\x51\x6a\x57\x7a'](_0x4fb8fc['\x4e\x46\x59\x5a\x6b'], _0x4fb8fc['\x4e\x46\x59\x5a\x6b'])) {
        _0x3b4ed6 = _0x496821[wanzikun_0x38af('0x40')];
      } else {
        left = _0x4fb8fc[wanzikun_0x38af('0x16')](_0x4fb8fc[wanzikun_0x38af('0x41')](_0x4fb8fc['\x79\x6f\x47\x74\x43'], disX), '\x70\x78');if (disX >= delBtnWidth) {
          left = _0x4fb8fc['\x72\x45\x4e\x75\x73'](_0x4fb8fc[wanzikun_0x38af('0x42')](_0x4fb8fc[wanzikun_0x38af('0x43')], delBtnWidth), '\x70\x78');
        }
      }
    }this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')] = _0x3b4ed6;this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this[wanzikun_0x38af('0x31')](), _0x3b4ed6);
  }, '\x74\x6f\x49\x6e\x64\x65\x78\x50\x61\x67\x65': function toIndexPage() {
    var _0x424a23 = { '\x56\x79\x79\x75\x4f': wanzikun_0x38af('0x45') };wx['\x73\x77\x69\x74\x63\x68\x54\x61\x62']({ '\x75\x72\x6c': _0x424a23['\x56\x79\x79\x75\x4f'] });
  }, '\x74\x6f\x75\x63\x68\x53': function touchS(_0x336727) {
    var _0x1ddaf7 = { '\x7a\x4b\x77\x74\x6e': function zKwtn(_0x4bbe1e, _0x412cf1) {
        return _0x4bbe1e < _0x412cf1;
      }, '\x56\x6d\x66\x4a\x44': function VmfJD(_0x1296ef, _0x1af939) {
        return _0x1296ef(_0x1af939);
      }, '\x4b\x65\x44\x78\x51': function KeDxQ(_0x3ee99c, _0x28927e) {
        return _0x3ee99c(_0x28927e);
      }, '\x42\x46\x74\x71\x51': function BFtqQ(_0x379d01, _0x4de9cb) {
        return _0x379d01 == _0x4de9cb;
      }, '\x77\x5a\x46\x43\x6f': function wZFCo(_0x2a63b8, _0x3e827c) {
        return _0x2a63b8 !== _0x3e827c;
      }, '\x72\x4a\x6e\x58\x67': wanzikun_0x38af('0x46'), '\x77\x46\x6e\x41\x72': wanzikun_0x38af('0x47') };if (_0x1ddaf7['\x42\x46\x74\x71\x51'](_0x336727['\x74\x6f\x75\x63\x68\x65\x73'][wanzikun_0x38af('0x48')], 0x1)) {
      if (_0x1ddaf7[wanzikun_0x38af('0x49')](_0x1ddaf7[wanzikun_0x38af('0x4a')], _0x1ddaf7[wanzikun_0x38af('0x4b')])) {
        this[wanzikun_0x38af('0xb')]({ '\x73\x74\x61\x72\x74\x58': _0x336727[wanzikun_0x38af('0x4c')][0x0][wanzikun_0x38af('0x27')] });
      } else {
        if (_0x1ddaf7[wanzikun_0x38af('0x4d')](list[_0x1ddaf7[wanzikun_0x38af('0x4e')](parseInt, index)]['\x6e\x75\x6d\x62\x65\x72'], 0xa)) {
          list[_0x1ddaf7[wanzikun_0x38af('0x4f')](parseInt, index)]['\x6e\x75\x6d\x62\x65\x72']++;this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this[wanzikun_0x38af('0x31')](), list);
        }
      }
    }
  }, '\x74\x6f\x75\x63\x68\x4d': function touchM(_0x605563) {
    var _0x3c5449 = { '\x74\x4f\x68\x6d\x4d': function tOhmM(_0x29434d, _0x3b021c) {
        return _0x29434d < _0x3b021c;
      }, '\x4c\x4f\x41\x63\x77': function LOAcw(_0x2ed193, _0x32a024) {
        return _0x2ed193 == _0x32a024;
      }, '\x45\x55\x7a\x69\x76': function EUziv(_0xfe3a87, _0x554c8e) {
        return _0xfe3a87 < _0x554c8e;
      }, '\x4d\x67\x64\x77\x64': wanzikun_0x38af('0xf'), '\x78\x75\x5a\x77\x52': wanzikun_0x38af('0x50'), '\x76\x64\x56\x6e\x7a': function vdVnz(_0x1f35b1, _0x3055fa) {
        return _0x1f35b1 + _0x3055fa;
      }, '\x52\x78\x72\x55\x54': wanzikun_0x38af('0xe'), '\x77\x6d\x6c\x71\x57': function wmlqW(_0x5164e8, _0x34d63d) {
        return _0x5164e8 >= _0x34d63d;
      }, '\x67\x4b\x55\x6d\x75': function gKUmu(_0x1e8ba0, _0x4ed8e7) {
        return _0x1e8ba0 !== _0x4ed8e7;
      }, '\x65\x76\x46\x47\x75': wanzikun_0x38af('0x51'), '\x44\x6f\x50\x41\x6a': wanzikun_0x38af('0x12'), '\x47\x79\x50\x79\x4c': function GyPyL(_0x58804c, _0xd7b38a) {
        return _0x58804c != _0xd7b38a;
      }, '\x79\x6f\x70\x64\x76': function yopdv(_0x160950, _0x2e9d31) {
        return _0x160950 != _0x2e9d31;
      }, '\x51\x74\x6d\x47\x76': '\x51\x57\x56\x41\x63' };var _0x17e4df = _0x605563[wanzikun_0x38af('0x52')][wanzikun_0x38af('0x21')]['\x69\x6e\x64\x65\x78'];if (_0x3c5449['\x4c\x4f\x41\x63\x77'](_0x605563[wanzikun_0x38af('0x4c')][wanzikun_0x38af('0x48')], 0x1)) {
      var _0x5c6ae1 = _0x605563[wanzikun_0x38af('0x4c')][0x0]['\x63\x6c\x69\x65\x6e\x74\x58'];var _0x4cdfd3 = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x26')] - _0x5c6ae1;var _0x2edb03 = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0xa')];var _0x59cfb0 = '';if (_0x3c5449[wanzikun_0x38af('0x53')](_0x4cdfd3, 0x0) || _0x3c5449[wanzikun_0x38af('0x54')](_0x4cdfd3, 0x0)) {
        _0x59cfb0 = _0x3c5449[wanzikun_0x38af('0x55')];
      } else if (_0x4cdfd3 > 0x0) {
        if (_0x3c5449[wanzikun_0x38af('0x56')] === _0x3c5449['\x78\x75\x5a\x77\x52']) {
          _0x59cfb0 = _0x3c5449[wanzikun_0x38af('0x57')](_0x3c5449[wanzikun_0x38af('0x57')](_0x3c5449[wanzikun_0x38af('0x58')], _0x4cdfd3), '\x70\x78');if (_0x3c5449[wanzikun_0x38af('0x59')](_0x4cdfd3, _0x2edb03)) {
            if (_0x3c5449[wanzikun_0x38af('0x5a')](wanzikun_0x38af('0x5b'), _0x3c5449['\x65\x76\x46\x47\x75'])) {
              _0x59cfb0 = _0x3c5449['\x44\x6f\x50\x41\x6a'] + _0x2edb03 + '\x70\x78';
            } else {
              var _0x1c6d69 = this['\x64\x61\x74\x61'][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];for (var _0xa2abd2 = 0x0; _0x3c5449['\x74\x4f\x68\x6d\x4d'](_0xa2abd2, _0x1c6d69[wanzikun_0x38af('0x48')]); _0xa2abd2++) {
                var _0x2756f0 = _0x1c6d69[_0xa2abd2];_0x2756f0['\x61\x63\x74\x69\x76\x65'] = ![];
              }this[wanzikun_0x38af('0x44')](!this[wanzikun_0x38af('0x2e')](), this['\x74\x6f\x74\x61\x6c\x50\x72\x69\x63\x65'](), this[wanzikun_0x38af('0x30')](), this['\x6e\x6f\x53\x65\x6c\x65\x63\x74'](), _0x1c6d69);
            }
          }
        } else {
          wx['\x73\x68\x6f\x77\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74']({ '\x69\x6e\x64\x65\x78': 0x3 });
        }
      }var _0xeac46f = this['\x64\x61\x74\x61'][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];if (_0x3c5449[wanzikun_0x38af('0x5c')](_0x17e4df, '') && _0x3c5449['\x79\x6f\x70\x64\x76'](_0x17e4df, null)) {
        if (_0x3c5449[wanzikun_0x38af('0x5d')] !== _0x3c5449['\x51\x74\x6d\x47\x76']) {
          var _0x3ed760 = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];for (var _0xb74ebe = 0x0; _0x3c5449[wanzikun_0x38af('0x5e')](_0xb74ebe, _0x3ed760[wanzikun_0x38af('0x48')]); _0xb74ebe++) {
            var _0x39f785 = _0x3ed760[_0xb74ebe];_0x39f785[wanzikun_0x38af('0x5f')] = !![];
          }this[wanzikun_0x38af('0x44')](!this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this[wanzikun_0x38af('0x31')](), _0x3ed760);
        } else {
          _0xeac46f[parseInt(_0x17e4df)][wanzikun_0x38af('0x60')] = _0x59cfb0;this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this['\x6e\x6f\x53\x65\x6c\x65\x63\x74'](), _0xeac46f);
        }
      }
    }
  }, '\x74\x6f\x75\x63\x68\x45': function touchE(_0x1c3d32) {
    var _0x4a0735 = { '\x50\x76\x4d\x61\x4c': function PvMaL(_0x50013c, _0x539b59) {
        return _0x50013c / _0x539b59;
      }, '\x53\x64\x68\x75\x74': function Sdhut(_0xc29a0f, _0x580d6e) {
        return _0xc29a0f / _0x580d6e;
      }, '\x6e\x72\x77\x65\x45': function nrweE(_0x17e3ed, _0x420901) {
        return _0x17e3ed / _0x420901;
      }, '\x47\x4f\x48\x6a\x74': function GOHjt(_0x3438ca, _0x4ce366) {
        return _0x3438ca == _0x4ce366;
      }, '\x70\x74\x53\x73\x61': wanzikun_0x38af('0x61'), '\x6d\x44\x45\x73\x78': wanzikun_0x38af('0x62'), '\x46\x69\x4a\x46\x65': function FiJFe(_0x5dea42, _0xed2e53) {
        return _0x5dea42 - _0xed2e53;
      }, '\x64\x58\x72\x63\x62': function dXrcb(_0x454342, _0x4defa2) {
        return _0x454342 > _0x4defa2;
      }, '\x51\x4d\x41\x75\x6f': function QMAuo(_0x47e36d, _0x686103) {
        return _0x47e36d + _0x686103;
      }, '\x6f\x72\x78\x44\x57': wanzikun_0x38af('0xe'), '\x57\x79\x58\x62\x70': wanzikun_0x38af('0xf'), '\x78\x75\x43\x71\x67': function xuCqg(_0xbdb714, _0x14f354) {
        return _0xbdb714 !== _0x14f354;
      }, '\x49\x51\x55\x6e\x50': wanzikun_0x38af('0x63'), '\x67\x6c\x75\x44\x50': function gluDP(_0x5bbeae, _0xd7fa19) {
        return _0x5bbeae(_0xd7fa19);
      } };var _0x3b6f8f = _0x1c3d32[wanzikun_0x38af('0x52')][wanzikun_0x38af('0x21')][wanzikun_0x38af('0x64')];if (_0x4a0735['\x47\x4f\x48\x6a\x74'](_0x1c3d32['\x63\x68\x61\x6e\x67\x65\x64\x54\x6f\x75\x63\x68\x65\x73'][wanzikun_0x38af('0x48')], 0x1)) {
      if (_0x4a0735['\x70\x74\x53\x73\x61'] === _0x4a0735[wanzikun_0x38af('0x65')]) {
        var _0x38ecdf = _0x51ed14[i];_0x38ecdf['\x61\x63\x74\x69\x76\x65'] = ![];
      } else {
        var _0x298f05 = _0x1c3d32[wanzikun_0x38af('0x22')][0x0][wanzikun_0x38af('0x27')];var _0x4478d1 = _0x4a0735[wanzikun_0x38af('0x66')](this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x26')], _0x298f05);var _0x5abb79 = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0xa')];var _0x2a7ddb = _0x4a0735[wanzikun_0x38af('0x67')](_0x4478d1, _0x5abb79 / 0x2) ? _0x4a0735[wanzikun_0x38af('0x68')](_0x4a0735[wanzikun_0x38af('0x69')], _0x5abb79) + '\x70\x78' : _0x4a0735[wanzikun_0x38af('0x6a')];var _0x51ed14 = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];if (_0x4a0735[wanzikun_0x38af('0x6b')](_0x3b6f8f, '') && _0x3b6f8f != null) {
          if (wanzikun_0x38af('0x63') !== _0x4a0735[wanzikun_0x38af('0x6c')]) {
            var _0xacb7d1 = wx['\x67\x65\x74\x53\x79\x73\x74\x65\x6d\x49\x6e\x66\x6f\x53\x79\x6e\x63']()[wanzikun_0x38af('0x2')];var _0x386663 = _0x4a0735[wanzikun_0x38af('0x6d')](_0x4a0735[wanzikun_0x38af('0x6e')](0x2ee, 0x2), _0x4a0735[wanzikun_0x38af('0x6f')](w, 0x2));real = Math[wanzikun_0x38af('0x5')](_0xacb7d1 / _0x386663);return real;
          } else {
            _0x51ed14[_0x4a0735[wanzikun_0x38af('0x70')](parseInt, _0x3b6f8f)][wanzikun_0x38af('0x60')] = _0x2a7ddb;this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this['\x6e\x6f\x53\x65\x6c\x65\x63\x74'](), _0x51ed14);
          }
        }
      }
    }
  }, '\x64\x65\x6c\x49\x74\x65\x6d': function delItem(_0x2d1359) {
    var _0x128623 = _0x2d1359[wanzikun_0x38af('0x52')]['\x64\x61\x74\x61\x73\x65\x74'][wanzikun_0x38af('0x64')];var _0x49fc19 = this['\x64\x61\x74\x61']['\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74'][wanzikun_0x38af('0x33')];_0x49fc19[wanzikun_0x38af('0x71')](_0x128623, 0x1);this['\x73\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74'](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this['\x61\x6c\x6c\x53\x65\x6c\x65\x63\x74'](), this[wanzikun_0x38af('0x31')](), _0x49fc19);
  }, '\x73\x65\x6c\x65\x63\x74\x54\x61\x70': function selectTap(_0x44b147) {
    var _0x2a1fd7 = { '\x49\x5a\x45\x6a\x53': function IZEjS(_0xa73a17, _0x4898e9) {
        return _0xa73a17 !== _0x4898e9;
      }, '\x45\x44\x57\x65\x54': function EDWeT(_0x25908b, _0x5e449e) {
        return _0x25908b != _0x5e449e;
      }, '\x48\x73\x73\x6d\x66': function Hssmf(_0x25b1af, _0x22545d) {
        return _0x25b1af(_0x22545d);
      } };var _0x3a152c = _0x44b147[wanzikun_0x38af('0x52')]['\x64\x61\x74\x61\x73\x65\x74'][wanzikun_0x38af('0x64')];var _0x46cb27 = this[wanzikun_0x38af('0x19')]['\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74'][wanzikun_0x38af('0x33')];if (_0x2a1fd7[wanzikun_0x38af('0x72')](_0x3a152c, '') && _0x2a1fd7[wanzikun_0x38af('0x73')](_0x3a152c, null)) {
      _0x46cb27[_0x2a1fd7[wanzikun_0x38af('0x74')](parseInt, _0x3a152c)][wanzikun_0x38af('0x5f')] = !_0x46cb27[_0x2a1fd7[wanzikun_0x38af('0x74')](parseInt, _0x3a152c)][wanzikun_0x38af('0x5f')];this['\x73\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74'](this['\x67\x65\x74\x53\x61\x76\x65\x48\x69\x64\x65'](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this[wanzikun_0x38af('0x31')](), _0x46cb27);
    }
  }, '\x74\x6f\x74\x61\x6c\x50\x72\x69\x63\x65': function totalPrice() {
    var _0x360fd7 = { '\x77\x46\x44\x54\x4e': function wFDTN(_0x3e9268, _0x41ceaa) {
        return _0x3e9268 != _0x41ceaa;
      }, '\x64\x76\x64\x76\x74': function dvdvt(_0x4dcc7d, _0x37af23) {
        return _0x4dcc7d < _0x37af23;
      }, '\x77\x77\x46\x6c\x48': function wwFlH(_0x530def, _0x46357d) {
        return _0x530def(_0x46357d);
      }, '\x68\x47\x50\x46\x68': function hGPFh(_0x38f705, _0x2f8c3b) {
        return _0x38f705 !== _0x2f8c3b;
      }, '\x79\x71\x64\x66\x65': wanzikun_0x38af('0x75'), '\x43\x4b\x79\x51\x47': wanzikun_0x38af('0x76'), '\x43\x50\x7a\x46\x52': function CPzFR(_0x2d516f, _0x2ef1a7) {
        return _0x2d516f === _0x2ef1a7;
      }, '\x65\x57\x45\x48\x78': wanzikun_0x38af('0x77') };var _0x4d3444 = this[wanzikun_0x38af('0x19')]['\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74'][wanzikun_0x38af('0x33')];var _0x19f609 = 0x0;for (var _0x45708b = 0x0; _0x360fd7['\x64\x76\x64\x76\x74'](_0x45708b, _0x4d3444[wanzikun_0x38af('0x48')]); _0x45708b++) {
      if (_0x360fd7[wanzikun_0x38af('0x78')](_0x360fd7[wanzikun_0x38af('0x79')], _0x360fd7['\x43\x4b\x79\x51\x47'])) {
        var _0x86e722 = _0x4d3444[_0x45708b];if (_0x86e722[wanzikun_0x38af('0x5f')]) {
          if (_0x360fd7[wanzikun_0x38af('0x7a')](_0x360fd7[wanzikun_0x38af('0x7b')], wanzikun_0x38af('0x77'))) {
            _0x19f609 += _0x360fd7[wanzikun_0x38af('0x7c')](parseFloat, _0x86e722[wanzikun_0x38af('0x7d')]) * _0x86e722['\x6e\x75\x6d\x62\x65\x72'];
          } else {
            var _0x1cf820 = _0x4d3444[_0x45708b];_0x1cf820[wanzikun_0x38af('0x5f')] = !![];
          }
        }
      } else {
        var _0x4d37dc = e[wanzikun_0x38af('0x52')][wanzikun_0x38af('0x21')][wanzikun_0x38af('0x64')];var _0x2a889f = this['\x64\x61\x74\x61'][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];if (_0x4d37dc !== '' && _0x360fd7[wanzikun_0x38af('0x7e')](_0x4d37dc, null)) {
          if (_0x360fd7[wanzikun_0x38af('0x7f')](_0x2a889f[_0x360fd7[wanzikun_0x38af('0x7c')](parseInt, _0x4d37dc)][wanzikun_0x38af('0x80')], 0xa)) {
            _0x2a889f[_0x360fd7[wanzikun_0x38af('0x7c')](parseInt, _0x4d37dc)][wanzikun_0x38af('0x80')]++;this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this['\x61\x6c\x6c\x53\x65\x6c\x65\x63\x74'](), this[wanzikun_0x38af('0x31')](), _0x2a889f);
          }
        }
      }
    }_0x19f609 = parseFloat(_0x19f609[wanzikun_0x38af('0x81')](0x2));return _0x19f609;
  }, '\x61\x6c\x6c\x53\x65\x6c\x65\x63\x74': function allSelect() {
    var _0x543206 = { '\x62\x73\x49\x57\x70': wanzikun_0x38af('0x82'), '\x62\x6e\x4c\x79\x73': function bnLys(_0x52adef, _0x17070c) {
        return _0x52adef === _0x17070c;
      }, '\x48\x74\x4d\x65\x75': '\x69\x6f\x4c\x6c\x4e', '\x72\x59\x73\x43\x73': wanzikun_0x38af('0x83') };var _0x1d9d5a = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];var _0x4a7b43 = ![];for (var _0xbc1cc7 = 0x0; _0xbc1cc7 < _0x1d9d5a[wanzikun_0x38af('0x48')]; _0xbc1cc7++) {
      var _0x10dad6 = _0x1d9d5a[_0xbc1cc7];if (_0x10dad6[wanzikun_0x38af('0x5f')]) {
        if (_0x543206[wanzikun_0x38af('0x84')](_0x543206[wanzikun_0x38af('0x85')], '\x47\x6b\x77\x79\x77')) {
          wx[wanzikun_0x38af('0x8')]();wx[wanzikun_0x38af('0x86')]({ '\x75\x72\x6c': _0x543206[wanzikun_0x38af('0x87')] });
        } else {
          _0x4a7b43 = !![];
        }
      } else {
        if (_0x543206[wanzikun_0x38af('0x84')](_0x543206[wanzikun_0x38af('0x88')], wanzikun_0x38af('0x83'))) {
          _0x4a7b43 = ![];break;
        } else {
          left = wanzikun_0x38af('0xf');
        }
      }
    }return _0x4a7b43;
  }, '\x6e\x6f\x53\x65\x6c\x65\x63\x74': function noSelect() {
    var _0x3a7d18 = { '\x61\x65\x78\x73\x41': function aexsA(_0x331846, _0x408aae) {
        return _0x331846 == _0x408aae;
      }, '\x54\x62\x5a\x74\x62': '\x57\x68\x66\x6a\x6d', '\x78\x73\x5a\x4f\x74': wanzikun_0x38af('0x89') };var _0x42797c = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];var _0x59f6c1 = 0x0;for (var _0x2e4711 = 0x0; _0x2e4711 < _0x42797c['\x6c\x65\x6e\x67\x74\x68']; _0x2e4711++) {
      var _0x3f48e4 = _0x42797c[_0x2e4711];if (!_0x3f48e4[wanzikun_0x38af('0x5f')]) {
        _0x59f6c1++;
      }
    }if (_0x3a7d18[wanzikun_0x38af('0x8a')](_0x59f6c1, _0x42797c['\x6c\x65\x6e\x67\x74\x68'])) {
      return !![];
    } else {
      if (_0x3a7d18[wanzikun_0x38af('0x8b')] !== _0x3a7d18[wanzikun_0x38af('0x8c')]) {
        return ![];
      } else {
        if (res['\x64\x61\x74\x61'][wanzikun_0x38af('0x1c')] > 0x0) {
          wx[wanzikun_0x38af('0x20')]({ '\x69\x6e\x64\x65\x78': 0x2 });
        } else {
          wx[wanzikun_0x38af('0x35')]({ '\x69\x6e\x64\x65\x78': 0x2 });
        }
      }
    }
  }, '\x73\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74': function setGoodsList(_0x2f3eea, _0x4ef757, _0x439b7a, _0x42e865, _0x1f1034) {
    var _0x986d4 = { '\x59\x67\x54\x71\x59': function YgTqY(_0x4ff948, _0x4dd9f5) {
        return _0x4ff948 < _0x4dd9f5;
      }, '\x61\x48\x70\x62\x6b': function aHpbk(_0x2ca50a, _0x958d41) {
        return _0x2ca50a === _0x958d41;
      }, '\x56\x6a\x55\x58\x46': '\x6c\x4e\x58\x52\x6e', '\x69\x4a\x4d\x62\x4f': function iJMbO(_0x1cb103, _0x26e1ea) {
        return _0x1cb103 + _0x26e1ea;
      } };this[wanzikun_0x38af('0xb')]({ '\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74': { '\x73\x61\x76\x65\x48\x69\x64\x64\x65\x6e': _0x2f3eea, '\x74\x6f\x74\x61\x6c\x50\x72\x69\x63\x65': _0x4ef757, '\x61\x6c\x6c\x53\x65\x6c\x65\x63\x74': _0x439b7a, '\x6e\x6f\x53\x65\x6c\x65\x63\x74': _0x42e865, '\x6c\x69\x73\x74': _0x1f1034 } });var _0x46151f = {};var _0x574dc5 = 0x0;_0x46151f[wanzikun_0x38af('0x40')] = _0x1f1034;for (var _0x504707 = 0x0; _0x986d4[wanzikun_0x38af('0x8d')](_0x504707, _0x1f1034[wanzikun_0x38af('0x48')]); _0x504707++) {
      if (_0x986d4[wanzikun_0x38af('0x8e')](_0x986d4[wanzikun_0x38af('0x8f')], _0x986d4[wanzikun_0x38af('0x8f')])) {
        _0x574dc5 = _0x986d4[wanzikun_0x38af('0x90')](_0x574dc5, _0x1f1034[_0x504707][wanzikun_0x38af('0x80')]);
      } else {
        _0x1f1034[parseInt(index)][wanzikun_0x38af('0x60')] = left;this['\x73\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74'](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this['\x6e\x6f\x53\x65\x6c\x65\x63\x74'](), _0x1f1034);
      }
    }_0x46151f[wanzikun_0x38af('0x1c')] = _0x574dc5;wx[wanzikun_0x38af('0x91')]({ '\x6b\x65\x79': '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x64\x61\x74\x61': _0x46151f });
  }, '\x62\x69\x6e\x64\x41\x6c\x6c\x53\x65\x6c\x65\x63\x74': function bindAllSelect() {
    var _0x3f0511 = { '\x63\x49\x55\x77\x46': function cIUwF(_0x15fe2c, _0x4d7c01) {
        return _0x15fe2c < _0x4d7c01;
      }, '\x47\x58\x46\x45\x79': function GXFEy(_0x2e30ae, _0x686d63) {
        return _0x2e30ae !== _0x686d63;
      }, '\x78\x48\x63\x79\x58': wanzikun_0x38af('0x92'), '\x76\x45\x67\x5a\x52': function vEgZR(_0x5160d8, _0x229047) {
        return _0x5160d8 === _0x229047;
      }, '\x78\x62\x42\x56\x6c': wanzikun_0x38af('0x93') };var _0x41b4fb = this[wanzikun_0x38af('0x19')]['\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74'][wanzikun_0x38af('0x30')];var _0x1cdf53 = this['\x64\x61\x74\x61'][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];if (_0x41b4fb) {
      for (var _0x48a549 = 0x0; _0x3f0511[wanzikun_0x38af('0x94')](_0x48a549, _0x1cdf53[wanzikun_0x38af('0x48')]); _0x48a549++) {
        if (_0x3f0511[wanzikun_0x38af('0x95')](_0x3f0511[wanzikun_0x38af('0x96')], _0x3f0511['\x78\x48\x63\x79\x58'])) {
          wx[wanzikun_0x38af('0x8')]();return;
        } else {
          var _0x52fb95 = _0x1cdf53[_0x48a549];_0x52fb95[wanzikun_0x38af('0x5f')] = ![];
        }
      }
    } else {
      if (_0x3f0511[wanzikun_0x38af('0x97')](_0x3f0511['\x78\x62\x42\x56\x6c'], _0x3f0511[wanzikun_0x38af('0x98')])) {
        for (var _0x48a549 = 0x0; _0x48a549 < _0x1cdf53[wanzikun_0x38af('0x48')]; _0x48a549++) {
          var _0x52fb95 = _0x1cdf53[_0x48a549];_0x52fb95[wanzikun_0x38af('0x5f')] = !![];
        }
      } else {
        var _0x4a7075 = _0x1cdf53[_0x48a549];_0x4a7075['\x61\x63\x74\x69\x76\x65'] = !![];
      }
    }this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), !_0x41b4fb, this['\x6e\x6f\x53\x65\x6c\x65\x63\x74'](), _0x1cdf53);
  }, '\x6a\x69\x61\x42\x74\x6e\x54\x61\x70': function jiaBtnTap(_0x4249c9) {
    var _0x2dc44f = { '\x4e\x6a\x6e\x79\x54': function NjnyT(_0x494303, _0x5654ac) {
        return _0x494303 !== _0x5654ac;
      }, '\x68\x58\x6b\x6e\x45': function hXknE(_0x1d99f3, _0xf9bdb4) {
        return _0x1d99f3 != _0xf9bdb4;
      }, '\x49\x71\x48\x4a\x45': function IqHJE(_0x164a4a, _0x31cce6) {
        return _0x164a4a(_0x31cce6);
      }, '\x48\x4b\x58\x6d\x4a': function HKXmJ(_0x467659, _0x4e8680) {
        return _0x467659 !== _0x4e8680;
      }, '\x49\x4a\x56\x53\x59': wanzikun_0x38af('0x99'), '\x6f\x59\x42\x4a\x4c': function oYBJL(_0x31ea4f, _0x538ea5) {
        return _0x31ea4f < _0x538ea5;
      }, '\x79\x62\x73\x4d\x56': function ybsMV(_0x10f5a9, _0x402923) {
        return _0x10f5a9(_0x402923);
      }, '\x52\x6c\x7a\x72\x6c': function Rlzrl(_0x4ce41, _0x76662e) {
        return _0x4ce41(_0x76662e);
      } };var _0x442a67 = _0x4249c9[wanzikun_0x38af('0x52')][wanzikun_0x38af('0x21')][wanzikun_0x38af('0x64')];var _0x55785c = this['\x64\x61\x74\x61'][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];if (_0x2dc44f[wanzikun_0x38af('0x9a')](_0x442a67, '') && _0x442a67 != null) {
      if (_0x2dc44f[wanzikun_0x38af('0x9a')](_0x2dc44f['\x49\x4a\x56\x53\x59'], _0x2dc44f[wanzikun_0x38af('0x9b')])) {
        var _0x569cad = _0x4249c9[wanzikun_0x38af('0x52')][wanzikun_0x38af('0x21')]['\x69\x6e\x64\x65\x78'];var _0x3e1534 = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];if (_0x2dc44f[wanzikun_0x38af('0x9c')](_0x569cad, '') && _0x2dc44f[wanzikun_0x38af('0x9d')](_0x569cad, null)) {
          _0x3e1534[parseInt(_0x569cad)][wanzikun_0x38af('0x5f')] = !_0x3e1534[_0x2dc44f[wanzikun_0x38af('0x9e')](parseInt, _0x569cad)]['\x61\x63\x74\x69\x76\x65'];this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this[wanzikun_0x38af('0x31')](), _0x3e1534);
        }
      } else {
        if (_0x2dc44f[wanzikun_0x38af('0x9f')](_0x55785c[_0x2dc44f[wanzikun_0x38af('0xa0')](parseInt, _0x442a67)]['\x6e\x75\x6d\x62\x65\x72'], 0xa)) {
          _0x55785c[_0x2dc44f[wanzikun_0x38af('0xa1')](parseInt, _0x442a67)][wanzikun_0x38af('0x80')]++;this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this['\x61\x6c\x6c\x53\x65\x6c\x65\x63\x74'](), this[wanzikun_0x38af('0x31')](), _0x55785c);
        }
      }
    }
  }, '\x6a\x69\x61\x6e\x42\x74\x6e\x54\x61\x70': function jianBtnTap(_0x528d9c) {
    var _0x364158 = { '\x63\x76\x79\x42\x72': function cvyBr(_0x5651fe, _0x141725) {
        return _0x5651fe == _0x141725;
      }, '\x56\x61\x56\x41\x53': function VaVAS(_0x3ab1d3, _0x29bc2e) {
        return _0x3ab1d3 !== _0x29bc2e;
      }, '\x5a\x6e\x45\x56\x75': function ZnEVu(_0x148f6e, _0x2c2caf) {
        return _0x148f6e != _0x2c2caf;
      }, '\x4a\x59\x74\x48\x44': function JYtHD(_0x1b8228, _0x2b7286) {
        return _0x1b8228 !== _0x2b7286;
      }, '\x48\x53\x66\x69\x54': wanzikun_0x38af('0xa2'), '\x69\x57\x47\x4b\x46': function iWGKF(_0x270747, _0x5ad56e) {
        return _0x270747 > _0x5ad56e;
      }, '\x4b\x47\x47\x78\x50': function KGGxP(_0x24250d, _0x345621) {
        return _0x24250d(_0x345621);
      }, '\x69\x71\x57\x65\x63': function iqWec(_0x466dc1, _0xe14a0) {
        return _0x466dc1(_0xe14a0);
      } };var _0xc1149e = _0x528d9c[wanzikun_0x38af('0x52')]['\x64\x61\x74\x61\x73\x65\x74'][wanzikun_0x38af('0x64')];var _0x44a5c6 = this['\x64\x61\x74\x61'][wanzikun_0x38af('0x32')]['\x6c\x69\x73\x74'];if (_0x364158['\x56\x61\x56\x41\x53'](_0xc1149e, '') && _0x364158[wanzikun_0x38af('0xa3')](_0xc1149e, null)) {
      if (_0x364158['\x4a\x59\x74\x48\x44'](_0x364158['\x48\x53\x66\x69\x54'], wanzikun_0x38af('0xa4'))) {
        if (_0x364158[wanzikun_0x38af('0xa5')](_0x44a5c6[_0x364158[wanzikun_0x38af('0xa6')](parseInt, _0xc1149e)]['\x6e\x75\x6d\x62\x65\x72'], 0x1)) {
          _0x44a5c6[_0x364158[wanzikun_0x38af('0xa7')](parseInt, _0xc1149e)]['\x6e\x75\x6d\x62\x65\x72']--;this['\x73\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74'](this[wanzikun_0x38af('0x2e')](), this['\x74\x6f\x74\x61\x6c\x50\x72\x69\x63\x65'](), this[wanzikun_0x38af('0x30')](), this[wanzikun_0x38af('0x31')](), _0x44a5c6);
        }
      } else {
        if (_0x364158['\x63\x76\x79\x42\x72'](_0x528d9c[wanzikun_0x38af('0x4c')][wanzikun_0x38af('0x48')], 0x1)) {
          this[wanzikun_0x38af('0xb')]({ '\x73\x74\x61\x72\x74\x58': _0x528d9c[wanzikun_0x38af('0x4c')][0x0]['\x63\x6c\x69\x65\x6e\x74\x58'] });
        }
      }
    }
  }, '\x65\x64\x69\x74\x54\x61\x70': function editTap() {
    var _0x5bc4c8 = { '\x62\x43\x4b\x41\x50': function bCKAP(_0x554e76, _0x16a0a2) {
        return _0x554e76 < _0x16a0a2;
      } };var _0x4ad287 = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];for (var _0x6a7451 = 0x0; _0x5bc4c8[wanzikun_0x38af('0xa8')](_0x6a7451, _0x4ad287[wanzikun_0x38af('0x48')]); _0x6a7451++) {
      var _0xcbe7d8 = _0x4ad287[_0x6a7451];_0xcbe7d8[wanzikun_0x38af('0x5f')] = ![];
    }this['\x73\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74'](!this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this['\x61\x6c\x6c\x53\x65\x6c\x65\x63\x74'](), this[wanzikun_0x38af('0x31')](), _0x4ad287);
  }, '\x73\x61\x76\x65\x54\x61\x70': function saveTap() {
    var _0x559a9d = { '\x77\x43\x4e\x49\x77': function wCNIw(_0x169573, _0x506e5d) {
        return _0x169573 < _0x506e5d;
      } };var _0x2b030d = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')]['\x6c\x69\x73\x74'];for (var _0x40b25a = 0x0; _0x559a9d['\x77\x43\x4e\x49\x77'](_0x40b25a, _0x2b030d[wanzikun_0x38af('0x48')]); _0x40b25a++) {
      var _0x5d153e = _0x2b030d[_0x40b25a];_0x5d153e[wanzikun_0x38af('0x5f')] = !![];
    }this[wanzikun_0x38af('0x44')](!this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this[wanzikun_0x38af('0x31')](), _0x2b030d);
  }, '\x67\x65\x74\x53\x61\x76\x65\x48\x69\x64\x65': function getSaveHide() {
    var _0x2184f1 = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')][wanzikun_0x38af('0xa9')];return _0x2184f1;
  }, '\x64\x65\x6c\x65\x74\x65\x53\x65\x6c\x65\x63\x74\x65\x64': function deleteSelected() {
    var _0xc9e498 = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];_0xc9e498 = _0xc9e498[wanzikun_0x38af('0xaa')](function (_0x3777db) {
      return !_0x3777db[wanzikun_0x38af('0x5f')];
    });this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this['\x6e\x6f\x53\x65\x6c\x65\x63\x74'](), _0xc9e498);
  }, '\x74\x6f\x50\x61\x79\x4f\x72\x64\x65\x72': function toPayOrder() {
    var _this = this;

    var _0x4ee4f7 = { '\x44\x72\x4e\x65\x57': function DrNeW(_0x3f5e26, _0x3eaa3d) {
        return _0x3f5e26 !== _0x3eaa3d;
      }, '\x44\x4b\x51\x4e\x49': wanzikun_0x38af('0xab'), '\x4c\x4c\x59\x77\x43': function LLYwC(_0x17980a, _0x1b4fc2) {
        return _0x17980a / _0x1b4fc2;
      }, '\x54\x46\x61\x70\x47': function TFapG(_0x1d26da, _0x422049) {
        return _0x1d26da < _0x422049;
      }, '\x5a\x64\x6b\x55\x57': function ZdkUW(_0x23e67e, _0x1c2fd8) {
        return _0x23e67e * _0x1c2fd8;
      }, '\x47\x59\x6a\x51\x58': function GYjQX(_0x2c98a4, _0x1440f6) {
        return _0x2c98a4(_0x1440f6);
      }, '\x77\x4f\x6f\x55\x6a': function wOoUj(_0xe963ed, _0x2ad5b0) {
        return _0xe963ed - _0x2ad5b0;
      }, '\x6c\x53\x67\x5a\x69': function lSgZi(_0x575614, _0x211382) {
        return _0x575614 > _0x211382;
      }, '\x4f\x44\x79\x4c\x6e': function ODyLn(_0x266806, _0x382152) {
        return _0x266806 + _0x382152;
      }, '\x6c\x70\x51\x42\x45': '\x6d\x61\x72\x67\x69\x6e\x2d\x6c\x65\x66\x74\x3a\x30\x70\x78', '\x4f\x4a\x57\x48\x71': function OJWHq(_0x3b698b, _0x867a2) {
        return _0x3b698b != _0x867a2;
      }, '\x74\x73\x56\x58\x6f': function tsVXo(_0x1f23ec, _0x4caa8c) {
        return _0x1f23ec === _0x4caa8c;
      }, '\x73\x56\x55\x4d\x4d': wanzikun_0x38af('0xac'), '\x5a\x48\x72\x67\x70': wanzikun_0x38af('0xad'), '\x61\x6d\x6b\x74\x56': wanzikun_0x38af('0xae'), '\x64\x64\x64\x66\x73': '\x6b\x47\x42\x71\x56', '\x55\x61\x44\x49\x52': wanzikun_0x38af('0xaf'), '\x70\x4d\x4c\x56\x6d': function pMLVm(_0x563430, _0x21575e) {
        return _0x563430 == _0x21575e;
      }, '\x6c\x62\x74\x6a\x4e': function lbtjN(_0x4704d8, _0x3e9a52) {
        return _0x4704d8 !== _0x3e9a52;
      }, '\x56\x66\x58\x77\x6d': wanzikun_0x38af('0xb0'), '\x69\x44\x6a\x58\x56': wanzikun_0x38af('0xb1'), '\x67\x58\x54\x65\x63': function gXTec(_0x13f4cb, _0x5e27c4) {
        return _0x13f4cb + _0x5e27c4;
      }, '\x53\x66\x79\x4f\x67': function SfyOg(_0x3f7ee0, _0x395104) {
        return _0x3f7ee0 + _0x395104;
      }, '\x6f\x5a\x4a\x51\x6e': function oZJQn(_0x2a3236, _0x4b5313) {
        return _0x2a3236 != _0x4b5313;
      }, '\x55\x6b\x48\x66\x4d': '\x68\x73\x44\x42\x77', '\x66\x61\x6f\x4e\x79': function faoNy(_0x2f42ab, _0x34b0f9) {
        return _0x2f42ab + _0x34b0f9;
      }, '\x65\x63\x67\x4e\x77': ' \u4EF7\u683C\u6709\u8C03\u6574\uFF0C\u8BF7\u91CD\u65B0\u8D2D\u4E70', '\x74\x6d\x74\x6a\x4c': function tmtjL(_0x252262, _0x18eb59) {
        return _0x252262 == _0x18eb59;
      }, '\x50\x48\x69\x42\x42': function PHiBB(_0x2b628, _0x29fb79) {
        return _0x2b628 === _0x29fb79;
      }, '\x78\x7a\x63\x64\x57': wanzikun_0x38af('0xb2'), '\x6d\x68\x73\x4d\x55': '\x6f\x54\x43\x4b\x43', '\x6d\x46\x63\x44\x6b': '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x66\x45\x68\x4a\x52': function fEhJR(_0x436350, _0x591913) {
        return _0x436350 == _0x591913;
      }, '\x73\x6b\x66\x6c\x53': function skflS(_0x493c53, _0x5efeea) {
        return _0x493c53 === _0x5efeea;
      }, '\x50\x5a\x58\x52\x72': wanzikun_0x38af('0xb3'), '\x47\x6c\x74\x63\x6b': function Gltck(_0x1686a4, _0x57cbc2) {
        return _0x1686a4 == _0x57cbc2;
      }, '\x6f\x64\x7a\x7a\x4f': function odzzO(_0x31b545, _0x4c8934) {
        return _0x31b545 !== _0x4c8934;
      }, '\x68\x79\x52\x51\x65': wanzikun_0x38af('0xb4'), '\x6a\x74\x47\x6a\x4d': wanzikun_0x38af('0xb5'), '\x4a\x69\x54\x7a\x4b': wanzikun_0x38af('0xb6') };wx[wanzikun_0x38af('0xb7')]();var _0x2d4b97 = this;if (this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')]['\x6e\x6f\x53\x65\x6c\x65\x63\x74']) {
      wx[wanzikun_0x38af('0x8')]();return;
    }var _0x19ec2a = [];var _0x2ba078 = wx['\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65\x53\x79\x6e\x63'](_0x4ee4f7['\x6d\x46\x63\x44\x6b']);if (_0x2ba078 && _0x2ba078[wanzikun_0x38af('0x40')]) {
      _0x19ec2a = _0x2ba078[wanzikun_0x38af('0x40')][wanzikun_0x38af('0xaa')](function (_0x2d19da) {
        if (_0x4ee4f7['\x44\x72\x4e\x65\x57'](wanzikun_0x38af('0xb8'), _0x4ee4f7[wanzikun_0x38af('0xb9')])) {
          return _0x2d19da[wanzikun_0x38af('0x5f')];
        } else {
          var _0x4ff9c1 = e['\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74'][wanzikun_0x38af('0x21')]['\x69\x6e\x64\x65\x78'];var _0x18e43f = _this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];_0x18e43f[wanzikun_0x38af('0x71')](_0x4ff9c1, 0x1);_this['\x73\x65\x74\x47\x6f\x6f\x64\x73\x4c\x69\x73\x74'](_this[wanzikun_0x38af('0x2e')](), _this[wanzikun_0x38af('0x2f')](), _this['\x61\x6c\x6c\x53\x65\x6c\x65\x63\x74'](), _this[wanzikun_0x38af('0x31')](), _0x18e43f);
        }
      });
    }if (_0x4ee4f7[wanzikun_0x38af('0xba')](_0x19ec2a['\x6c\x65\x6e\x67\x74\x68'], 0x0)) {
      wx[wanzikun_0x38af('0x8')]();return;
    }var _0x1ea9ae = ![];var _0x56a5bd = 0x0;var _0x3cc3bd = _0x19ec2a[wanzikun_0x38af('0x48')];for (var _0x54c0f0 = 0x0; _0x4ee4f7[wanzikun_0x38af('0xbb')](_0x54c0f0, _0x19ec2a[wanzikun_0x38af('0x48')]); _0x54c0f0++) {
      if (_0x4ee4f7[wanzikun_0x38af('0xbc')](wanzikun_0x38af('0xbd'), '\x4a\x75\x48\x59\x42')) {
        var _0x5e239c = 0x0;try {
          var _0x50aded = wx['\x67\x65\x74\x53\x79\x73\x74\x65\x6d\x49\x6e\x66\x6f\x53\x79\x6e\x63']()['\x77\x69\x6e\x64\x6f\x77\x57\x69\x64\x74\x68'];var _0x3a47c6 = _0x4ee4f7[wanzikun_0x38af('0xbe')](_0x4ee4f7[wanzikun_0x38af('0xbe')](0x2ee, 0x2), w / 0x2);_0x5e239c = Math[wanzikun_0x38af('0x5')](_0x50aded / _0x3a47c6);return _0x5e239c;
        } catch (_0xabc5ff) {
          return ![];
        }
      } else {
        var _0x3ac620;

        var _0x26c387;

        var _ret = function () {
          if (_0x1ea9ae) {
            if (_0x4ee4f7[wanzikun_0x38af('0xbf')](_0x4ee4f7['\x50\x5a\x58\x52\x72'], _0x4ee4f7[wanzikun_0x38af('0xc0')])) {
              for (_0x3ac620 = 0x0; _0x4ee4f7[wanzikun_0x38af('0xbb')](_0x3ac620, list[wanzikun_0x38af('0x48')]); _0x3ac620++) {
                _0x26c387 = list[_0x3ac620];
                _0x26c387['\x61\x63\x74\x69\x76\x65'] = ![];
              }
            } else {
              wx[wanzikun_0x38af('0x8')]();return {
                v: void 0
              };
            }
          }var _0x35f90e = _0x19ec2a[_0x54c0f0];if (!_0x35f90e[wanzikun_0x38af('0xc1')] || _0x4ee4f7[wanzikun_0x38af('0xc2')](_0x35f90e[wanzikun_0x38af('0xc1')], '') || _0x4ee4f7[wanzikun_0x38af('0xc2')](_0x35f90e[wanzikun_0x38af('0xc1')], '\x3a')) {
            if (_0x4ee4f7[wanzikun_0x38af('0xc3')](_0x4ee4f7[wanzikun_0x38af('0xc4')], _0x4ee4f7['\x6a\x74\x47\x6a\x4d'])) {
              wx[wanzikun_0x38af('0xc5')]({ '\x75\x72\x6c': _0x4ee4f7[wanzikun_0x38af('0xc6')](wanzikun_0x49c022['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x38af('0x38')], wanzikun_0x38af('0xc7')), '\x64\x61\x74\x61': { '\x69\x64': _0x35f90e[wanzikun_0x38af('0xc8')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x41c77f) {
                  var _0x26f092 = { '\x57\x52\x64\x73\x6a': function WRdsj(_0x57aac4, _0x224642) {
                      return _0x4ee4f7[wanzikun_0x38af('0xc9')](_0x57aac4, _0x224642);
                    }, '\x54\x6c\x67\x55\x71': function TlgUq(_0x4f226b, _0x132212) {
                      return _0x4ee4f7['\x6c\x53\x67\x5a\x69'](_0x4f226b, _0x132212);
                    }, '\x64\x51\x44\x7a\x54': function dQDzT(_0x25ae9b, _0x2c03a3) {
                      return _0x4ee4f7[wanzikun_0x38af('0xca')](_0x25ae9b, _0x2c03a3);
                    }, '\x4a\x71\x4d\x4a\x6d': _0x4ee4f7['\x6c\x70\x51\x42\x45'], '\x79\x55\x6f\x41\x6d': function yUoAm(_0x100a76, _0x515b23) {
                      return _0x4ee4f7[wanzikun_0x38af('0xcb')](_0x100a76, _0x515b23);
                    }, '\x74\x5a\x61\x4a\x6b': function tZaJk(_0x41be66, _0x2cc270) {
                      return _0x4ee4f7[wanzikun_0x38af('0xcc')](_0x41be66, _0x2cc270);
                    }, '\x66\x46\x67\x63\x6a': function fFgcj(_0x44d980, _0x10fd7f) {
                      return _0x44d980(_0x10fd7f);
                    } };_0x56a5bd++;if (_0x41c77f[wanzikun_0x38af('0x19')]['\x64\x61\x74\x61'][wanzikun_0x38af('0xcd')]) {
                    if (_0x4ee4f7[wanzikun_0x38af('0xce')](wanzikun_0x38af('0xac'), _0x4ee4f7[wanzikun_0x38af('0xcf')])) {
                      wx['\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c']({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x41c77f[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x19')][wanzikun_0x38af('0xd0')][wanzikun_0x38af('0xd1')] + _0x4ee4f7['\x5a\x48\x72\x67\x70'], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });_0x1ea9ae = !![];wx[wanzikun_0x38af('0x8')]();return;
                    } else {
                      var _0x310c27 = e['\x63\x68\x61\x6e\x67\x65\x64\x54\x6f\x75\x63\x68\x65\x73'][0x0][wanzikun_0x38af('0x27')];var _0x13c3f2 = _0x26f092[wanzikun_0x38af('0xd2')](this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x26')], _0x310c27);var _0x1852b7 = this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0xa')];var _0x243175 = _0x26f092[wanzikun_0x38af('0xd3')](_0x13c3f2, _0x1852b7 / 0x2) ? _0x26f092[wanzikun_0x38af('0xd4')](_0x26f092[wanzikun_0x38af('0xd4')](wanzikun_0x38af('0xe'), _0x1852b7), '\x70\x78') : _0x26f092[wanzikun_0x38af('0xd5')];var _0xa0c2e5 = this['\x64\x61\x74\x61'][wanzikun_0x38af('0x32')][wanzikun_0x38af('0x33')];if (_0x26f092[wanzikun_0x38af('0xd6')](index, '') && _0x26f092[wanzikun_0x38af('0xd7')](index, null)) {
                        _0xa0c2e5[_0x26f092[wanzikun_0x38af('0xd8')](parseInt, index)]['\x6c\x65\x66\x74'] = _0x243175;this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this['\x61\x6c\x6c\x53\x65\x6c\x65\x63\x74'](), this[wanzikun_0x38af('0x31')](), _0xa0c2e5);
                      }
                    }
                  }if (_0x4ee4f7[wanzikun_0x38af('0xbb')](_0x41c77f[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x19')][wanzikun_0x38af('0xd0')][wanzikun_0x38af('0xd9')], _0x35f90e[wanzikun_0x38af('0x80')])) {
                    if (_0x4ee4f7[wanzikun_0x38af('0xda')] === _0x4ee4f7[wanzikun_0x38af('0xdb')]) {
                      total += _0x4ee4f7[wanzikun_0x38af('0xdc')](_0x4ee4f7[wanzikun_0x38af('0xdd')](parseFloat, curItem[wanzikun_0x38af('0x7d')]), curItem['\x6e\x75\x6d\x62\x65\x72']);
                    } else {
                      wx[wanzikun_0x38af('0xde')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x4ee4f7[wanzikun_0x38af('0xca')](_0x41c77f[wanzikun_0x38af('0x19')]['\x64\x61\x74\x61']['\x62\x61\x73\x69\x63\x49\x6e\x66\x6f'][wanzikun_0x38af('0xd1')], _0x4ee4f7['\x55\x61\x44\x49\x52']), '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });_0x1ea9ae = !![];wx[wanzikun_0x38af('0x8')]();return;
                    }
                  }if (_0x41c77f[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x19')][wanzikun_0x38af('0xd0')][wanzikun_0x38af('0xdf')] != _0x35f90e['\x70\x72\x69\x63\x65']) {
                    wx[wanzikun_0x38af('0xde')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x4ee4f7[wanzikun_0x38af('0xca')](_0x41c77f['\x64\x61\x74\x61'][wanzikun_0x38af('0x19')][wanzikun_0x38af('0xd0')][wanzikun_0x38af('0xd1')], wanzikun_0x38af('0xe0')), '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });_0x1ea9ae = !![];wx[wanzikun_0x38af('0x8')]();return;
                  }if (_0x4ee4f7[wanzikun_0x38af('0xe1')](_0x3cc3bd, _0x56a5bd)) {
                    _0x2d4b97[wanzikun_0x38af('0xe2')]();
                  }
                } });
            } else {
              wx['\x68\x69\x64\x65\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74']({ '\x69\x6e\x64\x65\x78': 0x2 });
            }
          } else {
            wx[wanzikun_0x38af('0xc5')]({ '\x75\x72\x6c': wanzikun_0x49c022['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x38af('0x38')] + _0x4ee4f7[wanzikun_0x38af('0xe3')], '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': _0x35f90e[wanzikun_0x38af('0xc8')], '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73': _0x35f90e['\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73'] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x59567b) {
                if (_0x4ee4f7[wanzikun_0x38af('0xbf')](wanzikun_0x38af('0xe4'), wanzikun_0x38af('0xe5'))) {
                  if (_0x4ee4f7[wanzikun_0x38af('0xcc')](_0x59567b[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x3c')], 0x0)) {
                    if (_0x4ee4f7[wanzikun_0x38af('0xe6')] !== _0x4ee4f7[wanzikun_0x38af('0xe7')]) {
                      wx[wanzikun_0x38af('0xde')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x4ee4f7[wanzikun_0x38af('0xe8')](_0x59567b[wanzikun_0x38af('0x19')]['\x6d\x73\x67'], '\u8BF7\u8054\u7CFB\u5BA2\u670D'), '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });wx[wanzikun_0x38af('0x8')]();return;
                    } else {
                      wx[wanzikun_0x38af('0x8')]();return;
                    }
                  }_0x56a5bd++;if (_0x4ee4f7[wanzikun_0x38af('0xbb')](_0x59567b[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x19')]['\x73\x74\x6f\x72\x65\x73'], _0x35f90e[wanzikun_0x38af('0x80')])) {
                    wx[wanzikun_0x38af('0xde')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x4ee4f7[wanzikun_0x38af('0xe9')](_0x35f90e[wanzikun_0x38af('0xd1')], _0x4ee4f7[wanzikun_0x38af('0xea')]), '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });_0x1ea9ae = !![];wx[wanzikun_0x38af('0x8')]();return;
                  }if (_0x4ee4f7[wanzikun_0x38af('0xeb')](_0x59567b[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x19')][wanzikun_0x38af('0x7d')], _0x35f90e[wanzikun_0x38af('0x7d')])) {
                    if (_0x4ee4f7[wanzikun_0x38af('0xce')](_0x4ee4f7[wanzikun_0x38af('0xec')], wanzikun_0x38af('0xed'))) {
                      if (_0x59567b[wanzikun_0x38af('0x19')][wanzikun_0x38af('0x19')][wanzikun_0x38af('0x3d')] > 0x0) {
                        wx[wanzikun_0x38af('0x20')]({ '\x69\x6e\x64\x65\x78': 0x3 });
                      } else {
                        wx[wanzikun_0x38af('0x35')]({ '\x69\x6e\x64\x65\x78': 0x3 });
                      }
                    } else {
                      wx[wanzikun_0x38af('0xde')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x4ee4f7[wanzikun_0x38af('0xc6')](_0x35f90e[wanzikun_0x38af('0xd1')], _0x4ee4f7[wanzikun_0x38af('0xee')]), '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });_0x1ea9ae = !![];wx[wanzikun_0x38af('0x8')]();return;
                    }
                  }if (_0x4ee4f7[wanzikun_0x38af('0xef')](_0x3cc3bd, _0x56a5bd)) {
                    if (_0x4ee4f7[wanzikun_0x38af('0xf0')](_0x4ee4f7[wanzikun_0x38af('0xf1')], _0x4ee4f7[wanzikun_0x38af('0xf2')])) {
                      var _0x16bf00 = this['\x67\x65\x74\x45\x6c\x65\x57\x69\x64\x74\x68'](this[wanzikun_0x38af('0x19')][wanzikun_0x38af('0xa')]);this[wanzikun_0x38af('0xb')]({ '\x64\x65\x6c\x42\x74\x6e\x57\x69\x64\x74\x68': _0x16bf00 });
                    } else {
                      _0x2d4b97[wanzikun_0x38af('0xe2')]();
                    }
                  }
                } else {
                  list[_0x4ee4f7[wanzikun_0x38af('0xdd')](parseInt, index)][wanzikun_0x38af('0x5f')] = !list[parseInt(index)][wanzikun_0x38af('0x5f')];this[wanzikun_0x38af('0x44')](this[wanzikun_0x38af('0x2e')](), this[wanzikun_0x38af('0x2f')](), this[wanzikun_0x38af('0x30')](), this[wanzikun_0x38af('0x31')](), list);
                }
              } });
          }
        }();

        if ((typeof _ret === 'undefined' ? 'undefined' : _typeof(_ret)) === "object") return _ret.v;
      }
    }
  }, '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f\x50\x61\x79\x4f\x72\x64\x65\x72': function navigateToPayOrder() {
    wx[wanzikun_0x38af('0x8')]();wx['\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f']({ '\x75\x72\x6c': wanzikun_0x38af('0x82') });
  } }); 
 			}); 	require("pages/shop-cart/index.js");
 		__wxRoute = 'pages/my/index';__wxRouteBegin = true; 	define("pages/my/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x1834 = ['\x69\x6e\x64\x65\x78', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x73\x75\x63\x63\x65\x73\x73', '\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65', '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x6b\x77\x58\x68\x57', '\x73\x68\x6f\x70\x4e\x75\x6d', '\x68\x69\x64\x65\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74', '\x54\x71\x77\x55\x5a', '\x46\x6b\x50\x64\x65', '\x6f\x76\x51\x62\x4d', '\x2f\x6e\x6f\x74\x69\x63\x65\x2f\x64\x65\x74\x61\x69\x6c', '\x7a\x52\x67\x54\x42', '\x4b\x71\x74\x4e\x55', '\x68\x74\x6d\x6c', '\x74\x76\x6d\x5a\x66', '\x47\x7a\x4a\x76\x44', '\x2e\x2e\x2f\x2e\x2e\x2f\x77\x78\x50\x61\x72\x73\x65\x2f\x77\x78\x50\x61\x72\x73\x65\x2e\x6a\x73', '\x2f\x6e\x6f\x74\x69\x63\x65\x2f\x6c\x69\x73\x74', '\x61\x62\x6f\x75\x74', '\x72\x65\x71\x75\x65\x73\x74', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x75\x72\x6c\x73', '\x50\x50\x6b\x55\x6d', '\x63\x6f\x64\x65', '\x73\x65\x74\x44\x61\x74\x61', '\x64\x61\x74\x61', '\x64\x61\x74\x61\x4c\x69\x73\x74', '\x61\x72\x74\x69\x63\x6c\x65', '\x2f\x70\x61\x67\x65\x73\x2f\x6f\x72\x64\x65\x72\x2d\x6c\x69\x73\x74\x2f\x69\x6e\x64\x65\x78\x3f\x63\x75\x72\x72\x65\x6e\x74\x54\x79\x70\x65\x3d', '\x66\x4b\x49\x45\x78', '\x72\x65\x64\x2d\x64\x6f\x74', '\x71\x56\x67\x64\x45', '\x75\x77\x49\x50\x73', '\x4e\x47\x4b\x64\x79', '\x2f\x6f\x72\x64\x65\x72\x2f\x73\x74\x61\x74\x69\x73\x74\x69\x63\x73', '\x74\x47\x79\x50\x68', '\x74\x6f\x6b\x65\x6e', '\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67', '\x68\x6f\x41\x66\x48', '\x69\x59\x47\x68\x6b', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x64\x61\x74\x61\x73\x65\x74', '\x6b\x5a\x69\x71\x4c', '\x77\x78\x50\x61\x72\x73\x65', '\x67\x4f\x66\x45\x51', '\x74\x61\x62\x43\x6c\x61\x73\x73', '\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x70\x61\x79', '\x42\x46\x7a\x65\x72', '\x73\x68\x6f\x77\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74', '\x62\x4e\x7a\x6b\x55', '\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x74\x72\x61\x6e\x73\x66\x65\x72', '\x66\x55\x73\x61\x79', '\x41\x44\x4f\x67\x55', '\x75\x63\x6f\x45\x54', '\x4a\x7a\x46\x79\x4a', '\x74\x76\x78\x4e\x5a', '\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e', '\x43\x64\x79\x63\x54', '\x53\x43\x48\x46\x4b'];(function (_0x31c48e, _0x179e9c) {
  var _0x486b41 = function _0x486b41(_0x55e57e) {
    while (--_0x55e57e) {
      _0x31c48e['push'](_0x31c48e['shift']());
    }
  };_0x486b41(++_0x179e9c);
})(wanzikun_0x1834, 0x101);var wanzikun_0x2f82 = function wanzikun_0x2f82(_0x5a6a7f, _0x43c37d) {
  _0x5a6a7f = _0x5a6a7f - 0x0;var _0x44a3f5 = wanzikun_0x1834[_0x5a6a7f];return _0x44a3f5;
};var wanzikun_0x3ae5cc = getApp();var wanzikun_0x2e6dac = require(wanzikun_0x2f82('0x0'));Page({ '\x64\x61\x74\x61': { '\x61\x62\x6f\x75\x74\x53\x68\x6f\x77': !![], '\x74\x61\x62\x43\x6c\x61\x73\x73': ['', '', '', '', ''] }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad() {
    var _0x6574e8 = { '\x4e\x63\x63\x4a\x78': function NccJx(_0x596df9, _0x557719) {
        return _0x596df9 == _0x557719;
      }, '\x65\x41\x7a\x53\x69': wanzikun_0x2f82('0x1'), '\x50\x50\x6b\x55\x6d': wanzikun_0x2f82('0x2') };var _0x5b371c = this;wx[wanzikun_0x2f82('0x3')]({ '\x75\x72\x6c': wanzikun_0x3ae5cc[wanzikun_0x2f82('0x4')][wanzikun_0x2f82('0x5')] + _0x6574e8['\x65\x41\x7a\x53\x69'], '\x64\x61\x74\x61': { '\x74\x79\x70\x65': _0x6574e8[wanzikun_0x2f82('0x6')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3f1e8a) {
        if (_0x6574e8['\x4e\x63\x63\x4a\x78'](_0x3f1e8a['\x64\x61\x74\x61'][wanzikun_0x2f82('0x7')], 0x0)) {
          _0x5b371c[wanzikun_0x2f82('0x8')]({ '\x61\x62\x6f\x75\x74': _0x3f1e8a[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0xa')][0x0] });
        }
      } });
  }, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    var _this = this;

    var _0x5434a7 = { '\x6d\x67\x59\x45\x56': function mgYEV(_0x481ec5, _0x5086ab) {
        return _0x481ec5 == _0x5086ab;
      }, '\x4d\x65\x53\x78\x4d': wanzikun_0x2f82('0xb'), '\x69\x59\x47\x68\x6b': function iYGhk(_0xf9dd95, _0x17aa47) {
        return _0xf9dd95 + _0x17aa47;
      }, '\x62\x56\x58\x79\x42': '\x2f\x6e\x6f\x74\x69\x63\x65\x2f\x64\x65\x74\x61\x69\x6c', '\x73\x59\x6a\x67\x47': wanzikun_0x2f82('0xc'), '\x7a\x7a\x56\x48\x77': function zzVHw(_0x79d6e1, _0x1457df) {
        return _0x79d6e1 == _0x1457df;
      }, '\x53\x6f\x42\x5a\x69': wanzikun_0x2f82('0xd'), '\x62\x4e\x7a\x6b\x55': function bNzkU(_0x55d4c7, _0x2e332a) {
        return _0x55d4c7 > _0x2e332a;
      }, '\x42\x46\x7a\x65\x72': wanzikun_0x2f82('0xe'), '\x66\x55\x73\x61\x79': function fUsay(_0x50ea56, _0x1e5207) {
        return _0x50ea56 > _0x1e5207;
      }, '\x41\x44\x4f\x67\x55': function ADOgU(_0x219f10, _0x4c2764) {
        return _0x219f10 !== _0x4c2764;
      }, '\x4a\x7a\x46\x79\x4a': wanzikun_0x2f82('0xf'), '\x65\x71\x62\x6c\x4e': wanzikun_0x2f82('0x10'), '\x4c\x70\x44\x76\x76': wanzikun_0x2f82('0x11'), '\x43\x64\x79\x63\x54': function CdycT(_0x3d43f7, _0x509ec2) {
        return _0x3d43f7 === _0x509ec2;
      }, '\x53\x43\x48\x46\x4b': '\x6f\x62\x52\x79\x56', '\x6b\x77\x58\x68\x57': function kwXhW(_0x4beb7f, _0x10c96a) {
        return _0x4beb7f > _0x10c96a;
      }, '\x74\x47\x79\x50\x68': wanzikun_0x2f82('0x12') };var _0x2d32ce = this;wx[wanzikun_0x2f82('0x3')]({ '\x75\x72\x6c': wanzikun_0x3ae5cc[wanzikun_0x2f82('0x4')][wanzikun_0x2f82('0x5')] + _0x5434a7[wanzikun_0x2f82('0x13')], '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x3ae5cc[wanzikun_0x2f82('0x4')][wanzikun_0x2f82('0x14')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3e85a0) {
        var _0x364aa7 = { '\x74\x76\x78\x4e\x5a': function tvxNZ(_0x3219fd, _0x1003cf) {
            return _0x5434a7['\x7a\x7a\x56\x48\x77'](_0x3219fd, _0x1003cf);
          } };wx[wanzikun_0x2f82('0x15')]();if (_0x3e85a0['\x64\x61\x74\x61'][wanzikun_0x2f82('0x7')] == 0x0) {
          if (wanzikun_0x2f82('0x16') === _0x5434a7['\x53\x6f\x42\x5a\x69']) {
            var _0x3f72e7 = { '\x6b\x5a\x69\x71\x4c': function kZiqL(_0x3e2ad0, _0x366286) {
                return _0x5434a7['\x6d\x67\x59\x45\x56'](_0x3e2ad0, _0x366286);
              }, '\x58\x64\x53\x52\x67': _0x5434a7['\x4d\x65\x53\x78\x4d'], '\x67\x4f\x66\x45\x51': '\x68\x74\x6d\x6c' };var _0x1172d2 = _this;wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x5434a7[wanzikun_0x2f82('0x17')](wanzikun_0x3ae5cc['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61']['\x75\x72\x6c\x73'], _0x5434a7['\x62\x56\x58\x79\x42']), '\x64\x61\x74\x61': { '\x69\x64': e[wanzikun_0x2f82('0x18')][wanzikun_0x2f82('0x19')]['\x69\x64'] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x93af32) {
                if (_0x3f72e7[wanzikun_0x2f82('0x1a')](_0x93af32[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x7')], 0x0)) {
                  _0x1172d2[wanzikun_0x2f82('0x8')]({ '\x61\x62\x6f\x75\x74\x53\x68\x6f\x77': ![], '\x61\x62\x6f\x75\x74\x43\x6f\x6e': _0x93af32[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x9')] });wanzikun_0x2e6dac[wanzikun_0x2f82('0x1b')](_0x3f72e7['\x58\x64\x53\x52\x67'], _0x3f72e7[wanzikun_0x2f82('0x1c')], _0x93af32[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x9')]['\x63\x6f\x6e\x74\x65\x6e\x74'], _0x1172d2, 0x5);
                }
              } });
          } else {
            var _0x28a231 = _0x2d32ce[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x1d')];if (_0x5434a7['\x62\x4e\x7a\x6b\x55'](_0x3e85a0[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x1e')], 0x0)) {
              _0x28a231[0x0] = _0x5434a7[wanzikun_0x2f82('0x1f')], wx[wanzikun_0x2f82('0x20')]({ '\x69\x6e\x64\x65\x78': 0x3 });
            } else {
              _0x28a231[0x0] = '', wx['\x68\x69\x64\x65\x54\x61\x62\x42\x61\x72\x52\x65\x64\x44\x6f\x74']({ '\x69\x6e\x64\x65\x78': 0x3 });
            }if (_0x5434a7[wanzikun_0x2f82('0x21')](_0x3e85a0[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x22')], 0x0)) {
              _0x28a231[0x1] = _0x5434a7[wanzikun_0x2f82('0x1f')];
            } else {
              _0x28a231[0x1] = '';
            }if (_0x5434a7[wanzikun_0x2f82('0x23')](_0x3e85a0[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x9')]['\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x63\x6f\x6e\x66\x69\x72\x6d'], 0x0)) {
              _0x28a231[0x2] = _0x5434a7[wanzikun_0x2f82('0x1f')];
            } else {
              if (_0x5434a7[wanzikun_0x2f82('0x24')](wanzikun_0x2f82('0x25'), _0x5434a7[wanzikun_0x2f82('0x26')])) {
                _0x28a231[0x2] = '';
              } else {
                if (_0x364aa7[wanzikun_0x2f82('0x27')](_0x3e85a0['\x64\x61\x74\x61']['\x63\x6f\x64\x65'], 0x0)) {
                  _0x2d32ce[wanzikun_0x2f82('0x8')]({ '\x61\x62\x6f\x75\x74': _0x3e85a0[wanzikun_0x2f82('0x9')]['\x64\x61\x74\x61'][wanzikun_0x2f82('0xa')][0x0] });
                }
              }
            }if (_0x3e85a0[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x28')] > 0x0) {
              if (_0x5434a7['\x41\x44\x4f\x67\x55'](_0x5434a7['\x65\x71\x62\x6c\x4e'], _0x5434a7['\x4c\x70\x44\x76\x76'])) {
                _0x28a231[0x3] = _0x5434a7[wanzikun_0x2f82('0x1f')];
              } else {
                var _0xab7d87 = _this;_0xab7d87[wanzikun_0x2f82('0x8')]({ '\x61\x62\x6f\x75\x74\x53\x68\x6f\x77': !![] });
              }
            } else {
              if (_0x5434a7[wanzikun_0x2f82('0x29')](_0x5434a7[wanzikun_0x2f82('0x2a')], _0x5434a7[wanzikun_0x2f82('0x2a')])) {
                _0x28a231[0x3] = '';
              } else {
                var _0x8808fa = e[wanzikun_0x2f82('0x18')][wanzikun_0x2f82('0x19')][wanzikun_0x2f82('0x2b')];wx[wanzikun_0x2f82('0x2c')]({ '\x75\x72\x6c': _0x5434a7[wanzikun_0x2f82('0x17')](_0x5434a7['\x73\x59\x6a\x67\x47'], _0x8808fa) });
              }
            }if (_0x3e85a0['\x64\x61\x74\x61'][wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x2d')] > 0x0) {} else {}_0x2d32ce[wanzikun_0x2f82('0x8')]({ '\x74\x61\x62\x43\x6c\x61\x73\x73': _0x28a231 });
          }
        }
      } });wx[wanzikun_0x2f82('0x2e')]({ '\x6b\x65\x79': wanzikun_0x2f82('0x2f'), '\x73\x75\x63\x63\x65\x73\x73': function success(_0x33b885) {
        if (_0x5434a7[wanzikun_0x2f82('0x30')](_0x33b885[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x31')], 0x0)) {
          wx[wanzikun_0x2f82('0x20')]({ '\x69\x6e\x64\x65\x78': 0x2 });
        } else {
          wx[wanzikun_0x2f82('0x32')]({ '\x69\x6e\x64\x65\x78': 0x2 });
        }
      } });
  }, '\x67\x65\x74\x41\x62\x6f\x75\x74': function getAbout(_0x364950) {
    var _0x967d0c = { '\x7a\x52\x67\x54\x42': wanzikun_0x2f82('0x33'), '\x76\x4b\x4e\x66\x61': wanzikun_0x2f82('0x34'), '\x6f\x76\x51\x62\x4d': function ovQbM(_0x178b38, _0x2fe546) {
        return _0x178b38 + _0x2fe546;
      } };var _0x67e1fb = this;wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x967d0c[wanzikun_0x2f82('0x35')](wanzikun_0x3ae5cc['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x2f82('0x5')], wanzikun_0x2f82('0x36')), '\x64\x61\x74\x61': { '\x69\x64': _0x364950[wanzikun_0x2f82('0x18')][wanzikun_0x2f82('0x19')]['\x69\x64'] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x84a8bd) {
        var _0x5a5ed6 = { '\x4b\x71\x74\x4e\x55': wanzikun_0x2f82('0xe') };if (_0x967d0c[wanzikun_0x2f82('0x37')] === _0x967d0c['\x76\x4b\x4e\x66\x61']) {
          tabClass[0x1] = _0x5a5ed6[wanzikun_0x2f82('0x38')];
        } else {
          if (_0x84a8bd[wanzikun_0x2f82('0x9')]['\x63\x6f\x64\x65'] == 0x0) {
            _0x67e1fb[wanzikun_0x2f82('0x8')]({ '\x61\x62\x6f\x75\x74\x53\x68\x6f\x77': ![], '\x61\x62\x6f\x75\x74\x43\x6f\x6e': _0x84a8bd[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x9')] });wanzikun_0x2e6dac[wanzikun_0x2f82('0x1b')](wanzikun_0x2f82('0xb'), wanzikun_0x2f82('0x39'), _0x84a8bd[wanzikun_0x2f82('0x9')][wanzikun_0x2f82('0x9')]['\x63\x6f\x6e\x74\x65\x6e\x74'], _0x67e1fb, 0x5);
          }
        }
      } });
  }, '\x63\x6c\x6f\x73\x65': function close() {
    var _0xe0a489 = this;_0xe0a489['\x73\x65\x74\x44\x61\x74\x61']({ '\x61\x62\x6f\x75\x74\x53\x68\x6f\x77': !![] });
  }, '\x67\x6f\x6f\x72\x64\x65\x72\x6c\x69\x73\x74': function goorderlist(_0x2a6676) {
    var _0xfc258 = { '\x74\x76\x6d\x5a\x66': function tvmZf(_0x34cb0a, _0x1d0d77) {
        return _0x34cb0a + _0x1d0d77;
      }, '\x47\x7a\x4a\x76\x44': wanzikun_0x2f82('0xc') };var _0xcd4857 = _0x2a6676[wanzikun_0x2f82('0x18')][wanzikun_0x2f82('0x19')][wanzikun_0x2f82('0x2b')];wx['\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f']({ '\x75\x72\x6c': _0xfc258[wanzikun_0x2f82('0x3a')](_0xfc258[wanzikun_0x2f82('0x3b')], _0xcd4857) });
  }
}); 
 			}); 	require("pages/my/index.js");
 		__wxRoute = 'pages/menu-list/index';__wxRouteBegin = true; 	define("pages/menu-list/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x1e30 = ['\x73\x65\x74\x44\x61\x74\x61', '\x58\x66\x68\x47\x4b', '\x4c\x5a\x4e\x41\x49', '\x4c\x50\x56\x73\x44', '\x4f\x7a\x58\x41\x58', '\x70\x75\x73\x68', '\x2f\x70\x61\x67\x65\x73\x2f\x67\x6f\x6f\x64\x73\x2d\x64\x65\x74\x61\x69\x6c\x73\x2f\x69\x6e\x64\x65\x78\x3f\x69\x64\x3d', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x54\x68\x69\x68\x50', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x64\x61\x74\x61\x73\x65\x74', '\x4d\x5a\x6e\x78\x78', '\x6b\x4d\x64\x4f\x4e', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x63\x61\x74\x65\x67\x6f\x72\x79\x2f\x61\x6c\x6c', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x6c\x69\x73\x74', '\x72\x65\x71\x75\x65\x73\x74', '\x67\x7a\x56\x7a\x73', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x75\x72\x6c\x73', '\x6b\x6b\x66\x67\x6d', '\x64\x61\x74\x61', '\x63\x6f\x64\x65', '\x49\x68\x6c\x50\x64', '\x53\x70\x45\x6b\x75'];(function (_0x614a1, _0x1f6e9e) {
  var _0x5c0486 = function _0x5c0486(_0x5b84ad) {
    while (--_0x5b84ad) {
      _0x614a1['push'](_0x614a1['shift']());
    }
  };_0x5c0486(++_0x1f6e9e);
})(wanzikun_0x1e30, 0x96);var wanzikun_0x1887 = function wanzikun_0x1887(_0x3df459, _0x2c293f) {
  _0x3df459 = _0x3df459 - 0x0;var _0x4bdc5b = wanzikun_0x1e30[_0x3df459];return _0x4bdc5b;
};var wanzikun_0xaebd4f = getApp();Page({ '\x64\x61\x74\x61': {}, '\x74\x6f\x44\x65\x74\x61\x69\x6c\x73\x54\x61\x70': function toDetailsTap(_0x26f2d6) {
    var _0x399ae9 = { '\x54\x68\x69\x68\x50': wanzikun_0x1887('0x0') };wx[wanzikun_0x1887('0x1')]({ '\x75\x72\x6c': _0x399ae9[wanzikun_0x1887('0x2')] + _0x26f2d6[wanzikun_0x1887('0x3')][wanzikun_0x1887('0x4')]['\x69\x64'] });
  }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad(_0x27d963) {
    var _0x891b71 = { '\x4c\x5a\x4e\x41\x49': function LZNAI(_0x2302b0, _0x1d64f9) {
        return _0x2302b0 < _0x1d64f9;
      }, '\x49\x68\x6c\x50\x64': function IhlPd(_0x2120a6, _0x5e21a2) {
        return _0x2120a6 !== _0x5e21a2;
      }, '\x56\x7a\x52\x44\x75': wanzikun_0x1887('0x5'), '\x4c\x50\x56\x73\x44': wanzikun_0x1887('0x6'), '\x67\x7a\x56\x7a\x73': function gzVzs(_0x521674, _0x54d188) {
        return _0x521674 + _0x54d188;
      }, '\x6b\x6b\x66\x67\x6d': wanzikun_0x1887('0x7'), '\x72\x62\x6f\x4f\x5a': wanzikun_0x1887('0x8') };var _0x15a925 = this;wx[wanzikun_0x1887('0x9')]({ '\x75\x72\x6c': _0x891b71[wanzikun_0x1887('0xa')](wanzikun_0xaebd4f[wanzikun_0x1887('0xb')][wanzikun_0x1887('0xc')], _0x891b71[wanzikun_0x1887('0xd')]), '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3acce2) {
        var _0x41e78d = { '\x58\x66\x68\x47\x4b': function XfhGK(_0x593684, _0x4ea112) {
            return _0x593684 == _0x4ea112;
          } };if (_0x3acce2[wanzikun_0x1887('0xe')][wanzikun_0x1887('0xf')] == 0x0) {
          for (var _0x3fb8d6 = 0x0; _0x891b71['\x4c\x5a\x4e\x41\x49'](_0x3fb8d6, _0x3acce2[wanzikun_0x1887('0xe')]['\x64\x61\x74\x61']['\x6c\x65\x6e\x67\x74\x68']); _0x3fb8d6++) {
            if (_0x3acce2[wanzikun_0x1887('0xe')]['\x64\x61\x74\x61'][_0x3fb8d6]['\x69\x64'] == _0x27d963['\x69\x64']) {
              if (_0x891b71[wanzikun_0x1887('0x10')](_0x891b71['\x56\x7a\x52\x44\x75'], wanzikun_0x1887('0x11'))) {
                _0x15a925[wanzikun_0x1887('0x12')]({ '\x63\x61\x74\x65\x67\x6f\x72\x69\x65': _0x3acce2['\x64\x61\x74\x61'][wanzikun_0x1887('0xe')][_0x3fb8d6] });
              } else {
                if (_0x41e78d[wanzikun_0x1887('0x13')](_0x3acce2[wanzikun_0x1887('0xe')][wanzikun_0x1887('0xe')][_0x3fb8d6]['\x69\x64'], _0x27d963['\x69\x64'])) {
                  _0x15a925[wanzikun_0x1887('0x12')]({ '\x63\x61\x74\x65\x67\x6f\x72\x69\x65': _0x3acce2['\x64\x61\x74\x61'][wanzikun_0x1887('0xe')][_0x3fb8d6] });
                }
              }
            }
          }
        }
      } });wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x891b71[wanzikun_0x1887('0xa')](wanzikun_0xaebd4f[wanzikun_0x1887('0xb')]['\x75\x72\x6c\x73'], _0x891b71['\x72\x62\x6f\x4f\x5a']), '\x64\x61\x74\x61': { '\x63\x61\x74\x65\x67\x6f\x72\x79\x49\x64': _0x27d963['\x69\x64'] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x5ebd82) {
        var _0x5e1c2d = [];for (var _0x581f5d = 0x0; _0x891b71[wanzikun_0x1887('0x14')](_0x581f5d, _0x5ebd82[wanzikun_0x1887('0xe')][wanzikun_0x1887('0xe')]['\x6c\x65\x6e\x67\x74\x68']); _0x581f5d++) {
          if (_0x891b71[wanzikun_0x1887('0x10')](_0x891b71[wanzikun_0x1887('0x15')], wanzikun_0x1887('0x16'))) {
            _0x5e1c2d[wanzikun_0x1887('0x17')](_0x5ebd82[wanzikun_0x1887('0xe')][wanzikun_0x1887('0xe')][_0x581f5d]);
          } else {
            _0x15a925[wanzikun_0x1887('0x12')]({ '\x63\x61\x74\x65\x67\x6f\x72\x69\x65': _0x5ebd82[wanzikun_0x1887('0xe')][wanzikun_0x1887('0xe')][_0x581f5d] });
          }
        }_0x15a925['\x73\x65\x74\x44\x61\x74\x61']({ '\x67\x6f\x6f\x64\x73': _0x5e1c2d });
      } });
  } }); 
 			}); 	require("pages/menu-list/index.js");
 		__wxRoute = 'pages/goods-details/index';__wxRouteBegin = true; 	define("pages/goods-details/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x3c82 = ['\x53\x55\x55\x58\x57', '\x6e\x62\x79\x45\x4d', '\x46\x57\x44\x41\x49', '\x62\x66\x54\x57\x6c', '\x6c\x6f\x67\x69\x6e', '\x66\x76\x41\x6d\x47', '\x62\x75\x6c\x69\x64\x75\x42\x75\x79\x4e\x6f\x77\x49\x6e\x66\x6f', '\x71\x72\x77\x59\x65', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x68\x64\x62\x4a\x49', '\x42\x42\x63\x4d\x47', '\x61\x70\x68\x6b\x79', '\x72\x6d\x61\x72\x6f', '\x50\x51\x69\x59\x61', '\x73\x65\x6c\x65\x63\x74\x53\x69\x7a\x65\x50\x72\x69\x63\x65', '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x49\x64', '\x64\x48\x4d\x50\x70', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x62', '\x74\x61\x72\x67\x65\x74', '\x63\x75\x72\x72\x65\x6e\x74', '\x65\x50\x55\x41\x55', '\x58\x64\x69\x6e\x77', '\x6a\x50\x4b\x67\x70', '\x41\x55\x41\x4b\x67', '\x67\x41\x68\x64\x70', '\x79\x4f\x4f\x63\x4d', '\x48\x63\x6e\x55\x79', '\x69\x6b\x6a\x44\x4b', '\x51\x66\x66\x4a\x49', '\x58\x58\x47\x52\x45', '\x72\x6c\x47\x46\x54', '\x73\x70\x6c\x69\x63\x65', '\x70\x75\x73\x68', '\x6f\x4b\x47\x6c\x61', '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x4e\x61\x6d\x65\x73', '\x43\x4d\x4c\x78\x65', '\x49\x63\x4e\x56\x78', '\x26\x69\x6e\x76\x69\x74\x65\x72\x5f\x69\x64\x3d', '\x4c\x49\x4c\x4f\x65', '\x2f\x70\x61\x67\x65\x73\x2f\x67\x6f\x6f\x64\x73\x2d\x64\x65\x74\x61\x69\x6c\x73\x2f\x69\x6e\x64\x65\x78\x3f\x69\x64\x3d', '\x6e\x58\x73\x42\x52', '\x70\x44\x7a\x64\x56', '\x4b\x71\x51\x46\x47', '\x6f\x43\x67\x72\x43', '\x2f\x6d\x65\x64\x69\x61\x2f\x76\x69\x64\x65\x6f\x2f\x64\x65\x74\x61\x69\x6c', '\x64\x56\x53\x65\x4c', '\x66\x64\x4d\x70\x34', '\x2e\x2e\x2f\x2e\x2e\x2f\x69\x6d\x61\x67\x65\x73\x2f\x43\x6f\x6f\x6c\x2d\x6c\x6f\x76\x65\x2e\x70\x6e\x67', '\x76\x6e\x4c\x6c\x57', '\x50\x46\x44\x71\x51', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x66\x61\x76\x2f\x6c\x69\x73\x74', '\x68\x5a\x4a\x59\x4c', '\x4f\x6c\x51\x68\x6d', '\u53D6\u6D88\u6536\u85CF', '\x47\x61\x70\x4b\x74', '\x6b\x5a\x4c\x65\x7a', '\x42\x73\x7a\x75\x57', '\x56\x7a\x6e\x69\x6a', '\x51\x59\x45\x41\x65', '\x6b\x6a\x75\x59\x6a', '\x6c\x69\x69\x67\x57', '\x4c\x58\x73\x69\x43', '\x5a\x53\x68\x56\x5a', '\x53\x72\x74\x54\x4f', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x66\x61\x76\x2f\x61\x64\x64', '\x57\x4d\x6e\x79\x63', '\x56\x63\x53\x5a\x68', '\x4b\x67\x42\x70\x48', '\x6b\x78\x79\x61\x46', '\x6f\x59\x74\x72\x75', '\x2f\x75\x73\x65\x72\x2f\x77\x78\x61\x70\x70\x2f\x72\x65\x67\x69\x73\x74\x65\x72\x2f\x63\x6f\x6d\x70\x6c\x65\x78', '\x4d\x6e\x67\x73\x4e', '\x61\x4a\x75\x74\x71', '\x42\x53\x42\x67\x51', '\x64\x65\x74\x61\x69\x6c', '\x65\x6e\x63\x72\x79\x70\x74\x65\x64\x44\x61\x74\x61', '\x55\x62\x51\x76\x48', '\x77\x70\x6e\x75\x4e', '\x56\x44\x6a\x78\x74', '\x4a\x41\x4d\x78\x78', '\x2e\x2e\x2f\x2e\x2e\x2f\x77\x78\x50\x61\x72\x73\x65\x2f\x77\x78\x50\x61\x72\x73\x65\x2e\x6a\x73', '\u9009\u62E9\uFF1A', '\x61\x64\x64\x53\x68\x6f\x70\x43\x61\x72', '\x54\x52\x52\x67\x63', '\x68\x4c\x51\x6b\x6b', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x75\x73\x69\x6e\x66\x6f', '\x57\x61\x74\x75\x41', '\x73\x75\x63\x63\x65\x73\x73', '\x48\x68\x4e\x71\x4f', '\x48\x72\x44\x6b\x53', '\x62\x74\x57\x41\x6a', '\x69\x6e\x76\x69\x74\x65\x72\x5f\x69\x64\x5f', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x64\x65\x74\x61\x69\x6c', '\x69\x6e\x76\x69\x74\x65\x72\x5f\x69\x64', '\x73\x65\x74\x53\x74\x6f\x72\x61\x67\x65', '\x61\x59\x6a\x59\x56', '\x67\x65\x74\x66\x61\x76', '\x67\x65\x74\x53\x79\x73\x74\x65\x6d\x49\x6e\x66\x6f', '\x73\x65\x74\x44\x61\x74\x61', '\x77\x69\x6e\x64\x6f\x77\x57\x69\x64\x74\x68', '\x77\x69\x6e\x64\x6f\x77\x48\x65\x69\x67\x68\x74', '\x79\x6f\x79\x49\x4b', '\x69\x66\x6e\x69\x48', '\x47\x56\x6a\x5a\x51', '\x64\x61\x74\x61', '\x63\x61\x6e\x53\x75\x62\x6d\x69\x74', '\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c', '\u8BF7\u9009\u62E9\u5546\u54C1\u89C4\u683C\uFF01', '\x62\x69\x6e\x64\x47\x75\x69\x47\x65\x54\x61\x70', '\x73\x68\x6f\x70\x4e\x75\x6d', '\x72\x65\x71\x75\x65\x73\x74', '\x72\x41\x42\x45\x6d', '\x75\x72\x6c\x73', '\x4b\x73\x6c\x56\x52', '\x4c\x70\x70\x48\x4c', '\x2e\x2e\x2f\x2e\x2e\x2f\x69\x6d\x61\x67\x65\x73\x2f\x43\x6f\x6f\x6c\x2d\x6c\x6f\x76\x65\x2d\x6f\x2e\x70\x6e\x67', '\x63\x67\x62\x50\x6a', '\x4b\x74\x6d\x6b\x72', '\x6d\x51\x51\x6d\x49', '\x70\x72\x6f\x70\x65\x72\x74\x69\x65\x73', '\x58\x42\x42\x6c\x59', '\x44\x71\x4d\x59\x79', '\x44\x6f\x6e\x49\x62', '\x46\x63\x59\x4f\x67', '\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c', '\x62\x61\x73\x69\x63\x49\x6e\x66\x6f', '\x74\x6f\x6b\x65\x6e', '\x63\x6f\x64\x65', '\x73\x68\x6f\x77\x54\x6f\x61\x73\x74', '\x68\x6a\x57\x68\x7a', '\x6e\x5a\x71\x70\x49', '\x74\x55\x4c\x69\x66', '\x6e\x61\x6d\x65', '\x73\x65\x6c\x65\x63\x74\x53\x69\x7a\x65', '\x6d\x69\x6e\x50\x72\x69\x63\x65', '\x76\x69\x64\x65\x6f\x49\x64', '\x45\x5a\x75\x62\x6a', '\x76\x77\x79\x6b\x6d', '\x58\x68\x66\x49\x59', '\x67\x65\x74\x56\x69\x64\x65\x6f\x53\x72\x63', '\x74\x6f\x62\x75\x79', '\x75\x6f\x50\x6f\x6c', '\x61\x72\x74\x69\x63\x6c\x65', '\x68\x74\x6d\x6c', '\x63\x6f\x6e\x74\x65\x6e\x74', '\x2f\x70\x61\x67\x65\x73\x2f\x73\x68\x6f\x70\x2d\x63\x61\x72\x74\x2f\x69\x6e\x64\x65\x78', '\x72\x65\x4c\x61\x75\x6e\x63\x68', '\x53\x42\x6b\x4d\x44', '\x53\x5a\x45\x63\x73', '\x36\x7c\x31\x34\x7c\x32\x7c\x38\x7c\x31\x37\x7c\x30\x7c\x33\x7c\x35\x7c\x37\x7c\x31\x36\x7c\x31\x7c\x34\x7c\x31\x32\x7c\x39\x7c\x31\x35\x7c\x31\x33\x7c\x31\x30\x7c\x31\x31', '\x72\x5a\x71\x47\x58', '\x66\x72\x58\x68\x63', '\x62\x75\x79\x4e\x75\x6d\x62\x65\x72', '\x62\x75\x79\x4e\x75\x6d\x4d\x69\x6e', '\x69\x72\x6e\x72\x5a', '\x4c\x72\x44\x70\x6d', '\x4f\x68\x5a\x6f\x44', '\x73\x70\x6c\x69\x74', '\x6c\x61\x62\x65\x6c', '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x54\x79\x70\x65', '\x70\x69\x63', '\x70\x72\x69\x63\x65', '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73', '\x6c\x65\x66\x74', '\x77\x65\x69\x67\x68\x74', '\x73\x68\x6f\x70\x4c\x69\x73\x74', '\x67\x6f\x6f\x64\x73\x49\x64', '\x6e\x75\x6d\x62\x65\x72', '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73', '\x6b\x47\x48\x62\x56', '\x6c\x47\x5a\x4f\x70', '\x47\x53\x49\x52\x75', '\x48\x6b\x6a\x4c\x6a', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x70\x72\x6f\x70\x65\x72\x74\x79\x69\x6e\x64\x65\x78', '\x63\x68\x69\x6c\x64\x73\x43\x75\x72\x47\x6f\x6f\x64\x73', '\x57\x45\x6c\x78\x41', '\x6c\x65\x6e\x67\x74\x68', '\x61\x63\x74\x69\x76\x65', '\x64\x61\x74\x61\x73\x65\x74', '\x70\x72\x6f\x70\x65\x72\x74\x79\x63\x68\x69\x6c\x64\x69\x6e\x64\x65\x78', '\x59\x48\x79\x46\x67', '\x44\x6c\x6c\x75\x7a', '\x58\x76\x55\x43\x79', '\x67\x4f\x69\x6f\x68', '\x54\x53\x76\x58\x42', '\x59\x50\x4c\x66\x4c', '\x7a\x51\x66\x70\x59', '\x68\x4a\x67\x66\x41', '\x43\x5a\x63\x4f\x50', '\x73\x74\x6f\x72\x65\x73', '\x78\x50\x66\x56\x50', '\u6536\u85CF\u6210\u529F', '\x72\x46\x6c\x61\x6c', '\x51\x4c\x41\x4f\x4a', '\x42\x75\x6e\x61\x57', '\u8D2D\u4E70\u6570\u91CF\u4E0D\u80FD\u4E3A0\uFF01', '\u52A0\u5165\u8D2D\u7269\u8F66\u6210\u529F', '\x58\x50\x55\x44\x6a', '\x74\x44\x4b\x51\x4f', '\x75\x48\x72\x43\x4e', '\x4f\x78\x43\x66\x4f', '\x73\x57\x53\x68\x45', '\x61\x53\x68\x41\x45', '\x77\x6b\x53\x55\x58', '\x74\x56\x47\x48\x4d', '\x62\x75\x6c\x69\x64\x53\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x6c\x77\x44\x63\x6c', '\x63\x6c\x6f\x73\x65\x50\x6f\x70\x75\x70\x54\x61\x70', '\u6E29\u99A8\u63D0\u793A', '\u9700\u8981\u60A8\u7684\u6388\u6743\uFF0C\u624D\u80FD\u6B63\u5E38\u4F7F\u7528\u54E6\uFF5E', '\u6388\u6743\u6210\u529F', '\u8BF7\u5148\u9009\u62E9\u89C4\u683C\u5C3A\u5BF8\u54E6~', '\x5a\x6b\x49\x4b\x72', '\x62\x75\x79\x4e\x6f\x77\x49\x6e\x66\x6f', '\x2f\x70\x61\x67\x65\x73\x2f\x74\x6f\x2d\x70\x61\x79\x2d\x6f\x72\x64\x65\x72\x2f\x69\x6e\x64\x65\x78\x3f\x6f\x72\x64\x65\x72\x54\x79\x70\x65\x3d\x62\x75\x79\x4e\x6f\x77', '\x78\x4a\x52\x57\x56', '\x71\x71\x50\x66\x64'];(function (_0x57df41, _0xec5193) {
  var _0x29fb40 = function _0x29fb40(_0x4b41f8) {
    while (--_0x4b41f8) {
      _0x57df41['push'](_0x57df41['shift']());
    }
  };_0x29fb40(++_0xec5193);
})(wanzikun_0x3c82, 0x12b);var wanzikun_0xa087 = function wanzikun_0xa087(_0x2f3e31, _0x3a89c9) {
  _0x2f3e31 = _0x2f3e31 - 0x0;var _0x2c6db2 = wanzikun_0x3c82[_0x2f3e31];return _0x2c6db2;
};var wanzikun_0x2f397f = getApp();var wanzikun_0x124fbe = require(wanzikun_0xa087('0x0'));Page({ '\x64\x61\x74\x61': { '\x61\x75\x74\x6f\x70\x6c\x61\x79': !![], '\x69\x6e\x74\x65\x72\x76\x61\x6c': 0x7a120, '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x1f4, '\x63\x69\x72\x63\x75\x6c\x61\x72': !![], '\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c': {}, '\x73\x77\x69\x70\x65\x72\x43\x75\x72\x72\x65\x6e\x74': 0x0, '\x68\x61\x73\x4d\x6f\x72\x65\x53\x65\x6c\x65\x63\x74': ![], '\x73\x65\x6c\x65\x63\x74\x53\x69\x7a\x65': wanzikun_0xa087('0x1'), '\x73\x65\x6c\x65\x63\x74\x53\x69\x7a\x65\x50\x72\x69\x63\x65': 0x0, '\x73\x68\x6f\x70\x4e\x75\x6d': 0x0, '\x68\x69\x64\x65\x53\x68\x6f\x70\x50\x6f\x70\x75\x70': !![], '\x62\x75\x79\x4e\x75\x6d\x62\x65\x72': 0x0, '\x62\x75\x79\x4e\x75\x6d\x4d\x69\x6e': 0x1, '\x62\x75\x79\x4e\x75\x6d\x4d\x61\x78': 0x0, '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x62': 0x0, '\x66\x61\x76\x69\x63\x6f\x6e': 0x0, '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73': '', '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x4e\x61\x6d\x65\x73': '', '\x63\x61\x6e\x53\x75\x62\x6d\x69\x74': ![], '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f': {}, '\x73\x68\x6f\x70\x54\x79\x70\x65': wanzikun_0xa087('0x2'), '\x77\x78\x6c\x6f\x67\x69\x6e': !![] }, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    var _0x3b484e = { '\x68\x4c\x51\x6b\x6b': function hLQkk(_0x29fa42, _0x969f63) {
        return _0x29fa42 == _0x969f63;
      }, '\x54\x52\x52\x67\x63': function TRRgc(_0x7df075, _0x25d557, _0x3d693a) {
        return _0x7df075(_0x25d557, _0x3d693a);
      } };var _0x5b3bce = this;_0x3b484e[wanzikun_0xa087('0x3')](setTimeout, function () {
      if (_0x3b484e[wanzikun_0xa087('0x4')](wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x6')], 0x0)) {
        _0x5b3bce['\x73\x65\x74\x44\x61\x74\x61']({ '\x77\x78\x6c\x6f\x67\x69\x6e': ![] });
      }
    }, 0x3e8);
  }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad(_0x1d1288) {
    var _0x27faaf = { '\x69\x66\x6e\x69\x48': function ifniH(_0x3fc0d2, _0x415e33) {
        return _0x3fc0d2 !== _0x415e33;
      }, '\x47\x56\x6a\x5a\x51': wanzikun_0xa087('0x7'), '\x4c\x70\x70\x48\x4c': wanzikun_0xa087('0x8'), '\x63\x67\x62\x50\x6a': function cgbPj(_0x33824a, _0x173949) {
        return _0x33824a + _0x173949;
      }, '\x4b\x74\x6d\x6b\x72': '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x66\x61\x76\x2f\x61\x64\x64', '\x6d\x51\x51\x6d\x49': function mQQmI(_0x3c99c4, _0x5e59f2) {
        return _0x3c99c4 === _0x5e59f2;
      }, '\x52\x65\x66\x4a\x79': wanzikun_0xa087('0x9'), '\x58\x42\x42\x6c\x59': function XBBlY(_0x408b82, _0x106a6a) {
        return _0x408b82 < _0x106a6a;
      }, '\x51\x66\x6b\x58\x4f': '\x75\x44\x53\x43\x4a', '\x74\x55\x4c\x69\x66': function tULif(_0x1f8730, _0x1a6307) {
        return _0x1f8730 + _0x1a6307;
      }, '\x45\x5a\x75\x62\x6a': function EZubj(_0x2943b3, _0xb7c3e0) {
        return _0x2943b3 !== _0xb7c3e0;
      }, '\x76\x77\x79\x6b\x6d': wanzikun_0xa087('0xa'), '\x58\x68\x66\x49\x59': wanzikun_0xa087('0xb'), '\x75\x6f\x50\x6f\x6c': function uoPol(_0x3768b8, _0x36a05f) {
        return _0x3768b8 > _0x36a05f;
      }, '\x61\x59\x6a\x59\x56': wanzikun_0xa087('0xc'), '\x79\x6f\x79\x49\x4b': '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x72\x41\x42\x45\x6d': function rABEm(_0x449d21, _0x571505) {
        return _0x449d21 + _0x571505;
      }, '\x4b\x73\x6c\x56\x52': wanzikun_0xa087('0xd') };if (_0x1d1288[wanzikun_0xa087('0xe')]) {
      wx[wanzikun_0xa087('0xf')]({ '\x6b\x65\x79': _0x27faaf[wanzikun_0xa087('0x10')] + _0x1d1288['\x69\x64'], '\x64\x61\x74\x61': _0x1d1288['\x69\x6e\x76\x69\x74\x65\x72\x5f\x69\x64'] });
    }var _0x22463e = this;this[wanzikun_0xa087('0x11')](_0x1d1288);wx[wanzikun_0xa087('0x12')]({ '\x73\x75\x63\x63\x65\x73\x73': function success(_0x220d39) {
        _0x22463e[wanzikun_0xa087('0x13')]({ '\x77\x69\x6e\x64\x6f\x77\x57\x69\x64\x74\x68': _0x220d39[wanzikun_0xa087('0x14')], '\x77\x69\x6e\x64\x6f\x77\x48\x65\x69\x67\x68\x74': _0x220d39[wanzikun_0xa087('0x15')] });
      } });wx['\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65']({ '\x6b\x65\x79': _0x27faaf[wanzikun_0xa087('0x16')], '\x73\x75\x63\x63\x65\x73\x73': function success(_0x54dd8f) {
        if (_0x27faaf[wanzikun_0xa087('0x17')]('\x57\x61\x74\x75\x41', _0x27faaf[wanzikun_0xa087('0x18')])) {
          if (!this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x1a')]) {
            wx[wanzikun_0xa087('0x1b')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': wanzikun_0xa087('0x1c'), '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });
          }this[wanzikun_0xa087('0x1d')]();return;
        } else {
          _0x22463e[wanzikun_0xa087('0x13')]({ '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f': _0x54dd8f[wanzikun_0xa087('0x19')], '\x73\x68\x6f\x70\x4e\x75\x6d': _0x54dd8f[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x1e')] });
        }
      } });wx[wanzikun_0xa087('0x1f')]({ '\x75\x72\x6c': _0x27faaf[wanzikun_0xa087('0x20')](wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x21')], _0x27faaf[wanzikun_0xa087('0x22')]), '\x64\x61\x74\x61': { '\x69\x64': _0x1d1288['\x69\x64'] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x53a9e3) {
        var _0x9800a4 = { '\x44\x71\x4d\x59\x79': _0x27faaf[wanzikun_0xa087('0x23')], '\x44\x6f\x6e\x49\x62': wanzikun_0xa087('0x24'), '\x4b\x4a\x4f\x6c\x7a': function KJOlz(_0x527357, _0x3c1c6c) {
            return _0x27faaf[wanzikun_0xa087('0x25')](_0x527357, _0x3c1c6c);
          }, '\x46\x63\x59\x4f\x67': _0x27faaf[wanzikun_0xa087('0x26')] };if (_0x27faaf[wanzikun_0xa087('0x27')](_0x27faaf['\x52\x65\x66\x4a\x79'], _0x27faaf['\x52\x65\x66\x4a\x79'])) {
          var _0x45a017 = '';if (_0x53a9e3[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x28')]) {
            for (var _0x539ed9 = 0x0; _0x27faaf[wanzikun_0xa087('0x29')](_0x539ed9, _0x53a9e3[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x28')]['\x6c\x65\x6e\x67\x74\x68']); _0x539ed9++) {
              if ('\x75\x44\x53\x43\x4a' !== _0x27faaf['\x51\x66\x6b\x58\x4f']) {
                var _0x2e1fdb = { '\x49\x4b\x51\x6d\x6a': '\u6536\u85CF\u6210\u529F', '\x68\x6a\x57\x68\x7a': _0x9800a4[wanzikun_0xa087('0x2a')], '\x6e\x5a\x71\x70\x49': _0x9800a4[wanzikun_0xa087('0x2b')] };var _0x239c58 = this;wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x9800a4['\x4b\x4a\x4f\x6c\x7a'](wanzikun_0x2f397f['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0xa087('0x21')], _0x9800a4[wanzikun_0xa087('0x2c')]), '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': this['\x64\x61\x74\x61'][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')]['\x69\x64'], '\x74\x6f\x6b\x65\x6e': wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x2f')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3af5be) {
                    if (_0x3af5be[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x30')] == 0x0) {
                      wx[wanzikun_0xa087('0x31')]({ '\x74\x69\x74\x6c\x65': _0x2e1fdb['\x49\x4b\x51\x6d\x6a'], '\x69\x63\x6f\x6e': _0x2e1fdb[wanzikun_0xa087('0x32')], '\x69\x6d\x61\x67\x65': _0x2e1fdb[wanzikun_0xa087('0x33')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });_0x239c58[wanzikun_0xa087('0x13')]({ '\x66\x61\x76\x69\x63\x6f\x6e': 0x1 });
                    }
                  } });
              } else {
                _0x45a017 = _0x27faaf[wanzikun_0xa087('0x34')](_0x45a017 + '\x20', _0x53a9e3[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')]['\x70\x72\x6f\x70\x65\x72\x74\x69\x65\x73'][_0x539ed9][wanzikun_0xa087('0x35')]);
              }
            }_0x22463e[wanzikun_0xa087('0x13')]({ '\x68\x61\x73\x4d\x6f\x72\x65\x53\x65\x6c\x65\x63\x74': !![], '\x73\x65\x6c\x65\x63\x74\x53\x69\x7a\x65': _0x22463e['\x64\x61\x74\x61'][wanzikun_0xa087('0x36')] + _0x45a017, '\x73\x65\x6c\x65\x63\x74\x53\x69\x7a\x65\x50\x72\x69\x63\x65': _0x53a9e3[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x37')] });
          }_0x22463e[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')] = _0x53a9e3[wanzikun_0xa087('0x19')]['\x64\x61\x74\x61'];if (_0x53a9e3[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x38')]) {
            if (_0x27faaf[wanzikun_0xa087('0x39')](_0x27faaf[wanzikun_0xa087('0x3a')], _0x27faaf[wanzikun_0xa087('0x3b')])) {
              _0x22463e[wanzikun_0xa087('0x3c')](_0x53a9e3[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x38')]);
            } else {
              this['\x73\x65\x74\x44\x61\x74\x61']({ '\x73\x68\x6f\x70\x54\x79\x70\x65': wanzikun_0xa087('0x3d') });this['\x62\x69\x6e\x64\x47\x75\x69\x47\x65\x54\x61\x70']();
            }
          }_0x22463e[wanzikun_0xa087('0x13')]({ '\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c': _0x53a9e3[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')], '\x73\x65\x6c\x65\x63\x74\x53\x69\x7a\x65\x50\x72\x69\x63\x65': _0x53a9e3['\x64\x61\x74\x61'][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x37')], '\x62\x75\x79\x4e\x75\x6d\x4d\x61\x78': _0x53a9e3[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2e')]['\x73\x74\x6f\x72\x65\x73'], '\x62\x75\x79\x4e\x75\x6d\x62\x65\x72': _0x27faaf[wanzikun_0xa087('0x3e')](_0x53a9e3[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2e')]['\x73\x74\x6f\x72\x65\x73'], 0x0) ? 0x1 : 0x0 });wanzikun_0x124fbe['\x77\x78\x50\x61\x72\x73\x65'](wanzikun_0xa087('0x3f'), wanzikun_0xa087('0x40'), _0x53a9e3[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x41')], _0x22463e, 0x5);
        } else {
          this['\x73\x65\x74\x44\x61\x74\x61']({ '\x68\x69\x64\x65\x53\x68\x6f\x70\x50\x6f\x70\x75\x70': ![] });
        }
      } });this['\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e'](_0x1d1288['\x69\x64']);
  }, '\x67\x6f\x53\x68\x6f\x70\x43\x61\x72': function goShopCar() {
    var _0x1d0eb5 = { '\x53\x42\x6b\x4d\x44': wanzikun_0xa087('0x42') };wx[wanzikun_0xa087('0x43')]({ '\x75\x72\x6c': _0x1d0eb5[wanzikun_0xa087('0x44')] });
  }, '\x74\x6f\x41\x64\x64\x53\x68\x6f\x70\x43\x61\x72': function toAddShopCar() {
    var _0x58e537 = { '\x53\x5a\x45\x63\x73': wanzikun_0xa087('0x2') };this[wanzikun_0xa087('0x13')]({ '\x73\x68\x6f\x70\x54\x79\x70\x65': _0x58e537[wanzikun_0xa087('0x45')] });this[wanzikun_0xa087('0x1d')]();
  }, '\x74\x6f\x62\x75\x79': function tobuy() {
    var _0x3fa317 = { '\x7a\x64\x4d\x73\x49': wanzikun_0xa087('0x3d') };this[wanzikun_0xa087('0x13')]({ '\x73\x68\x6f\x70\x54\x79\x70\x65': _0x3fa317['\x7a\x64\x4d\x73\x49'] });this[wanzikun_0xa087('0x1d')]();
  }, '\x62\x69\x6e\x64\x47\x75\x69\x47\x65\x54\x61\x70': function bindGuiGeTap() {
    this[wanzikun_0xa087('0x13')]({ '\x68\x69\x64\x65\x53\x68\x6f\x70\x50\x6f\x70\x75\x70': ![] });
  }, '\x63\x6c\x6f\x73\x65\x50\x6f\x70\x75\x70\x54\x61\x70': function closePopupTap() {
    this[wanzikun_0xa087('0x13')]({ '\x68\x69\x64\x65\x53\x68\x6f\x70\x50\x6f\x70\x75\x70': !![] });
  }, '\x6e\x75\x6d\x4a\x69\x61\x6e\x54\x61\x70': function numJianTap() {
    var _0x43584b = { '\x4f\x68\x5a\x6f\x44': wanzikun_0xa087('0x46'), '\x66\x72\x58\x68\x63': function frXhc(_0x460157, _0x10a2f4) {
        return _0x460157 > _0x10a2f4;
      }, '\x69\x72\x6e\x72\x5a': function irnrZ(_0xf782df, _0x47969d) {
        return _0xf782df === _0x47969d;
      }, '\x4c\x72\x44\x70\x6d': wanzikun_0xa087('0x47') };if (_0x43584b[wanzikun_0xa087('0x48')](this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x49')], this['\x64\x61\x74\x61'][wanzikun_0xa087('0x4a')])) {
      if (_0x43584b[wanzikun_0xa087('0x4b')](wanzikun_0xa087('0x47'), _0x43584b[wanzikun_0xa087('0x4c')])) {
        var _0x5db829 = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x49')];_0x5db829--;this[wanzikun_0xa087('0x13')]({ '\x62\x75\x79\x4e\x75\x6d\x62\x65\x72': _0x5db829 });
      } else {
        var _0x51b98e = _0x43584b[wanzikun_0xa087('0x4d')][wanzikun_0xa087('0x4e')]('\x7c'),
            _0x36f733 = 0x0;while (!![]) {
          switch (_0x51b98e[_0x36f733++]) {case '\x30':
              _0x13ce8d[wanzikun_0xa087('0x4f')] = this[wanzikun_0xa087('0x19')]['\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x4e\x61\x6d\x65\x73'];continue;case '\x31':
              _0x13ce8d[wanzikun_0xa087('0x50')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')]['\x62\x61\x73\x69\x63\x49\x6e\x66\x6f']['\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x49\x64'];continue;case '\x32':
              _0x13ce8d[wanzikun_0xa087('0x51')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x51')];continue;case '\x33':
              _0x13ce8d[wanzikun_0xa087('0x52')] = this[wanzikun_0xa087('0x19')]['\x73\x65\x6c\x65\x63\x74\x53\x69\x7a\x65\x50\x72\x69\x63\x65'];continue;case '\x34':
              _0x13ce8d[wanzikun_0xa087('0x53')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x53')];continue;case '\x35':
              _0x13ce8d[wanzikun_0xa087('0x54')] = '';continue;case '\x36':
              var _0x13ce8d = {};continue;case '\x37':
              _0x13ce8d['\x61\x63\x74\x69\x76\x65'] = !![];continue;case '\x38':
              _0x13ce8d[wanzikun_0xa087('0x35')] = this['\x64\x61\x74\x61'][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x35')];continue;case '\x39':
              var _0x4a174f = {};continue;case '\x31\x30':
              _0x4a174f['\x73\x68\x6f\x70\x4c\x69\x73\x74']['\x70\x75\x73\x68'](_0x13ce8d);continue;case '\x31\x31':
              return _0x4a174f;case '\x31\x32':
              _0x13ce8d[wanzikun_0xa087('0x55')] = this['\x64\x61\x74\x61'][wanzikun_0xa087('0x2d')]['\x62\x61\x73\x69\x63\x49\x6e\x66\x6f'][wanzikun_0xa087('0x55')];continue;case '\x31\x33':
              if (!_0x4a174f[wanzikun_0xa087('0x56')]) {
                _0x4a174f['\x73\x68\x6f\x70\x4c\x69\x73\x74'] = [];
              }continue;case '\x31\x34':
              _0x13ce8d[wanzikun_0xa087('0x57')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')]['\x62\x61\x73\x69\x63\x49\x6e\x66\x6f']['\x69\x64'];continue;case '\x31\x35':
              if (!_0x4a174f[wanzikun_0xa087('0x1e')]) {
                _0x4a174f[wanzikun_0xa087('0x1e')] = 0x0;
              }continue;case '\x31\x36':
              _0x13ce8d[wanzikun_0xa087('0x58')] = this['\x64\x61\x74\x61'][wanzikun_0xa087('0x49')];continue;case '\x31\x37':
              _0x13ce8d[wanzikun_0xa087('0x59')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x59')];continue;}break;
        }
      }
    }
  }, '\x6e\x75\x6d\x4a\x69\x61\x54\x61\x70': function numJiaTap() {
    var _0xc45bd = { '\x6b\x47\x48\x62\x56': function kGHbV(_0xa3eb49, _0x246868) {
        return _0xa3eb49 < _0x246868;
      } };if (_0xc45bd[wanzikun_0xa087('0x5a')](this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x49')], this[wanzikun_0xa087('0x19')]['\x62\x75\x79\x4e\x75\x6d\x4d\x61\x78'])) {
      var _0x4531a3 = this[wanzikun_0xa087('0x19')]['\x62\x75\x79\x4e\x75\x6d\x62\x65\x72'];_0x4531a3++;this[wanzikun_0xa087('0x13')]({ '\x62\x75\x79\x4e\x75\x6d\x62\x65\x72': _0x4531a3 });
    }
  }, '\x6c\x61\x62\x65\x6c\x49\x74\x65\x6d\x54\x61\x70': function labelItemTap(_0x233b58) {
    var _0x2637c8 = { '\x59\x48\x79\x46\x67': function YHyFg(_0x347821, _0x28a567) {
        return _0x347821 === _0x28a567;
      }, '\x68\x4a\x67\x66\x41': wanzikun_0xa087('0x5b'), '\x43\x5a\x63\x4f\x50': wanzikun_0xa087('0x5c'), '\x78\x50\x66\x56\x50': function xPfVP(_0x302201, _0x256a13) {
        return _0x302201 > _0x256a13;
      }, '\x57\x45\x6c\x78\x41': function WElxA(_0xf47d92, _0x4219b0) {
        return _0xf47d92 < _0x4219b0;
      }, '\x77\x78\x6a\x4e\x56': wanzikun_0xa087('0x5d'), '\x44\x6c\x6c\x75\x7a': function Dlluz(_0x232cb3, _0x534816) {
        return _0x232cb3 + _0x534816;
      }, '\x58\x76\x55\x43\x79': function XvUCy(_0x14bb29, _0x11ae04) {
        return _0x14bb29 + _0x11ae04;
      }, '\x67\x4f\x69\x6f\x68': function gOioh(_0x563ebe, _0x5bf1dd) {
        return _0x563ebe + _0x5bf1dd;
      }, '\x54\x53\x76\x58\x42': function TSvXB(_0x454582, _0x31d0fc) {
        return _0x454582 + _0x31d0fc;
      }, '\x59\x50\x4c\x66\x4c': function YPLfL(_0x7a4202, _0x298f64) {
        return _0x7a4202 + _0x298f64;
      }, '\x58\x77\x55\x48\x70': function XwUHp(_0x5d0d52, _0x17c55f) {
        return _0x5d0d52 == _0x17c55f;
      }, '\x7a\x51\x66\x70\x59': '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x70\x72\x69\x63\x65' };var _0x546429 = this;var _0x5f42de = _0x546429[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x28')][_0x233b58[wanzikun_0xa087('0x5e')]['\x64\x61\x74\x61\x73\x65\x74'][wanzikun_0xa087('0x5f')]][wanzikun_0xa087('0x60')];for (var _0x2b3783 = 0x0; _0x2637c8[wanzikun_0xa087('0x61')](_0x2b3783, _0x5f42de[wanzikun_0xa087('0x62')]); _0x2b3783++) {
      _0x546429[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x28')][_0x233b58[wanzikun_0xa087('0x5e')]['\x64\x61\x74\x61\x73\x65\x74'][wanzikun_0xa087('0x5f')]]['\x63\x68\x69\x6c\x64\x73\x43\x75\x72\x47\x6f\x6f\x64\x73'][_0x2b3783][wanzikun_0xa087('0x63')] = ![];
    }_0x546429[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')]['\x70\x72\x6f\x70\x65\x72\x74\x69\x65\x73'][_0x233b58[wanzikun_0xa087('0x5e')][wanzikun_0xa087('0x64')][wanzikun_0xa087('0x5f')]][wanzikun_0xa087('0x60')][_0x233b58[wanzikun_0xa087('0x5e')][wanzikun_0xa087('0x64')][wanzikun_0xa087('0x65')]]['\x61\x63\x74\x69\x76\x65'] = !![];var _0x338d56 = _0x546429['\x64\x61\x74\x61'][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x28')][wanzikun_0xa087('0x62')];var _0x21139c = 0x0;var _0x4276d6 = '';var _0x2d5931 = '';for (var _0x2b3783 = 0x0; _0x2b3783 < _0x546429[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x28')]['\x6c\x65\x6e\x67\x74\x68']; _0x2b3783++) {
      _0x5f42de = _0x546429[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x28')][_0x2b3783]['\x63\x68\x69\x6c\x64\x73\x43\x75\x72\x47\x6f\x6f\x64\x73'];for (var _0x51f8f3 = 0x0; _0x51f8f3 < _0x5f42de[wanzikun_0xa087('0x62')]; _0x51f8f3++) {
        if (_0x5f42de[_0x51f8f3][wanzikun_0xa087('0x63')]) {
          if (_0x2637c8[wanzikun_0xa087('0x66')](wanzikun_0xa087('0x5d'), _0x2637c8['\x77\x78\x6a\x4e\x56'])) {
            _0x21139c++;_0x4276d6 = _0x2637c8[wanzikun_0xa087('0x67')](_0x2637c8[wanzikun_0xa087('0x67')](_0x2637c8[wanzikun_0xa087('0x68')](_0x2637c8[wanzikun_0xa087('0x69')](_0x4276d6, _0x546429['\x64\x61\x74\x61']['\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c'][wanzikun_0xa087('0x28')][_0x2b3783]['\x69\x64']), '\x3a'), _0x5f42de[_0x51f8f3]['\x69\x64']), '\x2c');_0x2d5931 = _0x2637c8[wanzikun_0xa087('0x69')](_0x2637c8[wanzikun_0xa087('0x6a')](_0x2637c8[wanzikun_0xa087('0x6b')](_0x2d5931, _0x546429[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x28')][_0x2b3783]['\x6e\x61\x6d\x65']) + '\x3a', _0x5f42de[_0x51f8f3][wanzikun_0xa087('0x35')]), '\x20\x20');
          } else {
            this[wanzikun_0xa087('0x13')]({ '\x68\x69\x64\x65\x53\x68\x6f\x70\x50\x6f\x70\x75\x70': !![] });
          }
        }
      }
    }var _0x1228a5 = ![];if (_0x2637c8['\x58\x77\x55\x48\x70'](_0x338d56, _0x21139c)) {
      _0x1228a5 = !![];
    }if (_0x1228a5) {
      wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x2637c8[wanzikun_0xa087('0x6b')](wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x21')], _0x2637c8[wanzikun_0xa087('0x6c')]), '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': _0x546429['\x64\x61\x74\x61'][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')]['\x69\x64'], '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73': _0x4276d6 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x66a0b8) {
          if (_0x2637c8[wanzikun_0xa087('0x66')](_0x2637c8[wanzikun_0xa087('0x6d')], _0x2637c8[wanzikun_0xa087('0x6e')])) {
            var _0x5369f8 = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x49')];_0x5369f8--;this[wanzikun_0xa087('0x13')]({ '\x62\x75\x79\x4e\x75\x6d\x62\x65\x72': _0x5369f8 });
          } else {
            _0x546429[wanzikun_0xa087('0x13')]({ '\x73\x65\x6c\x65\x63\x74\x53\x69\x7a\x65\x50\x72\x69\x63\x65': _0x66a0b8['\x64\x61\x74\x61'][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x52')], '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73': _0x4276d6, '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x4e\x61\x6d\x65\x73': _0x2d5931, '\x62\x75\x79\x4e\x75\x6d\x4d\x61\x78': _0x66a0b8[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x6f')], '\x62\x75\x79\x4e\x75\x6d\x62\x65\x72': _0x2637c8[wanzikun_0xa087('0x70')](_0x66a0b8[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x6f')], 0x0) ? 0x1 : 0x0 });
          }
        } });
    }this[wanzikun_0xa087('0x13')]({ '\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c': _0x546429[wanzikun_0xa087('0x19')]['\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c'], '\x63\x61\x6e\x53\x75\x62\x6d\x69\x74': _0x1228a5 });
  }, '\x61\x64\x64\x53\x68\x6f\x70\x43\x61\x72': function addShopCar() {
    var _0x3c4abf = { '\x77\x6b\x53\x55\x58': wanzikun_0xa087('0x71'), '\x74\x56\x47\x48\x4d': wanzikun_0xa087('0x8'), '\x58\x50\x55\x44\x6a': function XPUDj(_0x328f29, _0x39549e) {
        return _0x328f29 === _0x39549e;
      }, '\x75\x48\x72\x43\x4e': wanzikun_0xa087('0x72'), '\x4f\x78\x43\x66\x4f': function OxCfO(_0x5b7b36, _0xdf2955) {
        return _0x5b7b36 < _0xdf2955;
      }, '\x73\x57\x53\x68\x45': function sWShE(_0x433dc7, _0x6350a6) {
        return _0x433dc7 !== _0x6350a6;
      }, '\x4b\x74\x51\x4a\x62': wanzikun_0xa087('0x73'), '\x77\x6d\x6c\x6c\x65': wanzikun_0xa087('0x74'), '\x61\x53\x68\x41\x45': wanzikun_0xa087('0x75'), '\x6c\x77\x44\x63\x6c': '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x77\x78\x79\x47\x47': wanzikun_0xa087('0x76') };if (this['\x64\x61\x74\x61'][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x28')] && !this['\x64\x61\x74\x61'][wanzikun_0xa087('0x1a')]) {
      if (!this[wanzikun_0xa087('0x19')]['\x63\x61\x6e\x53\x75\x62\x6d\x69\x74']) {
        if (_0x3c4abf[wanzikun_0xa087('0x77')](wanzikun_0xa087('0x78'), _0x3c4abf[wanzikun_0xa087('0x79')])) {
          that[wanzikun_0xa087('0x13')]({ '\x76\x69\x64\x65\x6f\x4d\x70\x34\x53\x72\x63': res[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')]['\x66\x64\x4d\x70\x34'] });
        } else {
          wx[wanzikun_0xa087('0x1b')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': wanzikun_0xa087('0x1c'), '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });
        }
      }this[wanzikun_0xa087('0x1d')]();return;
    }if (_0x3c4abf[wanzikun_0xa087('0x7a')](this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x49')], 0x1)) {
      if (_0x3c4abf[wanzikun_0xa087('0x7b')](_0x3c4abf['\x4b\x74\x51\x4a\x62'], _0x3c4abf['\x77\x6d\x6c\x6c\x65'])) {
        wx[wanzikun_0xa087('0x1b')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x3c4abf[wanzikun_0xa087('0x7c')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
      } else {
        wx['\x73\x68\x6f\x77\x54\x6f\x61\x73\x74']({ '\x74\x69\x74\x6c\x65': _0x3c4abf[wanzikun_0xa087('0x7d')], '\x69\x63\x6f\x6e': _0x3c4abf[wanzikun_0xa087('0x7e')], '\x69\x6d\x61\x67\x65': wanzikun_0xa087('0x24'), '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });that[wanzikun_0xa087('0x13')]({ '\x66\x61\x76\x69\x63\x6f\x6e': 0x1 });
      }
    }var _0x1ddd7f = this[wanzikun_0xa087('0x7f')]();this[wanzikun_0xa087('0x13')]({ '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f': _0x1ddd7f, '\x73\x68\x6f\x70\x4e\x75\x6d': _0x1ddd7f[wanzikun_0xa087('0x1e')] });wx[wanzikun_0xa087('0xf')]({ '\x6b\x65\x79': _0x3c4abf[wanzikun_0xa087('0x80')], '\x64\x61\x74\x61': _0x1ddd7f });this[wanzikun_0xa087('0x81')]();wx['\x73\x68\x6f\x77\x54\x6f\x61\x73\x74']({ '\x74\x69\x74\x6c\x65': _0x3c4abf['\x77\x78\x79\x47\x47'], '\x69\x63\x6f\x6e': _0x3c4abf['\x74\x56\x47\x48\x4d'], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });
  }, '\x62\x75\x79\x4e\x6f\x77': function buyNow() {
    var _0x14c975 = { '\x46\x57\x44\x41\x49': wanzikun_0xa087('0x82'), '\x62\x66\x54\x57\x6c': wanzikun_0xa087('0x83'), '\x66\x76\x41\x6d\x47': wanzikun_0xa087('0x84'), '\x74\x67\x74\x4b\x70': wanzikun_0xa087('0x1c'), '\x78\x4a\x52\x57\x56': wanzikun_0xa087('0x85'), '\x71\x71\x50\x66\x64': function qqPfd(_0x3d8be3, _0x7872c4) {
        return _0x3d8be3 < _0x7872c4;
      }, '\x53\x55\x55\x58\x57': wanzikun_0xa087('0x86'), '\x6e\x62\x79\x45\x4d': wanzikun_0xa087('0x75'), '\x71\x72\x77\x59\x65': wanzikun_0xa087('0x87'), '\x68\x64\x62\x4a\x49': wanzikun_0xa087('0x88') };if (this[wanzikun_0xa087('0x19')]['\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c'][wanzikun_0xa087('0x28')] && !this[wanzikun_0xa087('0x19')]['\x63\x61\x6e\x53\x75\x62\x6d\x69\x74']) {
      if (!this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x1a')]) {
        wx[wanzikun_0xa087('0x1b')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x14c975['\x74\x67\x74\x4b\x70'], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });
      }this[wanzikun_0xa087('0x1d')]();wx[wanzikun_0xa087('0x1b')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x14c975[wanzikun_0xa087('0x89')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
    }if (_0x14c975[wanzikun_0xa087('0x8a')](this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x49')], 0x1)) {
      if (_0x14c975[wanzikun_0xa087('0x8b')] === wanzikun_0xa087('0x86')) {
        wx[wanzikun_0xa087('0x1b')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x14c975[wanzikun_0xa087('0x8c')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
      } else {
        if (res['\x64\x61\x74\x61'][wanzikun_0xa087('0x30')] != 0x0) {
          wx[wanzikun_0xa087('0x1b')]({ '\x74\x69\x74\x6c\x65': _0x14c975[wanzikun_0xa087('0x8d')], '\x63\x6f\x6e\x74\x65\x6e\x74': _0x14c975[wanzikun_0xa087('0x8e')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![], '\x73\x75\x63\x63\x65\x73\x73': function success(_0x39a5fe) {} });
        } else {
          that[wanzikun_0xa087('0x13')]({ '\x77\x78\x6c\x6f\x67\x69\x6e': !![] });wanzikun_0x2f397f[wanzikun_0xa087('0x8f')]();wx['\x73\x68\x6f\x77\x54\x6f\x61\x73\x74']({ '\x74\x69\x74\x6c\x65': _0x14c975[wanzikun_0xa087('0x90')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });wanzikun_0x2f397f[wanzikun_0xa087('0x5')]['\x75\x73\x69\x6e\x66\x6f'] = 0x1;
        }
      }
    }var _0x55b4e2 = this[wanzikun_0xa087('0x91')]();wx[wanzikun_0xa087('0xf')]({ '\x6b\x65\x79': _0x14c975[wanzikun_0xa087('0x92')], '\x64\x61\x74\x61': _0x55b4e2 });this[wanzikun_0xa087('0x81')]();wx[wanzikun_0xa087('0x93')]({ '\x75\x72\x6c': _0x14c975[wanzikun_0xa087('0x94')] });
  }, '\x62\x75\x6c\x69\x64\x53\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f': function bulidShopCarInfo() {
    var _0x153695 = { '\x41\x55\x41\x4b\x67': function AUAKg(_0x1a4188, _0x231f36) {
        return _0x1a4188 === _0x231f36;
      }, '\x58\x64\x69\x6e\x77': function Xdinw(_0x3c27cb, _0x280a62) {
        return _0x3c27cb == _0x280a62;
      }, '\x48\x63\x6e\x55\x79': wanzikun_0xa087('0x84'), '\x64\x48\x4d\x50\x70': wanzikun_0xa087('0x95'), '\x72\x5a\x74\x4c\x76': wanzikun_0xa087('0x96'), '\x65\x50\x55\x41\x55': function ePUAU(_0x1b11dd, _0xac12d7) {
        return _0x1b11dd !== _0xac12d7;
      }, '\x4c\x41\x42\x46\x45': wanzikun_0xa087('0x97'), '\x6a\x50\x4b\x67\x70': function jPKgp(_0x2b7c9a, _0x3899ff) {
        return _0x2b7c9a < _0x3899ff;
      }, '\x67\x41\x68\x64\x70': wanzikun_0xa087('0x98'), '\x79\x4f\x4f\x63\x4d': function yOOcM(_0x50edb5, _0x60f2c9) {
        return _0x50edb5 + _0x60f2c9;
      }, '\x69\x6b\x6a\x44\x4b': function ikjDK(_0x5d29c, _0x4c7f40) {
        return _0x5d29c + _0x4c7f40;
      }, '\x51\x66\x66\x4a\x49': function QffJI(_0x30dbca, _0x55a39d) {
        return _0x30dbca > _0x55a39d;
      }, '\x58\x58\x47\x52\x45': function XXGRE(_0x19a458, _0x995a00) {
        return _0x19a458 !== _0x995a00;
      }, '\x72\x6c\x47\x46\x54': '\x6e\x44\x63\x69\x61' };var _0x1bac6c = {};_0x1bac6c[wanzikun_0xa087('0x57')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')]['\x69\x64'];_0x1bac6c[wanzikun_0xa087('0x51')] = this['\x64\x61\x74\x61'][wanzikun_0xa087('0x2d')]['\x62\x61\x73\x69\x63\x49\x6e\x66\x6f'][wanzikun_0xa087('0x51')];_0x1bac6c[wanzikun_0xa087('0x35')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x35')];_0x1bac6c['\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73'] = this[wanzikun_0xa087('0x19')]['\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73'];_0x1bac6c[wanzikun_0xa087('0x4f')] = this[wanzikun_0xa087('0x19')]['\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x4e\x61\x6d\x65\x73'];_0x1bac6c['\x70\x72\x69\x63\x65'] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x99')];_0x1bac6c[wanzikun_0xa087('0x54')] = '';_0x1bac6c[wanzikun_0xa087('0x63')] = !![];_0x1bac6c[wanzikun_0xa087('0x58')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x49')];_0x1bac6c[wanzikun_0xa087('0x50')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x9a')];_0x1bac6c['\x6c\x6f\x67\x69\x73\x74\x69\x63\x73'] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x53')];_0x1bac6c[wanzikun_0xa087('0x55')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')]['\x77\x65\x69\x67\x68\x74'];var _0x555140 = this[wanzikun_0xa087('0x19')]['\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f'];if (!_0x555140[wanzikun_0xa087('0x1e')]) {
      if (_0x153695['\x41\x55\x41\x4b\x67'](_0x153695[wanzikun_0xa087('0x9b')], _0x153695['\x72\x5a\x74\x4c\x76'])) {
        var _0x2a7510 = this;if (_0x153695['\x41\x55\x41\x4b\x67'](this['\x64\x61\x74\x61'][wanzikun_0xa087('0x9c')], e[wanzikun_0xa087('0x9d')][wanzikun_0xa087('0x64')][wanzikun_0xa087('0x9e')])) {
          return ![];
        } else {
          _0x2a7510[wanzikun_0xa087('0x13')]({ '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x62': e['\x74\x61\x72\x67\x65\x74']['\x64\x61\x74\x61\x73\x65\x74'][wanzikun_0xa087('0x9e')] });
        }
      } else {
        _0x555140[wanzikun_0xa087('0x1e')] = 0x0;
      }
    }if (!_0x555140[wanzikun_0xa087('0x56')]) {
      if (_0x153695[wanzikun_0xa087('0x9f')](_0x153695['\x4c\x41\x42\x46\x45'], '\x72\x6d\x61\x72\x6f')) {
        if (_0x153695[wanzikun_0xa087('0xa0')](wanzikun_0x2f397f[wanzikun_0xa087('0x5')]['\x75\x73\x69\x6e\x66\x6f'], 0x0)) {
          that[wanzikun_0xa087('0x13')]({ '\x77\x78\x6c\x6f\x67\x69\x6e': ![] });
        }
      } else {
        _0x555140[wanzikun_0xa087('0x56')] = [];
      }
    }var _0x236ef5 = -0x1;for (var _0x56ddfb = 0x0; _0x153695[wanzikun_0xa087('0xa1')](_0x56ddfb, _0x555140[wanzikun_0xa087('0x56')][wanzikun_0xa087('0x62')]); _0x56ddfb++) {
      var _0x560cc4 = _0x555140[wanzikun_0xa087('0x56')][_0x56ddfb];if (_0x153695[wanzikun_0xa087('0xa0')](_0x560cc4[wanzikun_0xa087('0x57')], _0x1bac6c[wanzikun_0xa087('0x57')]) && _0x560cc4[wanzikun_0xa087('0x59')] == _0x1bac6c[wanzikun_0xa087('0x59')]) {
        if (_0x153695[wanzikun_0xa087('0xa2')]('\x50\x51\x69\x59\x61', _0x153695[wanzikun_0xa087('0xa3')])) {
          _0x236ef5 = _0x56ddfb;_0x1bac6c[wanzikun_0xa087('0x58')] = _0x153695[wanzikun_0xa087('0xa4')](_0x1bac6c[wanzikun_0xa087('0x58')], _0x560cc4[wanzikun_0xa087('0x58')]);break;
        } else {
          that[wanzikun_0xa087('0x13')]({ '\x77\x78\x6c\x6f\x67\x69\x6e': !![] });wanzikun_0x2f397f[wanzikun_0xa087('0x8f')]();wx[wanzikun_0xa087('0x31')]({ '\x74\x69\x74\x6c\x65': _0x153695[wanzikun_0xa087('0xa5')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x6')] = 0x1;
        }
      }
    }_0x555140[wanzikun_0xa087('0x1e')] = _0x153695[wanzikun_0xa087('0xa6')](_0x555140[wanzikun_0xa087('0x1e')], this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x49')]);if (_0x153695[wanzikun_0xa087('0xa7')](_0x236ef5, -0x1)) {
      if (_0x153695[wanzikun_0xa087('0xa8')]('\x5a\x67\x6b\x4f\x49', _0x153695[wanzikun_0xa087('0xa9')])) {
        _0x555140[wanzikun_0xa087('0x56')][wanzikun_0xa087('0xaa')](_0x236ef5, 0x1, _0x1bac6c);
      } else {
        return ![];
      }
    } else {
      _0x555140[wanzikun_0xa087('0x56')][wanzikun_0xa087('0xab')](_0x1bac6c);
    }return _0x555140;
  }, '\x62\x75\x6c\x69\x64\x75\x42\x75\x79\x4e\x6f\x77\x49\x6e\x66\x6f': function buliduBuyNowInfo() {
    var _0x5250dd = { '\x43\x4d\x4c\x78\x65': function CMLxe(_0x232f88, _0x1ce7e8) {
        return _0x232f88 === _0x1ce7e8;
      }, '\x49\x63\x4e\x56\x78': wanzikun_0xa087('0xac') };var _0x42f875 = {};_0x42f875[wanzikun_0xa087('0x57')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')]['\x62\x61\x73\x69\x63\x49\x6e\x66\x6f']['\x69\x64'];_0x42f875[wanzikun_0xa087('0x51')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x51')];_0x42f875[wanzikun_0xa087('0x35')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x35')];_0x42f875[wanzikun_0xa087('0x59')] = this['\x64\x61\x74\x61'][wanzikun_0xa087('0x59')];_0x42f875[wanzikun_0xa087('0x4f')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0xad')];_0x42f875[wanzikun_0xa087('0x52')] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x99')];_0x42f875['\x6c\x65\x66\x74'] = '';_0x42f875[wanzikun_0xa087('0x63')] = !![];_0x42f875[wanzikun_0xa087('0x58')] = this['\x64\x61\x74\x61'][wanzikun_0xa087('0x49')];_0x42f875['\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x54\x79\x70\x65'] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')]['\x62\x61\x73\x69\x63\x49\x6e\x66\x6f'][wanzikun_0xa087('0x9a')];_0x42f875['\x6c\x6f\x67\x69\x73\x74\x69\x63\x73'] = this[wanzikun_0xa087('0x19')]['\x67\x6f\x6f\x64\x73\x44\x65\x74\x61\x69\x6c']['\x6c\x6f\x67\x69\x73\x74\x69\x63\x73'];_0x42f875['\x77\x65\x69\x67\x68\x74'] = this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')][wanzikun_0xa087('0x55')];var _0x2ec955 = {};if (!_0x2ec955[wanzikun_0xa087('0x1e')]) {
      _0x2ec955[wanzikun_0xa087('0x1e')] = 0x0;
    }if (!_0x2ec955[wanzikun_0xa087('0x56')]) {
      if (_0x5250dd[wanzikun_0xa087('0xae')](_0x5250dd[wanzikun_0xa087('0xaf')], _0x5250dd['\x49\x63\x4e\x56\x78'])) {
        _0x2ec955[wanzikun_0xa087('0x56')] = [];
      } else {
        that[wanzikun_0xa087('0x3c')](res[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2e')]['\x76\x69\x64\x65\x6f\x49\x64']);
      }
    }_0x2ec955[wanzikun_0xa087('0x56')][wanzikun_0xa087('0xab')](_0x42f875);return _0x2ec955;
  }, '\x6f\x6e\x53\x68\x61\x72\x65\x41\x70\x70\x4d\x65\x73\x73\x61\x67\x65': function onShareAppMessage() {
    var _0x1f5c75 = { '\x4c\x49\x4c\x4f\x65': function LILOe(_0x1ac5e4, _0x79e2d8) {
        return _0x1ac5e4 + _0x79e2d8;
      }, '\x6e\x58\x73\x42\x52': wanzikun_0xa087('0xb0') };return { '\x74\x69\x74\x6c\x65': this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')]['\x62\x61\x73\x69\x63\x49\x6e\x66\x6f'][wanzikun_0xa087('0x35')], '\x70\x61\x74\x68': _0x1f5c75['\x4c\x49\x4c\x4f\x65'](_0x1f5c75[wanzikun_0xa087('0xb1')](wanzikun_0xa087('0xb2') + this['\x64\x61\x74\x61'][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')]['\x69\x64'], _0x1f5c75[wanzikun_0xa087('0xb3')]), wanzikun_0x2f397f['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61']['\x75\x69\x64']), '\x73\x75\x63\x63\x65\x73\x73': function success(_0x538462) {}, '\x66\x61\x69\x6c': function fail(_0x59ceba) {} };
  }, '\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e': function reputation(_0x50a5a6) {
    var _0x73f702 = { '\x6f\x43\x67\x72\x43': function oCgrC(_0x4d304c, _0x4d099e) {
        return _0x4d304c == _0x4d099e;
      }, '\x70\x44\x7a\x64\x56': function pDzdV(_0xc9a0b0, _0x37b4b2) {
        return _0xc9a0b0 + _0x37b4b2;
      }, '\x4b\x71\x51\x46\x47': '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e' };var _0xc3aa44 = this;wx[wanzikun_0xa087('0x1f')]({ '\x75\x72\x6c': _0x73f702[wanzikun_0xa087('0xb4')](wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x21')], _0x73f702[wanzikun_0xa087('0xb5')]), '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': _0x50a5a6 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0xc39406) {
        if (_0x73f702[wanzikun_0xa087('0xb6')](_0xc39406[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x30')], 0x0)) {
          _0xc3aa44[wanzikun_0xa087('0x13')]({ '\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e': _0xc39406[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')] });
        }
      } });
  }, '\x67\x65\x74\x56\x69\x64\x65\x6f\x53\x72\x63': function getVideoSrc(_0x41c755) {
    var _0x231673 = { '\x64\x56\x53\x65\x4c': wanzikun_0xa087('0xb7') };var _0x8d46bb = this;wx[wanzikun_0xa087('0x1f')]({ '\x75\x72\x6c': wanzikun_0x2f397f[wanzikun_0xa087('0x5')]['\x75\x72\x6c\x73'] + _0x231673[wanzikun_0xa087('0xb8')], '\x64\x61\x74\x61': { '\x76\x69\x64\x65\x6f\x49\x64': _0x41c755 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x5d3424) {
        if (_0x5d3424[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x30')] == 0x0) {
          _0x8d46bb[wanzikun_0xa087('0x13')]({ '\x76\x69\x64\x65\x6f\x4d\x70\x34\x53\x72\x63': _0x5d3424[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')][wanzikun_0xa087('0xb9')] });
        }
      } });
  }, '\x62\x69\x6e\x64\x43\x68\x61\x6e\x67\x65': function bindChange(_0xf39c0d) {
    var _0x37be00 = this;_0x37be00[wanzikun_0xa087('0x13')]({ '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x62': _0xf39c0d['\x64\x65\x74\x61\x69\x6c'][wanzikun_0xa087('0x9e')] });
  }, '\x73\x77\x69\x63\x68\x4e\x61\x76': function swichNav(_0x1925ed) {
    var _0x4c43ed = { '\x74\x67\x4a\x69\x4b': function tgJiK(_0xca8a62, _0x185561) {
        return _0xca8a62 === _0x185561;
      } };var _0x29b408 = this;if (_0x4c43ed['\x74\x67\x4a\x69\x4b'](this[wanzikun_0xa087('0x19')]['\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x62'], _0x1925ed['\x74\x61\x72\x67\x65\x74'][wanzikun_0xa087('0x64')][wanzikun_0xa087('0x9e')])) {
      return ![];
    } else {
      _0x29b408[wanzikun_0xa087('0x13')]({ '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x62': _0x1925ed['\x74\x61\x72\x67\x65\x74'][wanzikun_0xa087('0x64')][wanzikun_0xa087('0x9e')] });
    }
  }, '\x67\x65\x74\x66\x61\x76': function getfav(_0x3b9751) {
    var _0x3f228c = { '\x47\x61\x70\x4b\x74': wanzikun_0xa087('0x8'), '\x6b\x5a\x4c\x65\x7a': wanzikun_0xa087('0xba'), '\x6c\x69\x69\x67\x57': function liigW(_0xd16a84, _0x4dd972) {
        return _0xd16a84 == _0x4dd972;
      }, '\x4c\x58\x73\x69\x43': function LXsiC(_0x1f287b, _0x10b82f) {
        return _0x1f287b + _0x10b82f;
      }, '\x5a\x53\x68\x56\x5a': '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e', '\x42\x49\x48\x43\x45': function BIHCE(_0x57e876, _0x3f1356) {
        return _0x57e876 === _0x3f1356;
      }, '\x4f\x6c\x51\x68\x6d': wanzikun_0xa087('0xbb'), '\x42\x73\x7a\x75\x57': function BszuW(_0x998f5c, _0x3f050b) {
        return _0x998f5c !== _0x3f050b;
      }, '\x6f\x6f\x55\x6d\x42': '\x73\x70\x74\x70\x73', '\x56\x7a\x6e\x69\x6a': function Vznij(_0x385a49, _0x174892) {
        return _0x385a49 < _0x174892;
      }, '\x51\x59\x45\x41\x65': function QYEAe(_0x45be3b, _0x4269c9) {
        return _0x45be3b !== _0x4269c9;
      }, '\x6b\x6a\x75\x59\x6a': wanzikun_0xa087('0xbc') };var _0x164f6b = this;wx[wanzikun_0xa087('0x1f')]({ '\x75\x72\x6c': wanzikun_0x2f397f[wanzikun_0xa087('0x5')]['\x75\x72\x6c\x73'] + wanzikun_0xa087('0xbd'), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x2f')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x2f66ba) {
        if (_0x3f228c['\x42\x49\x48\x43\x45'](wanzikun_0xa087('0xbe'), _0x3f228c[wanzikun_0xa087('0xbf')])) {
          if (_0x2f66ba[wanzikun_0xa087('0x19')]['\x63\x6f\x64\x65'] == 0x0) {
            wx[wanzikun_0xa087('0x31')]({ '\x74\x69\x74\x6c\x65': wanzikun_0xa087('0xc0'), '\x69\x63\x6f\x6e': _0x3f228c[wanzikun_0xa087('0xc1')], '\x69\x6d\x61\x67\x65': _0x3f228c[wanzikun_0xa087('0xc2')], '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });_0x164f6b[wanzikun_0xa087('0x13')]({ '\x66\x61\x76\x69\x63\x6f\x6e': 0x0 });
          }
        } else {
          if (_0x2f66ba[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x30')] == 0x0 && _0x2f66ba[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')]['\x6c\x65\x6e\x67\x74\x68']) {
            if (_0x3f228c[wanzikun_0xa087('0xc3')]('\x4e\x42\x48\x53\x70', _0x3f228c['\x6f\x6f\x55\x6d\x42'])) {
              for (var _0x46ef40 = 0x0; _0x3f228c[wanzikun_0xa087('0xc4')](_0x46ef40, _0x2f66ba[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')]['\x6c\x65\x6e\x67\x74\x68']); _0x46ef40++) {
                if (_0x2f66ba[wanzikun_0xa087('0x19')]['\x64\x61\x74\x61'][_0x46ef40]['\x67\x6f\x6f\x64\x73\x49\x64'] == parseInt(_0x3b9751['\x69\x64'])) {
                  if (_0x3f228c[wanzikun_0xa087('0xc5')](_0x3f228c['\x6b\x6a\x75\x59\x6a'], _0x3f228c[wanzikun_0xa087('0xc6')])) {
                    shopCarInfo[wanzikun_0xa087('0x56')][wanzikun_0xa087('0xaa')](hasSameGoodsIndex, 0x1, shopCarMap);
                  } else {
                    _0x164f6b[wanzikun_0xa087('0x13')]({ '\x66\x61\x76\x69\x63\x6f\x6e': 0x1 });break;
                  }
                }
              }
            } else {
              var _0x4d5ac5 = { '\x53\x72\x74\x54\x4f': function SrtTO(_0x366f17, _0x212e04) {
                  return _0x3f228c[wanzikun_0xa087('0xc7')](_0x366f17, _0x212e04);
                } };var _0x4c4f72 = this;wx[wanzikun_0xa087('0x1f')]({ '\x75\x72\x6c': _0x3f228c[wanzikun_0xa087('0xc8')](wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x21')], _0x3f228c[wanzikun_0xa087('0xc9')]), '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': goodsId }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0xc3b86b) {
                  if (_0x4d5ac5[wanzikun_0xa087('0xca')](_0xc3b86b['\x64\x61\x74\x61'][wanzikun_0xa087('0x30')], 0x0)) {
                    _0x4c4f72[wanzikun_0xa087('0x13')]({ '\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e': _0xc3b86b[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x19')] });
                  }
                } });
            }
          }
        }
      } });
  }, '\x66\x61\x76': function fav() {
    var _0x53af12 = { '\x57\x4d\x6e\x79\x63': '\u6536\u85CF\u6210\u529F', '\x56\x63\x53\x5a\x68': '\x73\x75\x63\x63\x65\x73\x73' };var _0x54fb04 = this;wx[wanzikun_0xa087('0x1f')]({ '\x75\x72\x6c': wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x21')] + wanzikun_0xa087('0xcb'), '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')]['\x69\x64'], '\x74\x6f\x6b\x65\x6e': wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x2f')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x45baac) {
        if (_0x45baac['\x64\x61\x74\x61'][wanzikun_0xa087('0x30')] == 0x0) {
          wx[wanzikun_0xa087('0x31')]({ '\x74\x69\x74\x6c\x65': _0x53af12[wanzikun_0xa087('0xcc')], '\x69\x63\x6f\x6e': _0x53af12[wanzikun_0xa087('0xcd')], '\x69\x6d\x61\x67\x65': '\x2e\x2e\x2f\x2e\x2e\x2f\x69\x6d\x61\x67\x65\x73\x2f\x43\x6f\x6f\x6c\x2d\x6c\x6f\x76\x65\x2d\x6f\x2e\x70\x6e\x67', '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });_0x54fb04[wanzikun_0xa087('0x13')]({ '\x66\x61\x76\x69\x63\x6f\x6e': 0x1 });
        }
      } });
  }, '\x64\x65\x6c': function del() {
    var _0x77650 = { '\x6f\x59\x74\x72\x75': wanzikun_0xa087('0xc0'), '\x68\x74\x6f\x50\x55': wanzikun_0xa087('0x8'), '\x4b\x67\x42\x70\x48': function KgBpH(_0x2493c8, _0x19aea5) {
        return _0x2493c8 + _0x19aea5;
      }, '\x6b\x78\x79\x61\x46': '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x66\x61\x76\x2f\x64\x65\x6c\x65\x74\x65' };var _0x83de37 = this;wx[wanzikun_0xa087('0x1f')]({ '\x75\x72\x6c': _0x77650[wanzikun_0xa087('0xce')](wanzikun_0x2f397f[wanzikun_0xa087('0x5')]['\x75\x72\x6c\x73'], _0x77650[wanzikun_0xa087('0xcf')]), '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x49\x64': this[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x2d')][wanzikun_0xa087('0x2e')]['\x69\x64'], '\x74\x6f\x6b\x65\x6e': wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x2f')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x5dbc1e) {
        if (_0x5dbc1e[wanzikun_0xa087('0x19')][wanzikun_0xa087('0x30')] == 0x0) {
          wx[wanzikun_0xa087('0x31')]({ '\x74\x69\x74\x6c\x65': _0x77650[wanzikun_0xa087('0xd0')], '\x69\x63\x6f\x6e': _0x77650['\x68\x74\x6f\x50\x55'], '\x69\x6d\x61\x67\x65': wanzikun_0xa087('0xba'), '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });_0x83de37[wanzikun_0xa087('0x13')]({ '\x66\x61\x76\x69\x63\x6f\x6e': 0x0 });
        }
      } });
  }, '\x75\x73\x65\x72\x6c\x6f\x67\x69\x6e': function userlogin(_0xcebc06) {
    var _0x3e5213 = { '\x4d\x6e\x67\x73\x4e': wanzikun_0xa087('0x82'), '\x61\x4a\x75\x74\x71': function aJutq(_0x4374c1, _0x5f00f3) {
        return _0x4374c1 + _0x5f00f3;
      }, '\x42\x53\x42\x67\x51': wanzikun_0xa087('0xd1') };var _0x5f26a8 = '\x30\x7c\x34\x7c\x32\x7c\x31\x7c\x33'[wanzikun_0xa087('0x4e')]('\x7c'),
        _0x5239f9 = 0x0;while (!![]) {
      switch (_0x5f26a8[_0x5239f9++]) {case '\x30':
          var _0x5615b5 = { '\x55\x62\x51\x76\x48': _0x3e5213[wanzikun_0xa087('0xd2')], '\x69\x5a\x6e\x6f\x55': function iZnoU(_0x1d656a, _0x5b99c2) {
              return _0x3e5213[wanzikun_0xa087('0xd3')](_0x1d656a, _0x5b99c2);
            }, '\x77\x70\x6e\x75\x4e': _0x3e5213[wanzikun_0xa087('0xd4')] };continue;case '\x31':
          var _0xd0d009 = _0xcebc06[wanzikun_0xa087('0xd5')][wanzikun_0xa087('0xd6')];continue;case '\x32':
          var _0x765fa8 = _0xcebc06[wanzikun_0xa087('0xd5')]['\x69\x76'];continue;case '\x33':
          wx[wanzikun_0xa087('0x8f')]({ '\x73\x75\x63\x63\x65\x73\x73': function success(_0x4a352a) {
              var _0x5745e5 = { '\x56\x44\x6a\x78\x74': _0x5615b5[wanzikun_0xa087('0xd7')], '\x4a\x41\x4d\x78\x78': wanzikun_0xa087('0x83') };wx[wanzikun_0xa087('0x1f')]({ '\x75\x72\x6c': _0x5615b5['\x69\x5a\x6e\x6f\x55'](wanzikun_0x2f397f[wanzikun_0xa087('0x5')][wanzikun_0xa087('0x21')], _0x5615b5[wanzikun_0xa087('0xd8')]), '\x64\x61\x74\x61': { '\x63\x6f\x64\x65': _0x4a352a[wanzikun_0xa087('0x30')], '\x65\x6e\x63\x72\x79\x70\x74\x65\x64\x44\x61\x74\x61': _0xd0d009, '\x69\x76': _0x765fa8 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x2d5a02) {
                  if (_0x2d5a02['\x64\x61\x74\x61'][wanzikun_0xa087('0x30')] != 0x0) {
                    wx[wanzikun_0xa087('0x1b')]({ '\x74\x69\x74\x6c\x65': _0x5745e5[wanzikun_0xa087('0xd9')], '\x63\x6f\x6e\x74\x65\x6e\x74': _0x5745e5[wanzikun_0xa087('0xda')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![], '\x73\x75\x63\x63\x65\x73\x73': function success(_0x2d5a02) {} });
                  } else {
                    _0x26cdf5[wanzikun_0xa087('0x13')]({ '\x77\x78\x6c\x6f\x67\x69\x6e': !![] });wanzikun_0x2f397f[wanzikun_0xa087('0x8f')]();wx[wanzikun_0xa087('0x31')]({ '\x74\x69\x74\x6c\x65': wanzikun_0xa087('0x84'), '\x64\x75\x72\x61\x74\x69\x6f\x6e': 0x7d0 });wanzikun_0x2f397f['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0xa087('0x6')] = 0x1;
                  }
                } });
            } });continue;case '\x34':
          var _0x26cdf5 = this;continue;}break;
    }
  } }); 
 			}); 	require("pages/goods-details/index.js");
 		__wxRoute = 'pages/to-pay-order/index';__wxRouteBegin = true; 	define("pages/to-pay-order/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x459e = ['\x54\x64\x67\x44\x62', '\x76\x61\x6c\x75\x65', '\x72\x65\x6d\x61\x72\x6b', '\x2f\x70\x61\x67\x65\x73\x2f\x73\x65\x6c\x65\x63\x74\x2d\x61\x64\x64\x72\x65\x73\x73\x2f\x69\x6e\x64\x65\x78', '\x77\x43\x47\x6d\x42', '\x59\x42\x4a\x4e\x54', '\x6d\x53\x63\x4d\x57', '\x47\x4d\x69\x43\x4c', '\x66\x58\x46\x63\x64', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x59\x7a\x46\x78\x63', '\x6f\x42\x79\x6b\x58', '\x59\x4d\x54\x5a\x72', '\x54\x64\x71\x7a\x54', '\x51\x41\x4b\x42\x4a', '\x70\x61\x67\x65\x73\x2f\x69\x6e\x64\x65\x78\x2f\x69\x6e\x64\x65\x78', '\u60A8\u7684\u8BA2\u5355\u5DF2\u53D1\u8D27\uFF0C\u8BF7\u6CE8\u610F\u67E5\u6536', '\x70\x61\x67\x65\x73\x2f\x6f\x72\x64\x65\x72\x2d\x64\x65\x74\x61\x69\x6c\x73\x2f\x69\x6e\x64\x65\x78\x3f\x69\x64\x3d', '\x44\x6e\x49\x6d\x57', '\x6f\x6f\x46\x6b\x4a', '\u8BF7\u5148\u8BBE\u7F6E\u60A8\u7684\u6536\u8D27\u5730\u5740', '\x5a\x73\x4a\x6f\x4d', '\x62\x6b\x77\x6a\x70', '\x74\x72\x75\x65', '\x2f\x6f\x72\x64\x65\x72\x2f\x63\x72\x65\x61\x74\x65', '\x61\x70\x70\x6c\x69\x63\x61\x74\x69\x6f\x6e\x2f\x78\x2d\x77\x77\x77\x2d\x66\x6f\x72\x6d\x2d\x75\x72\x6c\x65\x6e\x63\x6f\x64\x65\x64', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x74\x6f\x6b\x65\x6e', '\x48\x43\x56\x6d\x6e', '\x64\x65\x74\x61\x69\x6c', '\x42\x56\x78\x77\x6e', '\x6e\x6a\x6a\x6f\x56', '\x63\x6f\x75\x70\x6f\x6e\x73', '\x6d\x6f\x6e\x65\x79', '\x67\x6f\x6f\x64\x73\x4a\x73\x6f\x6e\x53\x74\x72', '\x57\x67\x73\x6d\x5a', '\x69\x73\x4e\x65\x65\x64\x4c\x6f\x67\x69\x73\x74\x69\x63\x73', '\x63\x75\x72\x41\x64\x64\x72\x65\x73\x73\x44\x61\x74\x61', '\x78\x65\x79\x57\x4b', '\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67', '\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c', '\x70\x72\x6f\x76\x69\x6e\x63\x65\x49\x64', '\x63\x69\x74\x79\x49\x64', '\x64\x69\x73\x74\x72\x69\x63\x74\x49\x64', '\x58\x72\x70\x46\x71', '\x58\x45\x6f\x70\x42', '\x61\x64\x64\x72\x65\x73\x73', '\x6c\x69\x6e\x6b\x4d\x61\x6e', '\x63\x6f\x64\x65', '\x63\x75\x72\x43\x6f\x75\x70\x6f\x6e', '\x63\x61\x6c\x63\x75\x6c\x61\x74\x65', '\x5a\x66\x6a\x4d\x62', '\x72\x65\x71\x75\x65\x73\x74', '\x75\x72\x6c\x73', '\x43\x6e\x6a\x52\x73', '\x4a\x46\x4b\x46\x49', '\x45\x6e\x53\x41\x4e', '\x63\x52\x47\x72\x42', '\x72\x44\x6f\x71\x6c', '\x6d\x73\x67', '\x47\x72\x79\x68\x77', '\x72\x65\x6d\x6f\x76\x65\x53\x74\x6f\x72\x61\x67\x65\x53\x79\x6e\x63', '\x4c\x4c\x6d\x7a\x45', '\x55\x62\x51\x48\x51', '\x61\x6d\x6f\x75\x6e\x74\x4c\x6f\x67\x69\x73\x74\x69\x63\x73', '\x67\x65\x74\x4d\x79\x43\x6f\x75\x70\x6f\x6e\x73', '\x6b\x65\x79\x77\x6f\x72\x64\x31', '\x6f\x4d\x6a\x77\x77', '\x61\x6d\x6f\x75\x6e\x74\x52\x65\x61\x6c', '\x6b\x65\x79\x77\x6f\x72\x64\x33', '\x6f\x72\x64\x65\x72\x4e\x75\x6d\x62\x65\x72', '\x23\x31\x37\x33\x31\x37\x37', '\x6b\x65\x79\x77\x6f\x72\x64\x34', '\u8BA2\u5355\u5DF2\u5173\u95ED', '\x6b\x65\x79\x77\x6f\x72\x64\x35', '\x73\x65\x6e\x64\x54\x65\x6d\x70\x6c\x65\x4d\x73\x67', '\x73\x69\x74\x65\x49\x6e\x66\x6f', '\x63\x6c\x6f\x73\x65\x6f\x72\x64\x65\x72\x6b\x65\x79', '\x66\x6f\x72\x6d\x49\x64', '\x73\x74\x72\x69\x6e\x67\x69\x66\x79', '\x42\x69\x6e\x73\x67', '\x6b\x65\x79\x77\x6f\x72\x64\x32', '\x64\x61\x74\x65\x41\x64\x64', '\x64\x65\x6c\x69\x76\x65\x72\x79\x6f\x72\x64\x65\x72\x6b\x65\x79', '\x49\x6e\x6c\x69\x4c', '\x74\x6a\x77\x71\x77', '\x2f\x75\x73\x65\x72\x2f\x73\x68\x69\x70\x70\x69\x6e\x67\x2d\x61\x64\x64\x72\x65\x73\x73\x2f\x64\x65\x66\x61\x75\x6c\x74', '\x45\x4c\x43\x57\x61', '\x64\x6e\x73\x45\x4e', '\x42\x59\x63\x4c\x72', '\x6a\x46\x59\x76\x51', '\x71\x59\x47\x43\x74', '\x66\x69\x6c\x74\x65\x72', '\x6d\x4a\x6f\x6d\x64', '\x61\x6c\x6c\x47\x6f\x6f\x64\x73\x41\x6e\x64\x59\x75\x6e\x50\x72\x69\x63\x65', '\x4c\x51\x42\x58\x44', '\x6c\x65\x6e\x67\x74\x68', '\x70\x72\x6f\x63\x65\x73\x73\x59\x75\x6e\x66\x65\x69', '\x69\x6e\x76\x69\x74\x65\x72\x5f\x69\x64\x5f', '\x7b\x22\x67\x6f\x6f\x64\x73\x49\x64\x22\x3a', '\x2c\x22\x6e\x75\x6d\x62\x65\x72\x22\x3a', '\x2c\x22\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73\x22\x3a\x22', '\x22\x2c\x22\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x54\x79\x70\x65\x22\x3a\x30\x2c\x20\x22\x69\x6e\x76\x69\x74\x65\x72\x5f\x69\x64\x22\x3a', '\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74', '\x49\x43\x54\x53\x73', '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73', '\x70\x72\x69\x63\x65', '\x49\x78\x62\x76\x63', '\x49\x61\x72\x4d\x4d', '\x46\x71\x6b\x69\x4e', '\x67\x6f\x6f\x64\x73\x49\x64', '\x67\x4a\x6c\x65\x53', '\x6e\x79\x7a\x47\x52', '\x75\x70\x78\x62\x49', '\x4f\x59\x50\x79\x67', '\x68\x50\x41\x75\x6c', '\x55\x70\x6b\x5a\x50', '\x74\x67\x44\x6d\x4c', '\x6e\x75\x6d\x62\x65\x72', '\x6b\x53\x6d\x48\x6c', '\x70\x72\x6f\x70\x65\x72\x74\x79\x43\x68\x69\x6c\x64\x49\x64\x73', '\x55\x6e\x75\x4f\x77', '\x63\x72\x65\x61\x74\x65\x4f\x72\x64\x65\x72', '\x2f\x70\x61\x67\x65\x73\x2f\x61\x64\x64\x72\x65\x73\x73\x2d\x61\x64\x64\x2f\x69\x6e\x64\x65\x78', '\x68\x72\x74\x72\x76', '\x49\x78\x6f\x73\x65', '\x44\x4b\x46\x50\x57', '\x6f\x50\x52\x57\x76', '\x2f\x64\x69\x73\x63\x6f\x75\x6e\x74\x73\x2f\x6d\x79', '\x79\x6c\x78\x55\x52', '\x5a\x41\x6c\x4f\x43', '\x44\x61\x55\x63\x69', '\x6d\x6f\x6e\x65\x79\x48\x72\x65\x73\x68\x6f\x6c\x64', '\x73\x61\x71\x48\x64', '\x68\x68\x66\x74\x61', '\x63\x6f\x75\x70\x6f\x6e\x49\x64', '\x4c\x75\x6c\x7a\x6f', '\x46\x7a\x61\x72\x70', '\x62\x75\x79\x4e\x6f\x77', '\x41\x70\x66\x6a\x48', '\x6f\x51\x75\x66\x6a', '\x63\x51\x76\x53\x71', '\x73\x68\x6f\x70\x43\x61\x72\x49\x6e\x66\x6f', '\x42\x4c\x44\x69\x45', '\x67\x71\x48\x69\x68', '\x64\x61\x74\x61', '\x6f\x72\x64\x65\x72\x54\x79\x70\x65', '\x67\x65\x74\x53\x74\x6f\x72\x61\x67\x65\x53\x79\x6e\x63', '\x62\x75\x79\x4e\x6f\x77\x49\x6e\x66\x6f', '\x73\x68\x6f\x70\x4c\x69\x73\x74', '\x4b\x4a\x4c\x74\x4a', '\x52\x57\x43\x50\x79', '\x4a\x44\x79\x7a\x7a', '\x50\x74\x70\x45\x59', '\x41\x77\x68\x41\x75', '\x46\x6d\x70\x78\x49', '\x62\x44\x78\x50\x6c', '\x45\x61\x58\x76\x73', '\x73\x65\x74\x44\x61\x74\x61', '\x4b\x6f\x5a\x65\x48'];(function (_0x2a0e01, _0x43620f) {
  var _0x34d73f = function _0x34d73f(_0x28074e) {
    while (--_0x28074e) {
      _0x2a0e01['push'](_0x2a0e01['shift']());
    }
  };_0x34d73f(++_0x43620f);
})(wanzikun_0x459e, 0x12a);var wanzikun_0x5222 = function wanzikun_0x5222(_0x106765, _0x1277b7) {
  _0x106765 = _0x106765 - 0x0;var _0x19f13e = wanzikun_0x459e[_0x106765];return _0x19f13e;
};var wanzikun_0x2ec3dd = getApp();Page({ '\x64\x61\x74\x61': { '\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74': [], '\x69\x73\x4e\x65\x65\x64\x4c\x6f\x67\x69\x73\x74\x69\x63\x73': 0x0, '\x61\x6c\x6c\x47\x6f\x6f\x64\x73\x50\x72\x69\x63\x65': 0x0, '\x79\x75\x6e\x50\x72\x69\x63\x65': 0x0, '\x61\x6c\x6c\x47\x6f\x6f\x64\x73\x41\x6e\x64\x59\x75\x6e\x50\x72\x69\x63\x65': 0x0, '\x67\x6f\x6f\x64\x73\x4a\x73\x6f\x6e\x53\x74\x72': '', '\x6f\x72\x64\x65\x72\x54\x79\x70\x65': '', '\x68\x61\x73\x4e\x6f\x43\x6f\x75\x70\x6f\x6e\x73': !![], '\x63\x6f\x75\x70\x6f\x6e\x73': [], '\x79\x6f\x75\x68\x75\x69\x6a\x69\x6e\x65': 0x0, '\x63\x75\x72\x43\x6f\x75\x70\x6f\x6e': null }, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    var _0x3a8f5d = { '\x50\x74\x70\x45\x59': function PtpEY(_0x380e18, _0xd69488) {
        return _0x380e18 <= _0xd69488;
      }, '\x42\x4c\x44\x69\x45': function BLDiE(_0x7ac65f, _0x3509f0) {
        return _0x7ac65f == _0x3509f0;
      }, '\x67\x71\x48\x69\x68': wanzikun_0x5222('0x0'), '\x4b\x4a\x4c\x74\x4a': function KJLtJ(_0x24281d, _0x3fe336) {
        return _0x24281d !== _0x3fe336;
      }, '\x4a\x44\x79\x7a\x7a': wanzikun_0x5222('0x1'), '\x41\x77\x68\x41\x75': function AwhAu(_0x4400dd, _0x19d7df) {
        return _0x4400dd === _0x19d7df;
      }, '\x46\x6d\x70\x78\x49': wanzikun_0x5222('0x2'), '\x62\x44\x78\x50\x6c': wanzikun_0x5222('0x3'), '\x45\x61\x58\x76\x73': wanzikun_0x5222('0x4') };var _0x202cf8 = this;var _0x515eda = [];if (_0x3a8f5d[wanzikun_0x5222('0x5')](_0x3a8f5d[wanzikun_0x5222('0x6')], _0x202cf8[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x8')])) {
      var _0x8885bf = wx[wanzikun_0x5222('0x9')](wanzikun_0x5222('0xa'));if (_0x8885bf && _0x8885bf[wanzikun_0x5222('0xb')]) {
        if (_0x3a8f5d[wanzikun_0x5222('0xc')](wanzikun_0x5222('0xd'), _0x3a8f5d[wanzikun_0x5222('0xe')])) {
          _0x515eda = _0x8885bf[wanzikun_0x5222('0xb')];
        } else {
          return _0x3a8f5d[wanzikun_0x5222('0xf')](entity['\x6d\x6f\x6e\x65\x79\x48\x72\x65\x73\x68\x6f\x6c\x64'], _0x202cf8[wanzikun_0x5222('0x7')]['\x61\x6c\x6c\x47\x6f\x6f\x64\x73\x41\x6e\x64\x59\x75\x6e\x50\x72\x69\x63\x65']);
        }
      }
    } else {
      if (_0x3a8f5d[wanzikun_0x5222('0x10')](_0x3a8f5d[wanzikun_0x5222('0x11')], _0x3a8f5d[wanzikun_0x5222('0x12')])) {
        return '';
      } else {
        var _0x12e02e = wx[wanzikun_0x5222('0x9')](_0x3a8f5d[wanzikun_0x5222('0x13')]);if (_0x12e02e && _0x12e02e[wanzikun_0x5222('0xb')]) {
          _0x515eda = _0x12e02e['\x73\x68\x6f\x70\x4c\x69\x73\x74']['\x66\x69\x6c\x74\x65\x72'](function (_0xa12ed7) {
            return _0xa12ed7['\x61\x63\x74\x69\x76\x65'];
          });
        }
      }
    }_0x202cf8[wanzikun_0x5222('0x14')]({ '\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74': _0x515eda });_0x202cf8['\x69\x6e\x69\x74\x53\x68\x69\x70\x70\x69\x6e\x67\x41\x64\x64\x72\x65\x73\x73']();
  }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad(_0x159981) {
    var _0x148acd = { '\x54\x64\x67\x44\x62': function TdgDb(_0x209d3a, _0x785e4d) {
        return _0x209d3a !== _0x785e4d;
      }, '\x75\x58\x71\x48\x66': wanzikun_0x5222('0x15') };var _0x4befd5 = '';if (_0x159981[wanzikun_0x5222('0x8')]) {
      if (_0x148acd[wanzikun_0x5222('0x16')](_0x148acd['\x75\x58\x71\x48\x66'], wanzikun_0x5222('0x15'))) {
        remark = _0x159981['\x64\x65\x74\x61\x69\x6c'][wanzikun_0x5222('0x17')][wanzikun_0x5222('0x18')];
      } else {
        _0x4befd5 = _0x159981[wanzikun_0x5222('0x8')];
      }
    }var _0x4973cc = this;_0x4973cc[wanzikun_0x5222('0x14')]({ '\x69\x73\x4e\x65\x65\x64\x4c\x6f\x67\x69\x73\x74\x69\x63\x73': 0x1, '\x6f\x72\x64\x65\x72\x54\x79\x70\x65': _0x4befd5 });
  }, '\x67\x65\x74\x44\x69\x73\x74\x72\x69\x63\x74\x49\x64': function getDistrictId(_0xad6a34, _0x2729c4) {
    var _0x19bdc5 = { '\x59\x7a\x46\x78\x63': wanzikun_0x5222('0x19'), '\x4b\x79\x79\x44\x6b': function KyyDk(_0x27a003, _0x5ea003) {
        return _0x27a003 === _0x5ea003;
      }, '\x47\x4d\x69\x43\x4c': wanzikun_0x5222('0x1a'), '\x66\x58\x46\x63\x64': wanzikun_0x5222('0x1b'), '\x6f\x42\x79\x6b\x58': wanzikun_0x5222('0x1c') };if (!_0xad6a34) {
      if (_0x19bdc5['\x4b\x79\x79\x44\x6b'](_0x19bdc5[wanzikun_0x5222('0x1d')], _0x19bdc5[wanzikun_0x5222('0x1e')])) {
        wx[wanzikun_0x5222('0x1f')]({ '\x75\x72\x6c': _0x19bdc5[wanzikun_0x5222('0x20')] });
      } else {
        return '';
      }
    }if (!_0x2729c4) {
      if (_0x19bdc5[wanzikun_0x5222('0x21')] === wanzikun_0x5222('0x22')) {
        wx[wanzikun_0x5222('0x1f')]({ '\x75\x72\x6c': '\x2f\x70\x61\x67\x65\x73\x2f\x61\x64\x64\x72\x65\x73\x73\x2d\x61\x64\x64\x2f\x69\x6e\x64\x65\x78' });
      } else {
        return '';
      }
    }return _0x2729c4;
  }, '\x63\x72\x65\x61\x74\x65\x4f\x72\x64\x65\x72': function createOrder(_0x412986) {
    var _0x1ad556 = { '\x42\x56\x78\x77\x6e': function BVxwn(_0x2c27e0, _0x30ec89) {
        return _0x2c27e0 - _0x30ec89;
      }, '\x6e\x6a\x6a\x6f\x56': function njjoV(_0x42e84a, _0x1725cd) {
        return _0x42e84a == _0x1725cd;
      }, '\x45\x6e\x53\x41\x4e': function EnSAN(_0x46c47e, _0x7ee89a) {
        return _0x46c47e === _0x7ee89a;
      }, '\x72\x44\x6f\x71\x6c': '\x63\x52\x47\x72\x42', '\x6d\x49\x6a\x64\x71': function mIjdq(_0x10bf83, _0x448f5f) {
        return _0x10bf83 != _0x448f5f;
      }, '\x47\x72\x79\x68\x77': wanzikun_0x5222('0x0'), '\x58\x72\x70\x46\x71': function XrpFq(_0x2e2990, _0x3546a4) {
        return _0x2e2990 !== _0x3546a4;
      }, '\x4c\x4c\x6d\x7a\x45': wanzikun_0x5222('0x23'), '\x55\x62\x51\x48\x51': wanzikun_0x5222('0x24'), '\x6f\x4d\x6a\x77\x77': '\x23\x31\x37\x33\x31\x37\x37', '\x49\x6e\x6c\x69\x4c': function InliL(_0x35edd9, _0xa7dc6c) {
        return _0x35edd9 + _0xa7dc6c;
      }, '\x59\x45\x74\x70\x57': wanzikun_0x5222('0x25'), '\x42\x69\x6e\x73\x67': wanzikun_0x5222('0x26'), '\x74\x6a\x77\x71\x77': wanzikun_0x5222('0x27'), '\x46\x58\x42\x64\x74': '\x2f\x70\x61\x67\x65\x73\x2f\x6f\x72\x64\x65\x72\x2d\x6c\x69\x73\x74\x2f\x69\x6e\x64\x65\x78\x3f\x63\x75\x72\x72\x65\x6e\x74\x54\x79\x70\x65\x3d\x30', '\x48\x43\x56\x6d\x6e': wanzikun_0x5222('0x28'), '\x57\x67\x73\x6d\x5a': function WgsmZ(_0x2d9123, _0x262341) {
        return _0x2d9123 > _0x262341;
      }, '\x78\x65\x79\x57\x4b': wanzikun_0x5222('0x29'), '\x6e\x4c\x42\x7a\x62': wanzikun_0x5222('0x2a'), '\x58\x45\x6f\x70\x42': wanzikun_0x5222('0x2b'), '\x72\x52\x53\x64\x78': wanzikun_0x5222('0x2c'), '\x5a\x66\x6a\x4d\x62': wanzikun_0x5222('0x2d'), '\x43\x6e\x6a\x52\x73': wanzikun_0x5222('0x2e'), '\x4a\x46\x4b\x46\x49': '\x50\x4f\x53\x54', '\x6f\x45\x56\x46\x59': wanzikun_0x5222('0x2f') };wx['\x73\x68\x6f\x77\x4c\x6f\x61\x64\x69\x6e\x67']();var _0x518dca = this;var _0x39b14d = wanzikun_0x2ec3dd[wanzikun_0x5222('0x30')][wanzikun_0x5222('0x31')];var _0x99c1e1 = '';if (_0x412986) {
      if (_0x1ad556[wanzikun_0x5222('0x32')] === _0x1ad556[wanzikun_0x5222('0x32')]) {
        _0x99c1e1 = _0x412986[wanzikun_0x5222('0x33')][wanzikun_0x5222('0x17')][wanzikun_0x5222('0x18')];
      } else {
        var _0x4ae95d = _0x1ad556[wanzikun_0x5222('0x34')](_0x412986[wanzikun_0x5222('0x33')][wanzikun_0x5222('0x17')][0x0], 0x1);if (_0x1ad556[wanzikun_0x5222('0x35')](_0x4ae95d, -0x1)) {
          this[wanzikun_0x5222('0x14')]({ '\x79\x6f\x75\x68\x75\x69\x6a\x69\x6e\x65': 0x0, '\x63\x75\x72\x43\x6f\x75\x70\x6f\x6e': null });return;
        }this[wanzikun_0x5222('0x14')]({ '\x79\x6f\x75\x68\x75\x69\x6a\x69\x6e\x65': this[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x36')][_0x4ae95d][wanzikun_0x5222('0x37')], '\x63\x75\x72\x43\x6f\x75\x70\x6f\x6e': this[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x36')][_0x4ae95d] });
      }
    }var _0x4e227b = { '\x74\x6f\x6b\x65\x6e': _0x39b14d, '\x67\x6f\x6f\x64\x73\x4a\x73\x6f\x6e\x53\x74\x72': _0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x38')], '\x72\x65\x6d\x61\x72\x6b': _0x99c1e1 };if (_0x1ad556[wanzikun_0x5222('0x39')](_0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x3a')], 0x0)) {
      if (!_0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x3b')]) {
        if (_0x1ad556[wanzikun_0x5222('0x3c')] === _0x1ad556[wanzikun_0x5222('0x3c')]) {
          wx[wanzikun_0x5222('0x3d')]();wx[wanzikun_0x5222('0x3e')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x1ad556['\x6e\x4c\x42\x7a\x62'], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
        } else {
          _0x518dca[wanzikun_0x5222('0x14')]({ '\x63\x75\x72\x41\x64\x64\x72\x65\x73\x73\x44\x61\x74\x61': null });
        }
      }_0x4e227b[wanzikun_0x5222('0x3f')] = _0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x3b')][wanzikun_0x5222('0x3f')];_0x4e227b[wanzikun_0x5222('0x40')] = _0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x3b')][wanzikun_0x5222('0x40')];if (_0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x3b')][wanzikun_0x5222('0x41')]) {
        if (_0x1ad556[wanzikun_0x5222('0x42')](_0x1ad556[wanzikun_0x5222('0x43')], _0x1ad556['\x72\x52\x53\x64\x78'])) {
          _0x4e227b[wanzikun_0x5222('0x41')] = _0x518dca['\x64\x61\x74\x61'][wanzikun_0x5222('0x3b')][wanzikun_0x5222('0x41')];
        } else {
          var _0xd19f4c = '';if (_0x412986[wanzikun_0x5222('0x8')]) {
            _0xd19f4c = _0x412986[wanzikun_0x5222('0x8')];
          }var _0xbe427c = this;_0xbe427c[wanzikun_0x5222('0x14')]({ '\x69\x73\x4e\x65\x65\x64\x4c\x6f\x67\x69\x73\x74\x69\x63\x73': 0x1, '\x6f\x72\x64\x65\x72\x54\x79\x70\x65': _0xd19f4c });
        }
      }_0x4e227b[wanzikun_0x5222('0x44')] = _0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x3b')][wanzikun_0x5222('0x44')];_0x4e227b[wanzikun_0x5222('0x45')] = _0x518dca['\x64\x61\x74\x61'][wanzikun_0x5222('0x3b')][wanzikun_0x5222('0x45')];_0x4e227b['\x6d\x6f\x62\x69\x6c\x65'] = _0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x3b')]['\x6d\x6f\x62\x69\x6c\x65'];_0x4e227b[wanzikun_0x5222('0x46')] = _0x518dca[wanzikun_0x5222('0x7')]['\x63\x75\x72\x41\x64\x64\x72\x65\x73\x73\x44\x61\x74\x61'][wanzikun_0x5222('0x46')];
    }if (_0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x47')]) {
      _0x4e227b['\x63\x6f\x75\x70\x6f\x6e\x49\x64'] = _0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x47')]['\x69\x64'];
    }if (!_0x412986) {
      _0x4e227b[wanzikun_0x5222('0x48')] = _0x1ad556[wanzikun_0x5222('0x49')];
    }wx[wanzikun_0x5222('0x4a')]({ '\x75\x72\x6c': wanzikun_0x2ec3dd[wanzikun_0x5222('0x30')][wanzikun_0x5222('0x4b')] + _0x1ad556[wanzikun_0x5222('0x4c')], '\x6d\x65\x74\x68\x6f\x64': _0x1ad556[wanzikun_0x5222('0x4d')], '\x68\x65\x61\x64\x65\x72': { 'content-type': _0x1ad556['\x6f\x45\x56\x46\x59'] }, '\x64\x61\x74\x61': _0x4e227b, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x46d350) {
        wx[wanzikun_0x5222('0x3d')]();if (_0x46d350[wanzikun_0x5222('0x7')]['\x63\x6f\x64\x65'] != 0x0) {
          if (_0x1ad556[wanzikun_0x5222('0x4e')](wanzikun_0x5222('0x4f'), _0x1ad556[wanzikun_0x5222('0x50')])) {
            wx[wanzikun_0x5222('0x3e')]({ '\x74\x69\x74\x6c\x65': '\u9519\u8BEF', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x46d350['\x64\x61\x74\x61'][wanzikun_0x5222('0x51')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
          } else {
            goodsJsonStrTmp = '\x2c';
          }
        }if (_0x412986 && _0x1ad556['\x6d\x49\x6a\x64\x71'](_0x1ad556[wanzikun_0x5222('0x52')], _0x518dca[wanzikun_0x5222('0x7')]['\x6f\x72\x64\x65\x72\x54\x79\x70\x65'])) {
          wx[wanzikun_0x5222('0x53')](wanzikun_0x5222('0x4'));
        }if (!_0x412986) {
          if (_0x1ad556['\x58\x72\x70\x46\x71'](_0x1ad556[wanzikun_0x5222('0x54')], _0x1ad556[wanzikun_0x5222('0x55')])) {
            _0x518dca[wanzikun_0x5222('0x14')]({ '\x69\x73\x4e\x65\x65\x64\x4c\x6f\x67\x69\x73\x74\x69\x63\x73': _0x46d350[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')][wanzikun_0x5222('0x3a')], '\x61\x6c\x6c\x47\x6f\x6f\x64\x73\x50\x72\x69\x63\x65': _0x46d350[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')]['\x61\x6d\x6f\x75\x6e\x74\x54\x6f\x74\x6c\x65'], '\x61\x6c\x6c\x47\x6f\x6f\x64\x73\x41\x6e\x64\x59\x75\x6e\x50\x72\x69\x63\x65': _0x46d350[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')][wanzikun_0x5222('0x56')] + _0x46d350[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')]['\x61\x6d\x6f\x75\x6e\x74\x54\x6f\x74\x6c\x65'], '\x79\x75\x6e\x50\x72\x69\x63\x65': _0x46d350['\x64\x61\x74\x61'][wanzikun_0x5222('0x7')][wanzikun_0x5222('0x56')] });_0x518dca[wanzikun_0x5222('0x57')]();return;
          } else {
            _0x4e227b['\x64\x69\x73\x74\x72\x69\x63\x74\x49\x64'] = _0x518dca[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x3b')][wanzikun_0x5222('0x41')];
          }
        }var _0x3dc0b4 = {};_0x3dc0b4[wanzikun_0x5222('0x58')] = { '\x76\x61\x6c\x75\x65': _0x46d350[wanzikun_0x5222('0x7')]['\x64\x61\x74\x61']['\x64\x61\x74\x65\x41\x64\x64'], '\x63\x6f\x6c\x6f\x72': _0x1ad556[wanzikun_0x5222('0x59')] };_0x3dc0b4['\x6b\x65\x79\x77\x6f\x72\x64\x32'] = { '\x76\x61\x6c\x75\x65': _0x1ad556['\x49\x6e\x6c\x69\x4c'](_0x46d350[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')][wanzikun_0x5222('0x5a')], '\u5143'), '\x63\x6f\x6c\x6f\x72': _0x1ad556[wanzikun_0x5222('0x59')] };_0x3dc0b4[wanzikun_0x5222('0x5b')] = { '\x76\x61\x6c\x75\x65': _0x46d350[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')][wanzikun_0x5222('0x5c')], '\x63\x6f\x6c\x6f\x72': wanzikun_0x5222('0x5d') };_0x3dc0b4[wanzikun_0x5222('0x5e')] = { '\x76\x61\x6c\x75\x65': wanzikun_0x5222('0x5f'), '\x63\x6f\x6c\x6f\x72': _0x1ad556[wanzikun_0x5222('0x59')] };_0x3dc0b4[wanzikun_0x5222('0x60')] = { '\x76\x61\x6c\x75\x65': '\u60A8\u53EF\u4EE5\u91CD\u65B0\u4E0B\u5355\uFF0C\u8BF7\u572830\u5206\u949F\u5185\u5B8C\u6210\u652F\u4ED8', '\x63\x6f\x6c\x6f\x72': _0x1ad556[wanzikun_0x5222('0x59')] };wanzikun_0x2ec3dd[wanzikun_0x5222('0x61')](_0x46d350[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')]['\x69\x64'], -0x1, wanzikun_0x2ec3dd[wanzikun_0x5222('0x62')][wanzikun_0x5222('0x63')], _0x412986['\x64\x65\x74\x61\x69\x6c'][wanzikun_0x5222('0x64')], _0x1ad556['\x59\x45\x74\x70\x57'], JSON[wanzikun_0x5222('0x65')](_0x3dc0b4));_0x3dc0b4 = {};_0x3dc0b4[wanzikun_0x5222('0x58')] = { '\x76\x61\x6c\x75\x65': _0x1ad556[wanzikun_0x5222('0x66')], '\x63\x6f\x6c\x6f\x72': _0x1ad556[wanzikun_0x5222('0x59')] };_0x3dc0b4[wanzikun_0x5222('0x67')] = { '\x76\x61\x6c\x75\x65': _0x46d350[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')][wanzikun_0x5222('0x5c')], '\x63\x6f\x6c\x6f\x72': _0x1ad556[wanzikun_0x5222('0x59')] };_0x3dc0b4[wanzikun_0x5222('0x5b')] = { '\x76\x61\x6c\x75\x65': _0x46d350[wanzikun_0x5222('0x7')]['\x64\x61\x74\x61'][wanzikun_0x5222('0x68')], '\x63\x6f\x6c\x6f\x72': _0x1ad556[wanzikun_0x5222('0x59')] };wanzikun_0x2ec3dd[wanzikun_0x5222('0x61')](_0x46d350[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')]['\x69\x64'], 0x2, wanzikun_0x2ec3dd['\x73\x69\x74\x65\x49\x6e\x66\x6f'][wanzikun_0x5222('0x69')], _0x412986[wanzikun_0x5222('0x33')][wanzikun_0x5222('0x64')], _0x1ad556[wanzikun_0x5222('0x6a')](_0x1ad556[wanzikun_0x5222('0x6b')], _0x46d350[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')]['\x69\x64']), JSON[wanzikun_0x5222('0x65')](_0x3dc0b4));wx['\x72\x65\x64\x69\x72\x65\x63\x74\x54\x6f']({ '\x75\x72\x6c': _0x1ad556['\x46\x58\x42\x64\x74'] });
      } });
  }, '\x69\x6e\x69\x74\x53\x68\x69\x70\x70\x69\x6e\x67\x41\x64\x64\x72\x65\x73\x73': function initShippingAddress() {
    var _0x3be186 = { '\x6a\x46\x59\x76\x51': function jFYvQ(_0x3f8688, _0x5ea4fc) {
        return _0x3f8688 == _0x5ea4fc;
      }, '\x42\x59\x63\x4c\x72': function BYcLr(_0x2c1049, _0x59159f) {
        return _0x2c1049 > _0x59159f;
      }, '\x71\x59\x47\x43\x74': '\x70\x77\x72\x6a\x42', '\x45\x4c\x43\x57\x61': function ELCWa(_0x86b367, _0x8ada3b) {
        return _0x86b367 + _0x8ada3b;
      }, '\x64\x6e\x73\x45\x4e': wanzikun_0x5222('0x6c') };var _0x3a39e5 = this;wx[wanzikun_0x5222('0x4a')]({ '\x75\x72\x6c': _0x3be186[wanzikun_0x5222('0x6d')](wanzikun_0x2ec3dd[wanzikun_0x5222('0x30')][wanzikun_0x5222('0x4b')], _0x3be186[wanzikun_0x5222('0x6e')]), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x2ec3dd[wanzikun_0x5222('0x30')][wanzikun_0x5222('0x31')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x17cba5) {
        var _0x2e841d = { '\x72\x55\x53\x45\x43': function rUSEC(_0x1cecd3, _0x5130e4) {
            return _0x3be186['\x6a\x46\x59\x76\x51'](_0x1cecd3, _0x5130e4);
          }, '\x4c\x51\x42\x58\x44': function LQBXD(_0x19861d, _0x39b1ae) {
            return _0x3be186[wanzikun_0x5222('0x6f')](_0x19861d, _0x39b1ae);
          } };if (_0x3be186[wanzikun_0x5222('0x70')](_0x17cba5[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x46')], 0x0)) {
          if (_0x3be186['\x71\x59\x47\x43\x74'] === _0x3be186[wanzikun_0x5222('0x71')]) {
            _0x3a39e5[wanzikun_0x5222('0x14')]({ '\x63\x75\x72\x41\x64\x64\x72\x65\x73\x73\x44\x61\x74\x61': _0x17cba5[wanzikun_0x5222('0x7')]['\x64\x61\x74\x61'] });
          } else {
            var _0x5cdabc = { '\x6d\x4a\x6f\x6d\x64': function mJomd(_0x31f1ef, _0x1e67e0) {
                return _0x31f1ef <= _0x1e67e0;
              } };if (_0x2e841d['\x72\x55\x53\x45\x43'](_0x17cba5[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x46')], 0x0)) {
              var _0x4153e8 = _0x17cba5['\x64\x61\x74\x61'][wanzikun_0x5222('0x7')][wanzikun_0x5222('0x72')](function (_0x3b32a5) {
                return _0x5cdabc[wanzikun_0x5222('0x73')](_0x3b32a5['\x6d\x6f\x6e\x65\x79\x48\x72\x65\x73\x68\x6f\x6c\x64'], _0x3a39e5[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x74')]);
              });if (_0x2e841d[wanzikun_0x5222('0x75')](_0x4153e8[wanzikun_0x5222('0x76')], 0x0)) {
                _0x3a39e5[wanzikun_0x5222('0x14')]({ '\x68\x61\x73\x4e\x6f\x43\x6f\x75\x70\x6f\x6e\x73': ![], '\x63\x6f\x75\x70\x6f\x6e\x73': _0x4153e8 });
              }
            }
          }
        } else {
          _0x3a39e5[wanzikun_0x5222('0x14')]({ '\x63\x75\x72\x41\x64\x64\x72\x65\x73\x73\x44\x61\x74\x61': null });
        }_0x3a39e5[wanzikun_0x5222('0x77')]();
      } });
  }, '\x70\x72\x6f\x63\x65\x73\x73\x59\x75\x6e\x66\x65\x69': function processYunfei() {
    var _0x129b81 = { '\x49\x43\x54\x53\x73': function ICTSs(_0x3e8f31, _0x41176c) {
        return _0x3e8f31 < _0x41176c;
      }, '\x54\x71\x68\x71\x46': function TqhqF(_0x21af22, _0x2de2b7) {
        return _0x21af22 * _0x2de2b7;
      }, '\x49\x78\x62\x76\x63': function Ixbvc(_0xc7c585, _0x532a2b) {
        return _0xc7c585 > _0x532a2b;
      }, '\x49\x61\x72\x4d\x4d': function IarMM(_0x2d22f2, _0x40ba0a) {
        return _0x2d22f2 + _0x40ba0a;
      }, '\x46\x71\x6b\x69\x4e': wanzikun_0x5222('0x78'), '\x67\x4a\x6c\x65\x53': function gJleS(_0x28ef31, _0x4678d2) {
        return _0x28ef31 + _0x4678d2;
      }, '\x6e\x79\x7a\x47\x52': function nyzGR(_0x53c18e, _0x164098) {
        return _0x53c18e + _0x164098;
      }, '\x75\x70\x78\x62\x49': function upxbI(_0x9c9d2, _0x3975ae) {
        return _0x9c9d2 + _0x3975ae;
      }, '\x4f\x59\x50\x79\x67': function OYPyg(_0x4233f6, _0x46021f) {
        return _0x4233f6 + _0x46021f;
      }, '\x68\x50\x41\x75\x6c': function hPAul(_0x1cfe24, _0x1a63d9) {
        return _0x1cfe24 + _0x1a63d9;
      }, '\x55\x70\x6b\x5a\x50': wanzikun_0x5222('0x79'), '\x74\x67\x44\x6d\x4c': wanzikun_0x5222('0x7a'), '\x6b\x53\x6d\x48\x6c': wanzikun_0x5222('0x7b'), '\x55\x6e\x75\x4f\x77': wanzikun_0x5222('0x7c') };var _0x22ac47 = this;var _0x448ce8 = this[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7d')];var _0x1a5d04 = '\x5b';var _0x5ead02 = 0x0;var _0x31e009 = 0x0;for (var _0x5122c1 = 0x0; _0x129b81[wanzikun_0x5222('0x7e')](_0x5122c1, _0x448ce8[wanzikun_0x5222('0x76')]); _0x5122c1++) {
      var _0x50181b = _0x448ce8[_0x5122c1];if (_0x50181b[wanzikun_0x5222('0x7f')]) {
        _0x5ead02 = 0x1;
      }_0x31e009 += _0x129b81['\x54\x71\x68\x71\x46'](_0x50181b[wanzikun_0x5222('0x80')], _0x50181b['\x6e\x75\x6d\x62\x65\x72']);var _0x36de11 = '';if (_0x129b81[wanzikun_0x5222('0x81')](_0x5122c1, 0x0)) {
        _0x36de11 = '\x2c';
      }var _0xcfe5d5 = 0x0;var _0x535725 = wx[wanzikun_0x5222('0x9')](_0x129b81[wanzikun_0x5222('0x82')](_0x129b81[wanzikun_0x5222('0x83')], _0x50181b[wanzikun_0x5222('0x84')]));if (_0x535725) {
        _0xcfe5d5 = _0x535725;
      }_0x36de11 += _0x129b81[wanzikun_0x5222('0x82')](_0x129b81[wanzikun_0x5222('0x85')](_0x129b81[wanzikun_0x5222('0x86')](_0x129b81[wanzikun_0x5222('0x87')](_0x129b81[wanzikun_0x5222('0x88')](_0x129b81[wanzikun_0x5222('0x88')](_0x129b81[wanzikun_0x5222('0x89')](_0x129b81[wanzikun_0x5222('0x8a')], _0x50181b[wanzikun_0x5222('0x84')]), _0x129b81[wanzikun_0x5222('0x8b')]), _0x50181b[wanzikun_0x5222('0x8c')]), _0x129b81[wanzikun_0x5222('0x8d')]), _0x50181b[wanzikun_0x5222('0x8e')]), _0x129b81[wanzikun_0x5222('0x8f')]) + _0xcfe5d5, '\x7d');_0x1a5d04 += _0x36de11;
    }_0x1a5d04 += '\x5d';_0x22ac47['\x73\x65\x74\x44\x61\x74\x61']({ '\x69\x73\x4e\x65\x65\x64\x4c\x6f\x67\x69\x73\x74\x69\x63\x73': _0x5ead02, '\x67\x6f\x6f\x64\x73\x4a\x73\x6f\x6e\x53\x74\x72': _0x1a5d04 });_0x22ac47[wanzikun_0x5222('0x90')]();
  }, '\x61\x64\x64\x41\x64\x64\x72\x65\x73\x73': function addAddress() {
    var _0x490448 = { '\x68\x72\x74\x72\x76': wanzikun_0x5222('0x91') };wx[wanzikun_0x5222('0x1f')]({ '\x75\x72\x6c': _0x490448[wanzikun_0x5222('0x92')] });
  }, '\x73\x65\x6c\x65\x63\x74\x41\x64\x64\x72\x65\x73\x73': function selectAddress() {
    var _0x5b2811 = { '\x49\x78\x6f\x73\x65': wanzikun_0x5222('0x19') };wx[wanzikun_0x5222('0x1f')]({ '\x75\x72\x6c': _0x5b2811[wanzikun_0x5222('0x93')] });
  }, '\x67\x65\x74\x4d\x79\x43\x6f\x75\x70\x6f\x6e\x73': function getMyCoupons() {
    var _0x1d550a = { '\x44\x61\x55\x63\x69': function DaUci(_0x35b3ff, _0x7e152f) {
        return _0x35b3ff <= _0x7e152f;
      }, '\x79\x6c\x78\x55\x52': function ylxUR(_0x14e45d, _0x593cd8) {
        return _0x14e45d !== _0x593cd8;
      }, '\x75\x43\x43\x71\x75': wanzikun_0x5222('0x94'), '\x5a\x41\x6c\x4f\x43': function ZAlOC(_0x3966c8, _0x279150) {
        return _0x3966c8 == _0x279150;
      }, '\x73\x61\x71\x48\x64': function saqHd(_0x331017, _0x24b8c9) {
        return _0x331017 > _0x24b8c9;
      }, '\x68\x68\x66\x74\x61': function hhfta(_0x1ef7cb, _0x556b48) {
        return _0x1ef7cb === _0x556b48;
      }, '\x4f\x77\x56\x78\x54': wanzikun_0x5222('0x95'), '\x71\x4a\x7a\x44\x41': wanzikun_0x5222('0x96') };var _0x329f42 = this;wx[wanzikun_0x5222('0x4a')]({ '\x75\x72\x6c': wanzikun_0x2ec3dd[wanzikun_0x5222('0x30')]['\x75\x72\x6c\x73'] + _0x1d550a['\x71\x4a\x7a\x44\x41'], '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x2ec3dd[wanzikun_0x5222('0x30')][wanzikun_0x5222('0x31')], '\x73\x74\x61\x74\x75\x73': 0x0 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3dc440) {
        if (_0x1d550a[wanzikun_0x5222('0x97')](_0x1d550a['\x75\x43\x43\x71\x75'], '\x44\x4b\x46\x50\x57')) {
          orderType = e['\x6f\x72\x64\x65\x72\x54\x79\x70\x65'];
        } else {
          if (_0x1d550a[wanzikun_0x5222('0x98')](_0x3dc440[wanzikun_0x5222('0x7')]['\x63\x6f\x64\x65'], 0x0)) {
            var _0x5006cd = _0x3dc440[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x7')][wanzikun_0x5222('0x72')](function (_0x13f172) {
              return _0x1d550a[wanzikun_0x5222('0x99')](_0x13f172[wanzikun_0x5222('0x9a')], _0x329f42[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x74')]);
            });if (_0x1d550a[wanzikun_0x5222('0x9b')](_0x5006cd[wanzikun_0x5222('0x76')], 0x0)) {
              if (_0x1d550a[wanzikun_0x5222('0x9c')](_0x1d550a['\x4f\x77\x56\x78\x54'], '\x52\x41\x68\x71\x70')) {
                postData[wanzikun_0x5222('0x9d')] = _0x329f42[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x47')]['\x69\x64'];
              } else {
                _0x329f42[wanzikun_0x5222('0x14')]({ '\x68\x61\x73\x4e\x6f\x43\x6f\x75\x70\x6f\x6e\x73': ![], '\x63\x6f\x75\x70\x6f\x6e\x73': _0x5006cd });
              }
            }
          }
        }
      } });
  }, '\x62\x69\x6e\x64\x43\x68\x61\x6e\x67\x65\x43\x6f\x75\x70\x6f\x6e': function bindChangeCoupon(_0xd000c2) {
    var _0x506415 = { '\x4c\x75\x6c\x7a\x6f': function Lulzo(_0x3c8e4f, _0x3f90ad) {
        return _0x3c8e4f - _0x3f90ad;
      }, '\x46\x7a\x61\x72\x70': function Fzarp(_0x458d8f, _0x38b06a) {
        return _0x458d8f == _0x38b06a;
      } };var _0x30cfa4 = _0x506415[wanzikun_0x5222('0x9e')](_0xd000c2[wanzikun_0x5222('0x33')]['\x76\x61\x6c\x75\x65'][0x0], 0x1);if (_0x506415[wanzikun_0x5222('0x9f')](_0x30cfa4, -0x1)) {
      this[wanzikun_0x5222('0x14')]({ '\x79\x6f\x75\x68\x75\x69\x6a\x69\x6e\x65': 0x0, '\x63\x75\x72\x43\x6f\x75\x70\x6f\x6e': null });return;
    }this[wanzikun_0x5222('0x14')]({ '\x79\x6f\x75\x68\x75\x69\x6a\x69\x6e\x65': this['\x64\x61\x74\x61']['\x63\x6f\x75\x70\x6f\x6e\x73'][_0x30cfa4][wanzikun_0x5222('0x37')], '\x63\x75\x72\x43\x6f\x75\x70\x6f\x6e': this[wanzikun_0x5222('0x7')][wanzikun_0x5222('0x36')][_0x30cfa4] });
  } }); 
 			}); 	require("pages/to-pay-order/index.js");
 		__wxRoute = 'pages/address-add/index';__wxRouteBegin = true; 	define("pages/address-add/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x3976 = ['\x53\x41\x6e\x49\x73', '\x63\x59\x45\x47\x41', '\x77\x52\x72\x56\x6c', '\x57\x4a\x6b\x75\x78', '\x63\x6f\x64\x65', '\x70\x72\x6f\x76\x69\x6e\x63\x65\x53\x74\x72', '\x63\x69\x74\x79\x53\x74\x72', '\x61\x72\x65\x61\x53\x74\x72', '\x73\x65\x74\x44\x42\x53\x61\x76\x65\x41\x64\x64\x72\x65\x73\x73\x49\x64', '\x77\x74\x54\x4a\x4a', '\x63\x69\x74\x79\x4c\x69\x73\x74', '\x73\x65\x6c\x43\x69\x74\x79\x49\x6e\x64\x65\x78', '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74', '\x73\x62\x6d\x65\x71', '\x55\x42\x68\x56\x4d', '\x63\x69\x74\x79\x44\x61\x74\x61', '\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65\x49\x6e\x64\x65\x78', '\x64\x69\x73\x74\x72\x69\x63\x74\x4c\x69\x73\x74', '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74\x49\x6e\x64\x65\x78', '\x70\x71\x57\x63\x4f', '\x4f\x62\x5a\x65\x59', '\x6e\x61\x6d\x65', '\x73\x65\x74\x44\x61\x74\x61', '\x50\x62\x64\x6f\x46', '\x78\x73\x48\x44\x70', '\x77\x6c\x76\x70\x71', '\x72\x45\x4e\x4c\x52', '\x56\x70\x49\x79\x73', '\x64\x69\x73\x74\x72\x69\x63\x74\x49\x64', '\x72\x65\x71\x75\x65\x73\x74', '\x4a\x76\x6d\x51\x67', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x67\x73\x4b\x49\x4a', '\x74\x6f\x6b\x65\x6e', '\x55\x49\x45\x4b\x74', '\x6e\x74\x61\x50\x79', '\x6f\x77\x68\x61\x76', '\x52\x66\x76\x72\x6f', '\x78\x71\x72\x64\x73', '\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67', '\x62\x69\x6e\x64\x50\x69\x63\x6b\x65\x72\x43\x68\x61\x6e\x67\x65', '\x69\x6e\x69\x74\x43\x69\x74\x79\x44\x61\x74\x61', '\x70\x47\x55\x4a\x51', '\x72\x52\x65\x70\x4d', '\x41\x51\x4f\x75\x52', '\x63\x48\x6c\x61\x48', '\x64\x71\x61\x59\x75', '\x6c\x65\x6e\x67\x74\x68', '\x70\x75\x73\x68', '\x7a\x66\x6e\x6f\x69', '\x62\x68\x67\x4e\x43', '\x44\x68\x52\x76\x45', '\x54\x58\x5a\x71\x73', '\x57\x53\x72\x6c\x64', '\x73\x50\x71\x77\x47', '\x43\x57\x41\x43\x41', '\x75\x59\x55\x4a\x58', '\x73\x68\x6f\x77\x4c\x6f\x61\x64\x69\x6e\x67', '\x6b\x6e\x79\x53\x65', '\x75\x72\x6c\x73', '\x2f\x75\x73\x65\x72\x2f\x73\x68\x69\x70\x70\x69\x6e\x67\x2d\x61\x64\x64\x72\x65\x73\x73\x2f\x64\x65\x74\x61\x69\x6c', '\x6b\x63\x50\x6a\x67', '\x79\x64\x7a\x47\x7a', '\x7a\x4e\x76\x4b\x53', '\x75\x6f\x69\x72\x54', '\x59\x66\x53\x42\x66', '\x70\x45\x4f\x79\x45', '\x70\x72\x6f\x76\x69\x6e\x63\x65\x49\x64', '\x71\x5a\x47\x76\x69', '\x63\x69\x74\x79\x49\x64', '\x62\x74\x52\x42\x67', '\x76\x52\x44\x4a\x65', '\x4a\x42\x68\x44\x42', '\x46\x69\x57\x4f\x6a', '\x5a\x68\x64\x4e\x6b', '\x68\x62\x65\x6b\x65', '\x6a\x53\x4c\x4e\x52', '\x62\x71\x52\x59\x48', '\x2f\x75\x73\x65\x72\x2f\x73\x68\x69\x70\x70\x69\x6e\x67\x2d\x61\x64\x64\x72\x65\x73\x73\x2f\x64\x65\x6c\x65\x74\x65', '\x72\x73\x46\x6a\x53', '\u7528\u6237\u70B9\u51FB\u53D6\u6D88', '\u786E\u5B9A\u8981\u5220\u9664\u8BE5\u6536\u8D27\u5730\u5740\u5417\uFF1F', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x64\x61\x74\x61\x73\x65\x74', '\x61\x76\x51\x77\x46', '\x53\x62\x43\x75\x65', '\x41\x74\x67\x55\x53', '\x63\x6f\x6e\x66\x69\x72\x6d', '\x44\x63\x6d\x47\x6d', '\x71\x73\x61\x51\x65', '\x43\x4c\x75\x70\x67', '\x71\x47\x72\x6f\x4c', '\x62\x69\x6e\x64\x50\x69\x63\x6b\x65\x72\x43\x69\x74\x79\x43\x68\x61\x6e\x67\x65', '\x43\x5a\x44\x57\x6a', '\x63\x61\x6e\x63\x65\x6c', '\x66\x43\x4a\x4f\x54', '\x42\x71\x72\x52\x6f', '\x6c\x6f\x67', '\x48\x6e\x6f\x71\x43', '\x58\x54\x50\x5a\x67', '\x6f\x64\x48\x41\x72', '\x68\x68\x41\x42\x55', '\x48\x61\x64\x76\x69', '\x59\x6f\x78\x51\x50', '\x54\x58\x76\x47\x56', '\x6d\x7a\x58\x4b\x6d', '\x70\x72\x6f\x76\x69\x6e\x63\x65\x4e\x61\x6d\x65', '\x63\x69\x74\x79\x4e\x61\x6d\x65', '\x69\x56\x6c\x75\x49', '\x49\x4c\x78\x63\x78', '\x6b\x57\x6d\x4e\x6b', '\x62\x69\x6e\x64\x50\x69\x63\x6b\x65\x72\x50\x72\x6f\x76\x69\x6e\x63\x65\x43\x68\x61\x6e\x67\x65', '\x61\x7a\x59\x70\x53', '\x66\x6b\x4e\x68\x66', '\x44\x68\x69\x78\x6a', '\x4f\x48\x57\x55\x41', '\x75\x6d\x52\x69\x71', '\x2e\x2e\x2f\x2e\x2e\x2f\x75\x74\x69\x6c\x73\x2f\x63\x69\x74\x79\x2e\x6a\x73', '\u8BF7\u9009\u62E9', '\x6e\x61\x76\x69\x67\x61\x74\x65\x42\x61\x63\x6b', '\u65E0\u6CD5\u83B7\u53D6\u5FEB\u9012\u5730\u5740\u6570\u636E', '\x59\x66\x78\x6d\x73', '\x50\x5a\x4d\x57\x6c', '\u8BF7\u586B\u5199\u8054\u7CFB\u4EBA\u59D3\u540D', '\u8BF7\u586B\u5199\u624B\u673A\u53F7\u7801', '\x4b\x6b\x67\x79\x42', '\x58\x59\x57\x54\x46', '\u8BF7\u586B\u5199\u8BE6\u7EC6\u5730\u5740', '\u8BF7\u586B\u5199\u90AE\u7F16', '\x61\x64\x64', '\x75\x70\x64\x61\x74\x65', '\x6a\x44\x63\x49\x42', '\x2f\x75\x73\x65\x72\x2f\x73\x68\x69\x70\x70\x69\x6e\x67\x2d\x61\x64\x64\x72\x65\x73\x73\x2f', '\x74\x72\x75\x65', '\x64\x65\x74\x61\x69\x6c', '\x76\x61\x6c\x75\x65', '\x6c\x69\x6e\x6b\x4d\x61\x6e', '\x61\x64\x64\x72\x65\x73\x73', '\x6d\x6f\x62\x69\x6c\x65', '\x42\x67\x64\x76\x78', '\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c', '\x45\x41\x45\x65\x69', '\x49\x41\x78\x42\x65', '\x64\x61\x74\x61', '\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65', '\x68\x4a\x72\x7a\x61', '\x4d\x75\x4e\x72\x62', '\x73\x65\x6c\x43\x69\x74\x79'];(function (_0x529094, _0x545a3f) {
  var _0x19880c = function _0x19880c(_0x4f67c4) {
    while (--_0x4f67c4) {
      _0x529094['push'](_0x529094['shift']());
    }
  };_0x19880c(++_0x545a3f);
})(wanzikun_0x3976, 0x75);var wanzikun_0x9c5f = function wanzikun_0x9c5f(_0x5a2255, _0x2b9de7) {
  _0x5a2255 = _0x5a2255 - 0x0;var _0x3e8f0b = wanzikun_0x3976[_0x5a2255];return _0x3e8f0b;
};var wanzikun_0x261d09 = require(wanzikun_0x9c5f('0x0'));var wanzikun_0x112844 = getApp();Page({ '\x64\x61\x74\x61': { '\x70\x72\x6f\x76\x69\x6e\x63\x65\x73': [], '\x63\x69\x74\x79\x73': [], '\x64\x69\x73\x74\x72\x69\x63\x74\x73': [], '\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65': wanzikun_0x9c5f('0x1'), '\x73\x65\x6c\x43\x69\x74\x79': wanzikun_0x9c5f('0x1'), '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74': wanzikun_0x9c5f('0x1'), '\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65\x49\x6e\x64\x65\x78': 0x0, '\x73\x65\x6c\x43\x69\x74\x79\x49\x6e\x64\x65\x78': 0x0, '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74\x49\x6e\x64\x65\x78': 0x0 }, '\x62\x69\x6e\x64\x43\x61\x6e\x63\x65\x6c': function bindCancel() {
    wx[wanzikun_0x9c5f('0x2')]({});
  }, '\x62\x69\x6e\x64\x53\x61\x76\x65': function bindSave(_0x4795d5) {
    var _0x101c8f = { '\x57\x4a\x6b\x75\x78': function WJkux(_0x192b40, _0x195d97) {
        return _0x192b40 == _0x195d97;
      }, '\x77\x74\x54\x4a\x4a': wanzikun_0x9c5f('0x3'), '\x42\x67\x64\x76\x78': function Bgdvx(_0x4978e8, _0x1ff776) {
        return _0x4978e8 == _0x1ff776;
      }, '\x53\x41\x6e\x49\x73': wanzikun_0x9c5f('0x1'), '\x6e\x74\x61\x50\x79': function ntaPy(_0x560018, _0x170fe4) {
        return _0x560018 !== _0x170fe4;
      }, '\x6f\x77\x68\x61\x76': wanzikun_0x9c5f('0x4'), '\x52\x66\x76\x72\x6f': function Rfvro(_0x339c41, _0x532097) {
        return _0x339c41 != _0x532097;
      }, '\x4b\x75\x63\x42\x7a': function KucBz(_0x28ddcf, _0x52a093) {
        return _0x28ddcf === _0x52a093;
      }, '\x78\x71\x72\x64\x73': wanzikun_0x9c5f('0x5'), '\x45\x41\x45\x65\x69': wanzikun_0x9c5f('0x6'), '\x49\x41\x78\x42\x65': wanzikun_0x9c5f('0x7'), '\x68\x4a\x72\x7a\x61': '\u8BF7\u9009\u62E9\u5730\u533A', '\x4d\x75\x4e\x72\x62': function MuNrb(_0x48a3d4, _0x1bfc96) {
        return _0x48a3d4 == _0x1bfc96;
      }, '\x53\x56\x57\x70\x4c': function SVWpL(_0x4db1b0, _0x46d77c) {
        return _0x4db1b0 !== _0x46d77c;
      }, '\x63\x59\x45\x47\x41': wanzikun_0x9c5f('0x8'), '\x77\x52\x72\x56\x6c': wanzikun_0x9c5f('0x9'), '\x55\x62\x67\x41\x7a': function UbgAz(_0x140c4c, _0x566859) {
        return _0x140c4c === _0x566859;
      }, '\x55\x42\x68\x56\x4d': '\x73\x62\x6d\x65\x71', '\x70\x71\x57\x63\x4f': wanzikun_0x9c5f('0xa'), '\x62\x46\x64\x4d\x76': '\x6d\x4b\x47\x57\x70', '\x50\x62\x64\x6f\x46': wanzikun_0x9c5f('0xb'), '\x78\x73\x48\x44\x70': wanzikun_0x9c5f('0xc'), '\x77\x6c\x76\x70\x71': wanzikun_0x9c5f('0xd'), '\x72\x45\x4e\x4c\x52': '\x4e\x58\x4e\x6d\x58', '\x56\x70\x49\x79\x73': wanzikun_0x9c5f('0xe'), '\x4a\x76\x6d\x51\x67': function JvmQg(_0x41007b, _0x34184a) {
        return _0x41007b + _0x34184a;
      }, '\x67\x73\x4b\x49\x4a': wanzikun_0x9c5f('0xf'), '\x55\x49\x45\x4b\x74': wanzikun_0x9c5f('0x10') };var _0x1e4b50 = this;var _0xddf36e = _0x4795d5[wanzikun_0x9c5f('0x11')][wanzikun_0x9c5f('0x12')][wanzikun_0x9c5f('0x13')];var _0xb59dd7 = _0x4795d5['\x64\x65\x74\x61\x69\x6c']['\x76\x61\x6c\x75\x65'][wanzikun_0x9c5f('0x14')];var _0x22d5e3 = _0x4795d5['\x64\x65\x74\x61\x69\x6c']['\x76\x61\x6c\x75\x65'][wanzikun_0x9c5f('0x15')];var _0x300c32 = _0x4795d5[wanzikun_0x9c5f('0x11')][wanzikun_0x9c5f('0x12')]['\x63\x6f\x64\x65'];if (_0x101c8f[wanzikun_0x9c5f('0x16')](_0xddf36e, '')) {
      wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x101c8f[wanzikun_0x9c5f('0x18')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
    }if (_0x101c8f[wanzikun_0x9c5f('0x16')](_0x22d5e3, '')) {
      wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x101c8f[wanzikun_0x9c5f('0x19')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
    }if (_0x101c8f[wanzikun_0x9c5f('0x16')](this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x1b')], '\u8BF7\u9009\u62E9')) {
      wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x101c8f[wanzikun_0x9c5f('0x1c')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
    }if (_0x101c8f[wanzikun_0x9c5f('0x1d')](this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x1e')], _0x101c8f[wanzikun_0x9c5f('0x1f')])) {
      if (_0x101c8f['\x53\x56\x57\x70\x4c'](_0x101c8f[wanzikun_0x9c5f('0x20')], _0x101c8f[wanzikun_0x9c5f('0x21')])) {
        wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x101c8f[wanzikun_0x9c5f('0x1c')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
      } else {
        wx['\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67']();if (_0x101c8f[wanzikun_0x9c5f('0x22')](res[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x23')], 0x0)) {
          _0x1e4b50['\x73\x65\x74\x44\x61\x74\x61']({ '\x69\x64': id, '\x61\x64\x64\x72\x65\x73\x73\x44\x61\x74\x61': res[wanzikun_0x9c5f('0x1a')]['\x64\x61\x74\x61'], '\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65': res[wanzikun_0x9c5f('0x1a')]['\x64\x61\x74\x61'][wanzikun_0x9c5f('0x24')], '\x73\x65\x6c\x43\x69\x74\x79': res[wanzikun_0x9c5f('0x1a')]['\x64\x61\x74\x61'][wanzikun_0x9c5f('0x25')], '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74': res[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x26')] });_0x1e4b50[wanzikun_0x9c5f('0x27')](res[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x1a')]);return;
        } else {
          wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x101c8f[wanzikun_0x9c5f('0x28')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });
        }
      }
    }var _0x87859e = wanzikun_0x261d09['\x63\x69\x74\x79\x44\x61\x74\x61'][this['\x64\x61\x74\x61']['\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65\x49\x6e\x64\x65\x78']][wanzikun_0x9c5f('0x29')][this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2a')]]['\x69\x64'];var _0x44073e;if (_0x101c8f[wanzikun_0x9c5f('0x1d')](this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2b')], wanzikun_0x9c5f('0x1')) || !this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2b')]) {
      _0x44073e = '';
    } else {
      if (_0x101c8f['\x55\x62\x67\x41\x7a'](wanzikun_0x9c5f('0x2c'), _0x101c8f[wanzikun_0x9c5f('0x2d')])) {
        _0x44073e = wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2f')]][wanzikun_0x9c5f('0x29')][this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2a')]][wanzikun_0x9c5f('0x30')][this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x31')]]['\x69\x64'];
      } else {
        wx[wanzikun_0x9c5f('0x2')]({});
      }
    }if (_0x101c8f[wanzikun_0x9c5f('0x1d')](_0xb59dd7, '')) {
      wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x101c8f[wanzikun_0x9c5f('0x32')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
    }if (_0x101c8f[wanzikun_0x9c5f('0x1d')](_0x300c32, '')) {
      if (_0x101c8f['\x62\x46\x64\x4d\x76'] === wanzikun_0x9c5f('0x33')) {
        var _0x5efb29 = wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2f')]][wanzikun_0x9c5f('0x29')][this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2a')]]['\x64\x69\x73\x74\x72\x69\x63\x74\x4c\x69\x73\x74'][event[wanzikun_0x9c5f('0x11')]['\x76\x61\x6c\x75\x65']];if (_0x5efb29 && _0x5efb29[wanzikun_0x9c5f('0x34')] && event[wanzikun_0x9c5f('0x11')]['\x76\x61\x6c\x75\x65']) {
          this[wanzikun_0x9c5f('0x35')]({ '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74': _0x5efb29[wanzikun_0x9c5f('0x34')], '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74\x49\x6e\x64\x65\x78': event[wanzikun_0x9c5f('0x11')][wanzikun_0x9c5f('0x12')] });
        }
      } else {
        wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x101c8f[wanzikun_0x9c5f('0x36')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
      }
    }var _0x46e5a6 = _0x101c8f[wanzikun_0x9c5f('0x37')];var _0x242ee2 = _0x1e4b50['\x64\x61\x74\x61']['\x69\x64'];if (_0x242ee2) {
      _0x46e5a6 = _0x101c8f[wanzikun_0x9c5f('0x38')];
    } else {
      if (_0x101c8f['\x53\x56\x57\x70\x4c'](_0x101c8f[wanzikun_0x9c5f('0x39')], _0x101c8f[wanzikun_0x9c5f('0x3a')])) {
        _0x242ee2 = 0x0;
      } else {
        if (_0x101c8f[wanzikun_0x9c5f('0x16')](data[wanzikun_0x9c5f('0x3b')], wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][i][wanzikun_0x9c5f('0x29')][j][wanzikun_0x9c5f('0x30')][k]['\x69\x64'])) {
          this['\x64\x61\x74\x61'][wanzikun_0x9c5f('0x31')] = k;
        }
      }
    }wx[wanzikun_0x9c5f('0x3c')]({ '\x75\x72\x6c': _0x101c8f['\x4a\x76\x6d\x51\x67'](_0x101c8f[wanzikun_0x9c5f('0x3d')](wanzikun_0x112844[wanzikun_0x9c5f('0x3e')]['\x75\x72\x6c\x73'], _0x101c8f[wanzikun_0x9c5f('0x3f')]), _0x46e5a6), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x112844[wanzikun_0x9c5f('0x3e')][wanzikun_0x9c5f('0x40')], '\x69\x64': _0x242ee2, '\x70\x72\x6f\x76\x69\x6e\x63\x65\x49\x64': wanzikun_0x261d09['\x63\x69\x74\x79\x44\x61\x74\x61'][this[wanzikun_0x9c5f('0x1a')]['\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65\x49\x6e\x64\x65\x78']]['\x69\x64'], '\x63\x69\x74\x79\x49\x64': _0x87859e, '\x64\x69\x73\x74\x72\x69\x63\x74\x49\x64': _0x44073e, '\x6c\x69\x6e\x6b\x4d\x61\x6e': _0xddf36e, '\x61\x64\x64\x72\x65\x73\x73': _0xb59dd7, '\x6d\x6f\x62\x69\x6c\x65': _0x22d5e3, '\x63\x6f\x64\x65': _0x300c32, '\x69\x73\x44\x65\x66\x61\x75\x6c\x74': _0x101c8f[wanzikun_0x9c5f('0x41')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x30adfe) {
        if (_0x101c8f[wanzikun_0x9c5f('0x42')]('\x69\x56\x6d\x4d\x44', _0x101c8f[wanzikun_0x9c5f('0x43')])) {
          if (_0x101c8f[wanzikun_0x9c5f('0x44')](_0x30adfe[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x23')], 0x0)) {
            if (_0x101c8f['\x4b\x75\x63\x42\x7a'](_0x101c8f['\x78\x71\x72\x64\x73'], _0x101c8f[wanzikun_0x9c5f('0x45')])) {
              wx[wanzikun_0x9c5f('0x46')]();wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u5931\u8D25', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x30adfe[wanzikun_0x9c5f('0x1a')]['\x6d\x73\x67'], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
            } else {
              eventJ = { '\x64\x65\x74\x61\x69\x6c': { '\x76\x61\x6c\x75\x65': k } };_0x1e4b50[wanzikun_0x9c5f('0x47')](eventJ);
            }
          }wx['\x6e\x61\x76\x69\x67\x61\x74\x65\x42\x61\x63\x6b']({});
        } else {
          var _0x9dd7c9 = wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2f')]][wanzikun_0x9c5f('0x29')][event['\x64\x65\x74\x61\x69\x6c'][wanzikun_0x9c5f('0x12')]];this[wanzikun_0x9c5f('0x35')]({ '\x73\x65\x6c\x43\x69\x74\x79': _0x9dd7c9[wanzikun_0x9c5f('0x34')], '\x73\x65\x6c\x43\x69\x74\x79\x49\x6e\x64\x65\x78': event['\x64\x65\x74\x61\x69\x6c'][wanzikun_0x9c5f('0x12')], '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74': _0x101c8f[wanzikun_0x9c5f('0x1f')], '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74\x49\x6e\x64\x65\x78': 0x0 });this[wanzikun_0x9c5f('0x48')](0x3, _0x9dd7c9);
        }
      } });
  }, '\x69\x6e\x69\x74\x43\x69\x74\x79\x44\x61\x74\x61': function initCityData(_0x333907, _0x52ff53) {
    var _0x2d9a26 = { '\x63\x48\x6c\x61\x48': function cHlaH(_0x356cc2, _0x2a93be) {
        return _0x356cc2 == _0x2a93be;
      }, '\x50\x58\x55\x6b\x4d': wanzikun_0x9c5f('0x49'), '\x64\x71\x61\x59\x75': '\x79\x65\x65\x4d\x54', '\x7a\x66\x6e\x6f\x69': wanzikun_0x9c5f('0x4a'), '\x62\x68\x67\x4e\x43': function bhgNC(_0x566a74, _0x1072ec) {
        return _0x566a74 < _0x1072ec;
      }, '\x66\x4e\x59\x64\x7a': function fNYdz(_0xfa6c6d, _0x5ce8af) {
        return _0xfa6c6d == _0x5ce8af;
      }, '\x44\x68\x52\x76\x45': wanzikun_0x9c5f('0x4b') };if (_0x2d9a26[wanzikun_0x9c5f('0x4c')](_0x333907, 0x1)) {
      if (_0x2d9a26['\x50\x58\x55\x6b\x4d'] !== _0x2d9a26[wanzikun_0x9c5f('0x4d')]) {
        var _0x1a6130 = [];for (var _0xdc9518 = 0x0; _0xdc9518 < wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][wanzikun_0x9c5f('0x4e')]; _0xdc9518++) {
          _0x1a6130[wanzikun_0x9c5f('0x4f')](wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0xdc9518]['\x6e\x61\x6d\x65']);
        }this[wanzikun_0x9c5f('0x35')]({ '\x70\x72\x6f\x76\x69\x6e\x63\x65\x73': _0x1a6130 });
      } else {
        _0x1a6130[wanzikun_0x9c5f('0x4f')](_0x1ff3f6[_0xdc9518][wanzikun_0x9c5f('0x34')]);
      }
    } else if (_0x333907 == 0x2) {
      if (_0x2d9a26[wanzikun_0x9c5f('0x50')] === _0x2d9a26[wanzikun_0x9c5f('0x50')]) {
        var _0x1a6130 = [];var _0x1ff3f6 = _0x52ff53[wanzikun_0x9c5f('0x29')];for (var _0xdc9518 = 0x0; _0x2d9a26[wanzikun_0x9c5f('0x51')](_0xdc9518, _0x1ff3f6[wanzikun_0x9c5f('0x4e')]); _0xdc9518++) {
          _0x1a6130[wanzikun_0x9c5f('0x4f')](_0x1ff3f6[_0xdc9518][wanzikun_0x9c5f('0x34')]);
        }this[wanzikun_0x9c5f('0x35')]({ '\x63\x69\x74\x79\x73': _0x1a6130 });
      } else {
        this['\x64\x61\x74\x61'][wanzikun_0x9c5f('0x31')] = k;
      }
    } else if (_0x2d9a26['\x66\x4e\x59\x64\x7a'](_0x333907, 0x3)) {
      var _0x1a6130 = [];var _0x1ff3f6 = _0x52ff53[wanzikun_0x9c5f('0x30')];for (var _0xdc9518 = 0x0; _0x2d9a26[wanzikun_0x9c5f('0x51')](_0xdc9518, _0x1ff3f6[wanzikun_0x9c5f('0x4e')]); _0xdc9518++) {
        if (_0x2d9a26[wanzikun_0x9c5f('0x52')] !== _0x2d9a26[wanzikun_0x9c5f('0x52')]) {
          this['\x73\x65\x74\x44\x61\x74\x61']({ '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74': selIterm['\x6e\x61\x6d\x65'], '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74\x49\x6e\x64\x65\x78': event[wanzikun_0x9c5f('0x11')]['\x76\x61\x6c\x75\x65'] });
        } else {
          _0x1a6130[wanzikun_0x9c5f('0x4f')](_0x1ff3f6[_0xdc9518][wanzikun_0x9c5f('0x34')]);
        }
      }this['\x73\x65\x74\x44\x61\x74\x61']({ '\x64\x69\x73\x74\x72\x69\x63\x74\x73': _0x1a6130 });
    }
  }, '\x62\x69\x6e\x64\x50\x69\x63\x6b\x65\x72\x50\x72\x6f\x76\x69\x6e\x63\x65\x43\x68\x61\x6e\x67\x65': function bindPickerProvinceChange(_0x386a8c) {
    var _0xa6e825 = { '\x54\x58\x5a\x71\x73': wanzikun_0x9c5f('0x1') };var _0x6c497d = wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x386a8c[wanzikun_0x9c5f('0x11')][wanzikun_0x9c5f('0x12')]];this[wanzikun_0x9c5f('0x35')]({ '\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65': _0x6c497d[wanzikun_0x9c5f('0x34')], '\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65\x49\x6e\x64\x65\x78': _0x386a8c[wanzikun_0x9c5f('0x11')][wanzikun_0x9c5f('0x12')], '\x73\x65\x6c\x43\x69\x74\x79': _0xa6e825[wanzikun_0x9c5f('0x53')], '\x73\x65\x6c\x43\x69\x74\x79\x49\x6e\x64\x65\x78': 0x0, '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74': '\u8BF7\u9009\u62E9', '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74\x49\x6e\x64\x65\x78': 0x0 });this[wanzikun_0x9c5f('0x48')](0x2, _0x6c497d);
  }, '\x62\x69\x6e\x64\x50\x69\x63\x6b\x65\x72\x43\x69\x74\x79\x43\x68\x61\x6e\x67\x65': function bindPickerCityChange(_0x40bb46) {
    var _0xd159b4 = wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][this['\x64\x61\x74\x61']['\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65\x49\x6e\x64\x65\x78']][wanzikun_0x9c5f('0x29')][_0x40bb46['\x64\x65\x74\x61\x69\x6c'][wanzikun_0x9c5f('0x12')]];this[wanzikun_0x9c5f('0x35')]({ '\x73\x65\x6c\x43\x69\x74\x79': _0xd159b4['\x6e\x61\x6d\x65'], '\x73\x65\x6c\x43\x69\x74\x79\x49\x6e\x64\x65\x78': _0x40bb46[wanzikun_0x9c5f('0x11')][wanzikun_0x9c5f('0x12')], '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74': wanzikun_0x9c5f('0x1'), '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74\x49\x6e\x64\x65\x78': 0x0 });this[wanzikun_0x9c5f('0x48')](0x3, _0xd159b4);
  }, '\x62\x69\x6e\x64\x50\x69\x63\x6b\x65\x72\x43\x68\x61\x6e\x67\x65': function bindPickerChange(_0x5e1e94) {
    var _0x57161c = wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2f')]]['\x63\x69\x74\x79\x4c\x69\x73\x74'][this['\x64\x61\x74\x61'][wanzikun_0x9c5f('0x2a')]]['\x64\x69\x73\x74\x72\x69\x63\x74\x4c\x69\x73\x74'][_0x5e1e94[wanzikun_0x9c5f('0x11')][wanzikun_0x9c5f('0x12')]];if (_0x57161c && _0x57161c[wanzikun_0x9c5f('0x34')] && _0x5e1e94[wanzikun_0x9c5f('0x11')][wanzikun_0x9c5f('0x12')]) {
      this[wanzikun_0x9c5f('0x35')]({ '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74': _0x57161c[wanzikun_0x9c5f('0x34')], '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74\x49\x6e\x64\x65\x78': _0x5e1e94['\x64\x65\x74\x61\x69\x6c']['\x76\x61\x6c\x75\x65'] });
    }
  }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad(_0x1afd86) {
    var _0x5485aa = { '\x55\x71\x41\x70\x54': function UqApT(_0x468002, _0x5607d2) {
        return _0x468002 == _0x5607d2;
      }, '\x6b\x63\x50\x6a\x67': wanzikun_0x9c5f('0x3'), '\x73\x50\x71\x77\x47': function sPqwG(_0xea3be1, _0xa1bfef) {
        return _0xea3be1 === _0xa1bfef;
      }, '\x43\x57\x41\x43\x41': wanzikun_0x9c5f('0x54'), '\x75\x59\x55\x4a\x58': '\x4a\x45\x6b\x69\x75', '\x6b\x6e\x79\x53\x65': function knySe(_0x46b072, _0x13ded8) {
        return _0x46b072 + _0x13ded8;
      } };var _0x31ba1c = this;this[wanzikun_0x9c5f('0x48')](0x1);var _0x5de069 = _0x1afd86['\x69\x64'];if (_0x5de069) {
      if (_0x5485aa[wanzikun_0x9c5f('0x55')](_0x5485aa[wanzikun_0x9c5f('0x56')], _0x5485aa[wanzikun_0x9c5f('0x57')])) {
        districtId = '';
      } else {
        wx[wanzikun_0x9c5f('0x58')]();wx[wanzikun_0x9c5f('0x3c')]({ '\x75\x72\x6c': _0x5485aa[wanzikun_0x9c5f('0x59')](wanzikun_0x112844[wanzikun_0x9c5f('0x3e')][wanzikun_0x9c5f('0x5a')], wanzikun_0x9c5f('0x5b')), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x112844[wanzikun_0x9c5f('0x3e')][wanzikun_0x9c5f('0x40')], '\x69\x64': _0x5de069 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x7078af) {
            wx[wanzikun_0x9c5f('0x46')]();if (_0x5485aa['\x55\x71\x41\x70\x54'](_0x7078af[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x23')], 0x0)) {
              _0x31ba1c[wanzikun_0x9c5f('0x35')]({ '\x69\x64': _0x5de069, '\x61\x64\x64\x72\x65\x73\x73\x44\x61\x74\x61': _0x7078af[wanzikun_0x9c5f('0x1a')]['\x64\x61\x74\x61'], '\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65': _0x7078af[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x24')], '\x73\x65\x6c\x43\x69\x74\x79': _0x7078af['\x64\x61\x74\x61'][wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x25')], '\x73\x65\x6c\x44\x69\x73\x74\x72\x69\x63\x74': _0x7078af['\x64\x61\x74\x61'][wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x26')] });_0x31ba1c[wanzikun_0x9c5f('0x27')](_0x7078af[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x1a')]);return;
            } else {
              wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x5485aa[wanzikun_0x9c5f('0x5c')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });
            }
          } });
      }
    }
  }, '\x73\x65\x74\x44\x42\x53\x61\x76\x65\x41\x64\x64\x72\x65\x73\x73\x49\x64': function setDBSaveAddressId(_0x296a24) {
    var _0x5714df = { '\x4a\x42\x68\x44\x42': wanzikun_0x9c5f('0x7'), '\x59\x66\x53\x42\x66': function YfSBf(_0xa09704, _0x294ec9) {
        return _0xa09704 < _0x294ec9;
      }, '\x70\x45\x4f\x79\x45': function pEOyE(_0x1045a7, _0x4d96eb) {
        return _0x1045a7 == _0x4d96eb;
      }, '\x71\x5a\x47\x76\x69': function qZGvi(_0x2a615c, _0x19fcc6) {
        return _0x2a615c < _0x19fcc6;
      }, '\x62\x74\x52\x42\x67': wanzikun_0x9c5f('0x5d'), '\x46\x69\x57\x4f\x6a': function FiWOj(_0x3d099f, _0x476445) {
        return _0x3d099f == _0x476445;
      }, '\x5a\x68\x64\x4e\x6b': function ZhdNk(_0x3c214a, _0x4199fe) {
        return _0x3c214a !== _0x4199fe;
      }, '\x68\x62\x65\x6b\x65': wanzikun_0x9c5f('0x5e'), '\x6a\x53\x4c\x4e\x52': wanzikun_0x9c5f('0x5f') };var _0x46a763 = 0x0;for (var _0x536f5a = 0x0; _0x5714df[wanzikun_0x9c5f('0x60')](_0x536f5a, wanzikun_0x261d09['\x63\x69\x74\x79\x44\x61\x74\x61'][wanzikun_0x9c5f('0x4e')]); _0x536f5a++) {
      if (_0x5714df[wanzikun_0x9c5f('0x61')](_0x296a24[wanzikun_0x9c5f('0x62')], wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x536f5a]['\x69\x64'])) {
        this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2f')] = _0x536f5a;for (var _0xb4bbed = 0x0; _0x5714df[wanzikun_0x9c5f('0x63')](_0xb4bbed, wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x536f5a][wanzikun_0x9c5f('0x29')][wanzikun_0x9c5f('0x4e')]); _0xb4bbed++) {
          if (_0x296a24[wanzikun_0x9c5f('0x64')] == wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x536f5a][wanzikun_0x9c5f('0x29')][_0xb4bbed]['\x69\x64']) {
            if (_0x5714df[wanzikun_0x9c5f('0x65')] !== _0x5714df[wanzikun_0x9c5f('0x65')]) {
              wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': wanzikun_0x9c5f('0xa'), '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
            } else {
              this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2a')] = _0xb4bbed;for (var _0x1ca4bb = 0x0; _0x1ca4bb < wanzikun_0x261d09['\x63\x69\x74\x79\x44\x61\x74\x61'][_0x536f5a][wanzikun_0x9c5f('0x29')][_0xb4bbed]['\x64\x69\x73\x74\x72\x69\x63\x74\x4c\x69\x73\x74'][wanzikun_0x9c5f('0x4e')]; _0x1ca4bb++) {
                if (wanzikun_0x9c5f('0x66') === '\x42\x49\x77\x77\x6e') {
                  wx['\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c']({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x5714df[wanzikun_0x9c5f('0x67')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
                } else {
                  if (_0x5714df[wanzikun_0x9c5f('0x68')](_0x296a24[wanzikun_0x9c5f('0x3b')], wanzikun_0x261d09['\x63\x69\x74\x79\x44\x61\x74\x61'][_0x536f5a][wanzikun_0x9c5f('0x29')][_0xb4bbed][wanzikun_0x9c5f('0x30')][_0x1ca4bb]['\x69\x64'])) {
                    if (_0x5714df[wanzikun_0x9c5f('0x69')](_0x5714df[wanzikun_0x9c5f('0x6a')], _0x5714df[wanzikun_0x9c5f('0x6b')])) {
                      this['\x64\x61\x74\x61'][wanzikun_0x9c5f('0x31')] = _0x1ca4bb;
                    } else {
                      pinkArray[wanzikun_0x9c5f('0x4f')](dataArray[_0x536f5a][wanzikun_0x9c5f('0x34')]);
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }, '\x73\x65\x6c\x65\x63\x74\x43\x69\x74\x79': function selectCity() {}, '\x64\x65\x6c\x65\x74\x65\x41\x64\x64\x72\x65\x73\x73': function deleteAddress(_0x5de9ce) {
    var _0x474a41 = { '\x6b\x6f\x49\x62\x4d': function koIbM(_0x5cad6e, _0x3ed130) {
        return _0x5cad6e < _0x3ed130;
      }, '\x66\x43\x4a\x4f\x54': function fCJOT(_0x418698, _0x4f212b) {
        return _0x418698 === _0x4f212b;
      }, '\x53\x62\x43\x75\x65': wanzikun_0x9c5f('0x6c'), '\x41\x74\x67\x55\x53': wanzikun_0x9c5f('0x3'), '\x44\x63\x6d\x47\x6d': wanzikun_0x9c5f('0x6d'), '\x42\x71\x72\x52\x6f': wanzikun_0x9c5f('0x6e'), '\x48\x6e\x6f\x71\x43': wanzikun_0x9c5f('0x6f'), '\x61\x76\x51\x77\x46': wanzikun_0x9c5f('0x70') };var _0x26d8c5 = this;var _0x39983a = _0x5de9ce[wanzikun_0x9c5f('0x71')][wanzikun_0x9c5f('0x72')]['\x69\x64'];wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x474a41[wanzikun_0x9c5f('0x73')], '\x73\x75\x63\x63\x65\x73\x73': function success(_0x1161f9) {
        var _0xa76e52 = { '\x71\x73\x61\x51\x65': function qsaQe(_0x2eaaa5, _0x2aeee4) {
            return _0x474a41['\x6b\x6f\x49\x62\x4d'](_0x2eaaa5, _0x2aeee4);
          }, '\x43\x4c\x75\x70\x67': function CLupg(_0x454dda, _0x47368b) {
            return _0x474a41['\x66\x43\x4a\x4f\x54'](_0x454dda, _0x47368b);
          }, '\x71\x47\x72\x6f\x4c': _0x474a41[wanzikun_0x9c5f('0x74')], '\x58\x54\x50\x5a\x67': _0x474a41[wanzikun_0x9c5f('0x75')] };if (_0x1161f9[wanzikun_0x9c5f('0x76')]) {
          wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': wanzikun_0x112844[wanzikun_0x9c5f('0x3e')][wanzikun_0x9c5f('0x5a')] + _0x474a41[wanzikun_0x9c5f('0x77')], '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x112844[wanzikun_0x9c5f('0x3e')][wanzikun_0x9c5f('0x40')], '\x69\x64': _0x39983a }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x1161f9) {
              var _0x5afdef = { '\x43\x5a\x44\x57\x6a': function CZDWj(_0x5123af, _0x50966c) {
                  return _0xa76e52[wanzikun_0x9c5f('0x78')](_0x5123af, _0x50966c);
                }, '\x61\x55\x6b\x54\x54': function aUkTT(_0x15d29b, _0x3c9e5a) {
                  return _0x15d29b == _0x3c9e5a;
                } };if (_0xa76e52[wanzikun_0x9c5f('0x79')]('\x79\x66\x63\x52\x42', _0xa76e52[wanzikun_0x9c5f('0x7a')])) {
                eventJ = { '\x64\x65\x74\x61\x69\x6c': { '\x76\x61\x6c\x75\x65': j } };_0x26d8c5[wanzikun_0x9c5f('0x7b')](eventJ);for (var _0x34025f = 0x0; _0x5afdef[wanzikun_0x9c5f('0x7c')](_0x34025f, wanzikun_0x261d09['\x63\x69\x74\x79\x44\x61\x74\x61'][i][wanzikun_0x9c5f('0x29')][j][wanzikun_0x9c5f('0x30')][wanzikun_0x9c5f('0x4e')]); _0x34025f++) {
                  if (_0x5afdef['\x61\x55\x6b\x54\x54'](diatrictName, wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][i][wanzikun_0x9c5f('0x29')][j][wanzikun_0x9c5f('0x30')][_0x34025f][wanzikun_0x9c5f('0x34')])) {
                    eventJ = { '\x64\x65\x74\x61\x69\x6c': { '\x76\x61\x6c\x75\x65': _0x34025f } };_0x26d8c5[wanzikun_0x9c5f('0x47')](eventJ);
                  }
                }
              } else {
                wx[wanzikun_0x9c5f('0x2')]({});
              }
            } });
        } else if (_0x1161f9[wanzikun_0x9c5f('0x7d')]) {
          if (_0x474a41[wanzikun_0x9c5f('0x7e')](wanzikun_0x9c5f('0x6e'), _0x474a41[wanzikun_0x9c5f('0x7f')])) {
            console[wanzikun_0x9c5f('0x80')](_0x474a41[wanzikun_0x9c5f('0x81')]);
          } else {
            wx[wanzikun_0x9c5f('0x17')]({ '\x74\x69\x74\x6c\x65': '\u63D0\u793A', '\x63\x6f\x6e\x74\x65\x6e\x74': _0xa76e52[wanzikun_0x9c5f('0x82')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });
          }
        }
      } });
  }, '\x72\x65\x61\x64\x46\x72\x6f\x6d\x57\x78': function readFromWx() {
    var _0xb182ba = { '\x61\x7a\x59\x70\x53': function azYpS(_0xf71ee2, _0x5f35c7) {
        return _0xf71ee2 == _0x5f35c7;
      }, '\x44\x68\x69\x78\x6a': function Dhixj(_0x47f599, _0x14e56c) {
        return _0x47f599 < _0x14e56c;
      }, '\x69\x56\x6c\x75\x49': function iVluI(_0x2e229a, _0xb7caf4) {
        return _0x2e229a < _0xb7caf4;
      }, '\x49\x4c\x78\x63\x78': function ILxcx(_0x1fe7b0, _0x3e1a11) {
        return _0x1fe7b0 !== _0x3e1a11;
      }, '\x6b\x57\x6d\x4e\x6b': wanzikun_0x9c5f('0x83'), '\x4c\x69\x42\x55\x74': wanzikun_0x9c5f('0x84'), '\x47\x72\x67\x52\x79': function GrgRy(_0x2fffd2, _0x56af28) {
        return _0x2fffd2 === _0x56af28;
      }, '\x66\x6b\x4e\x68\x66': wanzikun_0x9c5f('0x85'), '\x45\x4a\x74\x78\x42': wanzikun_0x9c5f('0x86'), '\x4f\x48\x57\x55\x41': wanzikun_0x9c5f('0x87'), '\x75\x6d\x52\x69\x71': wanzikun_0x9c5f('0x88') };var _0x51850c = this;wx['\x63\x68\x6f\x6f\x73\x65\x41\x64\x64\x72\x65\x73\x73']({ '\x73\x75\x63\x63\x65\x73\x73': function success(_0x27e1df) {
        console[wanzikun_0x9c5f('0x80')](_0x27e1df);var _0xd88986 = _0x27e1df[wanzikun_0x9c5f('0x89')];var _0x58e908 = _0x27e1df[wanzikun_0x9c5f('0x8a')];var _0xdb1721 = _0x27e1df['\x63\x6f\x75\x6e\x74\x79\x4e\x61\x6d\x65'];var _0x59c848 = 0x0;for (var _0x399524 = 0x0; _0xb182ba[wanzikun_0x9c5f('0x8b')](_0x399524, wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][wanzikun_0x9c5f('0x4e')]); _0x399524++) {
          if (_0xd88986 == wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x399524][wanzikun_0x9c5f('0x34')]) {
            if (_0xb182ba[wanzikun_0x9c5f('0x8c')](_0xb182ba[wanzikun_0x9c5f('0x8d')], _0xb182ba['\x4c\x69\x42\x55\x74'])) {
              var _0x4af7da = { '\x64\x65\x74\x61\x69\x6c': { '\x76\x61\x6c\x75\x65': _0x399524 } };_0x51850c[wanzikun_0x9c5f('0x8e')](_0x4af7da);_0x51850c[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2f')] = _0x399524;for (var _0x3fe3ce = 0x0; _0xb182ba['\x69\x56\x6c\x75\x49'](_0x3fe3ce, wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x399524]['\x63\x69\x74\x79\x4c\x69\x73\x74']['\x6c\x65\x6e\x67\x74\x68']); _0x3fe3ce++) {
                if (_0xb182ba[wanzikun_0x9c5f('0x8f')](_0x58e908, wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x399524][wanzikun_0x9c5f('0x29')][_0x3fe3ce][wanzikun_0x9c5f('0x34')])) {
                  _0x4af7da = { '\x64\x65\x74\x61\x69\x6c': { '\x76\x61\x6c\x75\x65': _0x3fe3ce } };_0x51850c[wanzikun_0x9c5f('0x7b')](_0x4af7da);for (var _0x4ddbb5 = 0x0; _0x4ddbb5 < wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x399524][wanzikun_0x9c5f('0x29')][_0x3fe3ce][wanzikun_0x9c5f('0x30')][wanzikun_0x9c5f('0x4e')]; _0x4ddbb5++) {
                    if (_0xb182ba['\x47\x72\x67\x52\x79'](_0xb182ba[wanzikun_0x9c5f('0x90')], _0xb182ba['\x45\x4a\x74\x78\x42'])) {
                      if (_0xb182ba[wanzikun_0x9c5f('0x8f')](data[wanzikun_0x9c5f('0x64')], wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x399524][wanzikun_0x9c5f('0x29')][_0x3fe3ce]['\x69\x64'])) {
                        this[wanzikun_0x9c5f('0x1a')]['\x73\x65\x6c\x43\x69\x74\x79\x49\x6e\x64\x65\x78'] = _0x3fe3ce;for (var _0x59c9be = 0x0; _0xb182ba[wanzikun_0x9c5f('0x91')](_0x59c9be, wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x399524][wanzikun_0x9c5f('0x29')][_0x3fe3ce][wanzikun_0x9c5f('0x30')][wanzikun_0x9c5f('0x4e')]); _0x59c9be++) {
                          if (_0xb182ba['\x61\x7a\x59\x70\x53'](data[wanzikun_0x9c5f('0x3b')], wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x399524][wanzikun_0x9c5f('0x29')][_0x3fe3ce]['\x64\x69\x73\x74\x72\x69\x63\x74\x4c\x69\x73\x74'][_0x59c9be]['\x69\x64'])) {
                            this['\x64\x61\x74\x61'][wanzikun_0x9c5f('0x31')] = _0x59c9be;
                          }
                        }
                      }
                    } else {
                      if (_0xb182ba['\x61\x7a\x59\x70\x53'](_0xdb1721, wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][_0x399524][wanzikun_0x9c5f('0x29')][_0x3fe3ce][wanzikun_0x9c5f('0x30')][_0x4ddbb5][wanzikun_0x9c5f('0x34')])) {
                        if (_0xb182ba[wanzikun_0x9c5f('0x92')] !== _0xb182ba[wanzikun_0x9c5f('0x93')]) {
                          _0x4af7da = { '\x64\x65\x74\x61\x69\x6c': { '\x76\x61\x6c\x75\x65': _0x4ddbb5 } };_0x51850c[wanzikun_0x9c5f('0x47')](_0x4af7da);
                        } else {
                          var _0x3a2d3a = [];var _0x2d6267 = obj[wanzikun_0x9c5f('0x30')];for (var _0x16f880 = 0x0; _0xb182ba[wanzikun_0x9c5f('0x8b')](_0x16f880, _0x2d6267[wanzikun_0x9c5f('0x4e')]); _0x16f880++) {
                            _0x3a2d3a[wanzikun_0x9c5f('0x4f')](_0x2d6267[_0x16f880][wanzikun_0x9c5f('0x34')]);
                          }this['\x73\x65\x74\x44\x61\x74\x61']({ '\x64\x69\x73\x74\x72\x69\x63\x74\x73': _0x3a2d3a });
                        }
                      }
                    }
                  }
                }
              }
            } else {
              districtId = wanzikun_0x261d09[wanzikun_0x9c5f('0x2e')][this[wanzikun_0x9c5f('0x1a')]['\x73\x65\x6c\x50\x72\x6f\x76\x69\x6e\x63\x65\x49\x6e\x64\x65\x78']][wanzikun_0x9c5f('0x29')][this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x2a')]][wanzikun_0x9c5f('0x30')][this[wanzikun_0x9c5f('0x1a')][wanzikun_0x9c5f('0x31')]]['\x69\x64'];
            }
          }
        }_0x51850c[wanzikun_0x9c5f('0x35')]({ '\x77\x78\x61\x64\x64\x72\x65\x73\x73': _0x27e1df });
      } });
  } }); 
 			}); 	require("pages/address-add/index.js");
 		__wxRoute = 'pages/order-list/index';__wxRouteBegin = true; 	define("pages/order-list/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x1d26 = ['\x67\x50\x69\x69\x64', '\x59\x78\x61\x41\x6a', '\x42\x76\x73\x6f\x43', '\x51\x64\x58\x6a\x61', '\x2f\x6f\x72\x64\x65\x72\x2f\x6c\x69\x73\x74', '\x41\x4b\x4c\x49\x54', '\x4b\x54\x51\x72\x6c', '\x43\x45\x44\x6e\x6a', '\x71\x76\x71\x41\x71', '\u5F85\u53D1\u8D27', '\u5F85\u6536\u8D27', '\u5F85\u8BC4\u4EF7', '\u5DF2\u5B8C\u6210', '\x6e\x59\x62\x56\x46', '\x57\x67\x42\x43\x6b', '\x63\x75\x72\x72\x65\x6e\x74\x54\x79\x70\x65', '\x49\x53\x46\x4e\x65', '\x48\x48\x73\x71\x6e', '\x73\x65\x74\x44\x61\x74\x61', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x64\x61\x74\x61\x73\x65\x74', '\x69\x6e\x64\x65\x78', '\x76\x6e\x54\x4f\x69', '\x4e\x69\x4e\x58\x62', '\x63\x63\x69\x6b\x64', '\x4d\x6c\x55\x76\x70', '\x64\x61\x74\x61', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x42\x78\x76\x41\x47', '\x2f\x70\x61\x67\x65\x73\x2f\x6f\x72\x64\x65\x72\x2d\x64\x65\x74\x61\x69\x6c\x73\x2f\x69\x6e\x64\x65\x78\x3f\x69\x64\x3d', '\x6a\x65\x51\x73\x6c', '\u786E\u5B9A\u8981\u53D6\u6D88\u8BE5\u8BA2\u5355\u5417\uFF1F', '\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c', '\x51\x59\x45\x57\x45', '\x71\x59\x73\x6d\x63', '\x69\x69\x42\x4b\x4d', '\x69\x64\x74\x70\x45', '\x71\x68\x6a\x61\x67', '\x41\x67\x6e\x4b\x74', '\x62\x4a\x76\x4d\x66', '\x45\x6a\x5a\x45\x75', '\x62\x61\x6c\x61\x6e\x63\x65', '\x69\x44\x79\x7a\x6a', '\x72\x65\x71\x75\x65\x73\x74', '\x6b\x51\x6a\x7a\x70', '\x46\x6e\x4b\x57\x6a', '\x61\x70\x70\x6c\x69\x63\x61\x74\x69\x6f\x6e\x2f\x78\x2d\x77\x77\x77\x2d\x66\x6f\x72\x6d\x2d\x75\x72\x6c\x65\x6e\x63\x6f\x64\x65\x64', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x74\x6f\x6b\x65\x6e', '\x72\x65\x4c\x61\x75\x6e\x63\x68', '\x2f\x70\x61\x67\x65\x73\x2f\x6d\x79\x2f\x69\x6e\x64\x65\x78', '\x73\x68\x6f\x77\x4c\x6f\x61\x64\x69\x6e\x67', '\x59\x53\x66\x6a\x77', '\x41\x4b\x58\x64\x55', '\x63\x6f\x64\x65', '\x48\x53\x64\x74\x50', '\x35\x7c\x32\x7c\x31\x7c\x30\x7c\x33\x7c\x34', '\x58\x58\x51\x47\x65', '\x2f\x6f\x72\x64\x65\x72\x2f\x70\x61\x79', '\x50\x4f\x53\x54', '\x6d\x6f\x6e\x65\x79', '\x75\x72\x6c\x73', '\x2f\x75\x73\x65\x72\x2f\x61\x6d\x6f\x75\x6e\x74', '\x6b\x51\x6d\x48\x6f', '\x48\x7a\x52\x41\x64', '\x68\x44\x58\x42\x42', '\x55\x51\x77\x4e\x67', '\x58\x66\x65\x42\x4d', '\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67', '\x67\x6f\x6f\x64\x73\x4d\x61\x70', '\x4a\x4c\x42\x53\x6e', '\x73\x72\x65\x4d\x75', '\x73\x72\x59\x4d\x5a', '\x74\x69\x45\x6b\x69', '\x67\x78\x6c\x4a\x52', '\x77\x46\x76\x70\x58', '\x42\x4e\x4e\x64\x71', '\x4a\x76\x6a\x77\x42', '\x73\x70\x6c\x69\x74', '\x73\x74\x61\x74\x75\x73', '\x67\x65\x74\x4f\x72\x64\x65\x72\x53\x74\x61\x74\x69\x73\x74\x69\x63\x73', '\x77\x68\x69\x41\x66', '\x61\x55\x58\x7a\x6a', '\x42\x42\x74\x61\x76', '\x6f\x72\x64\x65\x72\x4c\x69\x73\x74', '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x4d\x61\x70', '\u65E0\u6CD5\u83B7\u53D6\u7528\u6237\u8D44\u91D1\u4FE1\u606F', '\x73\x74\x61\x74\x75\x73\x54\x61\x70', '\x63\x73\x4a\x53\x65', '\x45\x4d\x6c\x6a\x79', '\x50\x52\x58\x6f\x42', '\x75\x6f\x47\x48\x76', '\x2f\x6f\x72\x64\x65\x72\x2f\x73\x74\x61\x74\x69\x73\x74\x69\x63\x73', '\x74\x6e\x59\x75\x48', '\x48\x73\x4d\x4f\x5a', '\x43\x65\x42\x6b\x75', '\x63\x52\x6e\x76\x68', '\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x74\x72\x61\x6e\x73\x66\x65\x72', '\x45\x6f\x4f\x7a\x46', '\x4d\x59\x53\x4f\x75', '\x4b\x6d\x53\x53\x4d', '\x63\x6f\x6e\x66\x69\x72\x6d', '\x48\x63\x46\x42\x64', '\x41\x7a\x78\x70\x6c', '\x4a\x51\x55\x73\x58', '\x72\x65\x64\x2d\x64\x6f\x74'];(function (_0x22b5fb, _0x116a41) {
  var _0x43fb75 = function _0x43fb75(_0x47f957) {
    while (--_0x47f957) {
      _0x22b5fb['push'](_0x22b5fb['shift']());
    }
  };_0x43fb75(++_0x116a41);
})(wanzikun_0x1d26, 0xdd);var wanzikun_0x4f99 = function wanzikun_0x4f99(_0x491cfd, _0x2c41f3) {
  _0x491cfd = _0x491cfd - 0x0;var _0x141e3b = wanzikun_0x1d26[_0x491cfd];return _0x141e3b;
};var wanzikun_0x3aacdc = require('\x2e\x2e\x2f\x2e\x2e\x2f\x75\x74\x69\x6c\x73\x2f\x70\x61\x79\x2e\x6a\x73');var wanzikun_0x5177be = getApp();Page({ '\x64\x61\x74\x61': { '\x73\x74\x61\x74\x75\x73\x54\x79\x70\x65': ['\u5F85\u4ED8\u6B3E', wanzikun_0x4f99('0x0'), wanzikun_0x4f99('0x1'), wanzikun_0x4f99('0x2'), wanzikun_0x4f99('0x3')], '\x63\x75\x72\x72\x65\x6e\x74\x54\x79\x70\x65': 0x0, '\x74\x61\x62\x43\x6c\x61\x73\x73': ['', '', '', '', ''] }, '\x73\x74\x61\x74\x75\x73\x54\x61\x70': function statusTap(_0x5c871f) {
    var _0x1bf56f = { '\x49\x53\x46\x4e\x65': function ISFNe(_0x315ded, _0x19ad9c) {
        return _0x315ded !== _0x19ad9c;
      }, '\x48\x48\x73\x71\x6e': '\x6d\x6c\x6f\x56\x75', '\x76\x6e\x54\x4f\x69': function vnTOi(_0x130022, _0x739408) {
        return _0x130022 == _0x739408;
      }, '\x4e\x69\x4e\x58\x62': wanzikun_0x4f99('0x4'), '\x63\x63\x69\x6b\x64': function ccikd(_0x32e21e, _0x5c645c) {
        return _0x32e21e === _0x5c645c;
      }, '\x4d\x6c\x55\x76\x70': wanzikun_0x4f99('0x5') };if (_0x5c871f[wanzikun_0x4f99('0x6')]) {
      var _0x4ef5fa = _0x5c871f[wanzikun_0x4f99('0x6')];
    } else {
      if (_0x1bf56f[wanzikun_0x4f99('0x7')](_0x1bf56f[wanzikun_0x4f99('0x8')], _0x1bf56f[wanzikun_0x4f99('0x8')])) {
        this[wanzikun_0x4f99('0x9')]({ '\x6f\x72\x64\x65\x72\x4c\x69\x73\x74': null, '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x4d\x61\x70': {}, '\x67\x6f\x6f\x64\x73\x4d\x61\x70': {} });
      } else {
        var _0x4ef5fa = _0x5c871f[wanzikun_0x4f99('0xa')][wanzikun_0x4f99('0xb')][wanzikun_0x4f99('0xc')];
      }
    }var _0x3d160f = _0x5c871f;var _0x2d7919 = 0x0;for (var _0x4ae7e1 in _0x3d160f) {
      _0x2d7919++;
    }if (_0x1bf56f[wanzikun_0x4f99('0xd')](_0x2d7919, 0x0)) {
      if (_0x1bf56f[wanzikun_0x4f99('0xe')] === _0x1bf56f[wanzikun_0x4f99('0xe')]) {
        var _0x129419 = 0x0;
      } else {
        tabClass[0x3] = '';
      }
    } else {
      if (_0x1bf56f[wanzikun_0x4f99('0xf')](_0x1bf56f[wanzikun_0x4f99('0x10')], wanzikun_0x4f99('0x5'))) {
        var _0x129419 = _0x4ef5fa;
      } else {
        var _0x40eafd = _0x5c871f[wanzikun_0x4f99('0x6')];
      }
    }this[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x6')] = _0x129419;this[wanzikun_0x4f99('0x9')]({ '\x63\x75\x72\x72\x65\x6e\x74\x54\x79\x70\x65': _0x129419 });this['\x6f\x6e\x53\x68\x6f\x77']();
  }, '\x6f\x72\x64\x65\x72\x44\x65\x74\x61\x69\x6c': function orderDetail(_0xf8c8fb) {
    var _0x5c323f = { '\x42\x78\x76\x41\x47': function BxvAG(_0x877240, _0x2af763) {
        return _0x877240 + _0x2af763;
      } };var _0x399f56 = _0xf8c8fb[wanzikun_0x4f99('0xa')]['\x64\x61\x74\x61\x73\x65\x74']['\x69\x64'];wx[wanzikun_0x4f99('0x12')]({ '\x75\x72\x6c': _0x5c323f[wanzikun_0x4f99('0x13')](wanzikun_0x4f99('0x14'), _0x399f56) });
  }, '\x63\x61\x6e\x63\x65\x6c\x4f\x72\x64\x65\x72\x54\x61\x70': function cancelOrderTap(_0x247114) {
    var _0x29a4ee = { '\x71\x59\x73\x6d\x63': function qYsmc(_0x1e810f, _0x4f746a) {
        return _0x1e810f - _0x4f746a;
      }, '\x69\x69\x42\x4b\x4d': function iiBKM(_0x4afad2, _0x4531c3) {
        return _0x4afad2 <= _0x4531c3;
      }, '\x69\x64\x74\x70\x45': function idtpE(_0x3ddb15, _0x2c48fc) {
        return _0x3ddb15 + _0x2c48fc;
      }, '\x71\x68\x6a\x61\x67': '\x50\x4f\x53\x54', '\x41\x67\x6e\x4b\x74': function AgnKt(_0x1b00db, _0x582ff3) {
        return _0x1b00db == _0x582ff3;
      }, '\x62\x4a\x76\x4d\x66': function bJvMf(_0x53267d, _0x4db051) {
        return _0x53267d !== _0x4db051;
      }, '\x45\x6a\x5a\x45\x75': wanzikun_0x4f99('0x15'), '\x59\x53\x66\x6a\x77': function YSfjw(_0x551c9a, _0x2b5067) {
        return _0x551c9a + _0x2b5067;
      }, '\x47\x71\x4e\x54\x4e': '\x2f\x6f\x72\x64\x65\x72\x2f\x63\x6c\x6f\x73\x65', '\x51\x59\x45\x57\x45': wanzikun_0x4f99('0x16') };var _0xaa6797 = this;var _0x46c483 = _0x247114['\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74'][wanzikun_0x4f99('0xb')]['\x69\x64'];wx[wanzikun_0x4f99('0x17')]({ '\x74\x69\x74\x6c\x65': _0x29a4ee[wanzikun_0x4f99('0x18')], '\x63\x6f\x6e\x74\x65\x6e\x74': '', '\x73\x75\x63\x63\x65\x73\x73': function success(_0x290739) {
        var _0x31cdee = { '\x65\x79\x66\x6a\x4c': function eyfjL(_0x51f8ec, _0xa97eb3) {
            return _0x29a4ee[wanzikun_0x4f99('0x19')](_0x51f8ec, _0xa97eb3);
          }, '\x69\x44\x79\x7a\x6a': function iDyzj(_0x649712, _0x2f307b) {
            return _0x29a4ee[wanzikun_0x4f99('0x1a')](_0x649712, _0x2f307b);
          }, '\x4c\x73\x53\x62\x49': function LsSbI(_0x190963, _0x37a465) {
            return _0x29a4ee[wanzikun_0x4f99('0x1b')](_0x190963, _0x37a465);
          }, '\x6b\x51\x6a\x7a\x70': '\x2f\x6f\x72\x64\x65\x72\x2f\x70\x61\x79', '\x46\x6e\x4b\x57\x6a': _0x29a4ee[wanzikun_0x4f99('0x1c')], '\x41\x4b\x58\x64\x55': function AKXdU(_0x3073b9, _0x576758) {
            return _0x29a4ee[wanzikun_0x4f99('0x1d')](_0x3073b9, _0x576758);
          } };if (_0x29a4ee[wanzikun_0x4f99('0x1e')](_0x29a4ee[wanzikun_0x4f99('0x1f')], _0x29a4ee[wanzikun_0x4f99('0x1f')])) {
          money = _0x31cdee['\x65\x79\x66\x6a\x4c'](money, _0x290739[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x20')]);if (_0x31cdee[wanzikun_0x4f99('0x21')](money, 0x0)) {
            wx[wanzikun_0x4f99('0x22')]({ '\x75\x72\x6c': _0x31cdee['\x4c\x73\x53\x62\x49'](wanzikun_0x5177be['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61']['\x75\x72\x6c\x73'], _0x31cdee[wanzikun_0x4f99('0x23')]), '\x6d\x65\x74\x68\x6f\x64': _0x31cdee[wanzikun_0x4f99('0x24')], '\x68\x65\x61\x64\x65\x72': { 'content-type': wanzikun_0x4f99('0x25') }, '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5177be[wanzikun_0x4f99('0x26')][wanzikun_0x4f99('0x27')], '\x6f\x72\x64\x65\x72\x49\x64': _0x46c483 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x51f3b3) {
                wx[wanzikun_0x4f99('0x28')]({ '\x75\x72\x6c': '\x2f\x70\x61\x67\x65\x73\x2f\x6d\x79\x2f\x69\x6e\x64\x65\x78' });
              } });
          } else {
            wanzikun_0x3aacdc['\x77\x78\x70\x61\x79'](wanzikun_0x5177be, money, _0x46c483, wanzikun_0x4f99('0x29'));
          }
        } else {
          if (_0x290739['\x63\x6f\x6e\x66\x69\x72\x6d']) {
            wx[wanzikun_0x4f99('0x2a')]();wx[wanzikun_0x4f99('0x22')]({ '\x75\x72\x6c': _0x29a4ee[wanzikun_0x4f99('0x2b')](wanzikun_0x5177be['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61']['\x75\x72\x6c\x73'], _0x29a4ee['\x47\x71\x4e\x54\x4e']), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5177be['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x4f99('0x27')], '\x6f\x72\x64\x65\x72\x49\x64': _0x46c483 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x290739) {
                wx['\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67']();if (_0x31cdee[wanzikun_0x4f99('0x2c')](_0x290739['\x64\x61\x74\x61'][wanzikun_0x4f99('0x2d')], 0x0)) {
                  _0xaa6797['\x6f\x6e\x53\x68\x6f\x77']();
                }
              } });
          }
        }
      } });
  }, '\x74\x6f\x50\x61\x79\x54\x61\x70': function toPayTap(_0x539439) {
    var _0x449736 = { '\x68\x44\x58\x42\x42': function hDXBB(_0x1dae57, _0x3b7730) {
        return _0x1dae57 == _0x3b7730;
      }, '\x67\x78\x6c\x4a\x52': function gxlJR(_0x1d1ed7, _0x3a1374) {
        return _0x1d1ed7 === _0x3a1374;
      }, '\x77\x46\x76\x70\x58': wanzikun_0x4f99('0x2e'), '\x42\x4e\x4e\x64\x71': wanzikun_0x4f99('0x29'), '\x6b\x51\x6d\x48\x6f': wanzikun_0x4f99('0x2f'), '\x48\x7a\x52\x41\x64': '\x2f\x6f\x72\x64\x65\x72\x2f\x6c\x69\x73\x74', '\x55\x51\x77\x4e\x67': function UQwNg(_0xf82428, _0x5a5809) {
        return _0xf82428 - _0x5a5809;
      }, '\x6e\x54\x65\x4a\x54': function nTeJT(_0x1be68d, _0x5aed7e) {
        return _0x1be68d <= _0x5aed7e;
      }, '\x58\x66\x65\x42\x4d': function XfeBM(_0x4e2e57, _0x289978) {
        return _0x4e2e57 !== _0x289978;
      }, '\x65\x46\x5a\x56\x63': wanzikun_0x4f99('0x30'), '\x4a\x4c\x42\x53\x6e': function JLBSn(_0x258c3e, _0x19871f) {
        return _0x258c3e + _0x19871f;
      }, '\x73\x72\x65\x4d\x75': wanzikun_0x4f99('0x31'), '\x73\x72\x59\x4d\x5a': wanzikun_0x4f99('0x32'), '\x74\x69\x45\x6b\x69': wanzikun_0x4f99('0x25') };var _0x1b9e6e = this;var _0x13c669 = _0x539439[wanzikun_0x4f99('0xa')][wanzikun_0x4f99('0xb')]['\x69\x64'];var _0x2b380d = _0x539439[wanzikun_0x4f99('0xa')][wanzikun_0x4f99('0xb')][wanzikun_0x4f99('0x33')];wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': wanzikun_0x5177be[wanzikun_0x4f99('0x26')][wanzikun_0x4f99('0x34')] + wanzikun_0x4f99('0x35'), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5177be[wanzikun_0x4f99('0x26')][wanzikun_0x4f99('0x27')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x4742ee) {
        var _0x4ababd = { '\x58\x56\x62\x41\x58': function XVbAX(_0xcaf2c5, _0x41d28e) {
            return _0x449736['\x68\x44\x58\x42\x42'](_0xcaf2c5, _0x41d28e);
          }, '\x4a\x76\x6a\x77\x42': _0x449736[wanzikun_0x4f99('0x36')], '\x77\x68\x69\x41\x66': function whiAf(_0x4df80f, _0x26dd78) {
            return _0x4df80f + _0x26dd78;
          }, '\x61\x55\x58\x7a\x6a': _0x449736[wanzikun_0x4f99('0x37')] };if (_0x449736[wanzikun_0x4f99('0x38')](_0x4742ee[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x2d')], 0x0)) {
          _0x2b380d = _0x449736[wanzikun_0x4f99('0x39')](_0x2b380d, _0x4742ee[wanzikun_0x4f99('0x11')]['\x64\x61\x74\x61']['\x62\x61\x6c\x61\x6e\x63\x65']);if (_0x449736['\x6e\x54\x65\x4a\x54'](_0x2b380d, 0x0)) {
            if (_0x449736[wanzikun_0x4f99('0x3a')](_0x449736['\x65\x46\x5a\x56\x63'], wanzikun_0x4f99('0x30'))) {
              wx[wanzikun_0x4f99('0x3b')]();if (_0x4ababd['\x58\x56\x62\x41\x58'](_0x4742ee[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x2d')], 0x0)) {
                _0x1b9e6e[wanzikun_0x4f99('0x9')]({ '\x6f\x72\x64\x65\x72\x4c\x69\x73\x74': _0x4742ee['\x64\x61\x74\x61'][wanzikun_0x4f99('0x11')]['\x6f\x72\x64\x65\x72\x4c\x69\x73\x74'], '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x4d\x61\x70': _0x4742ee[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x11')]['\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x4d\x61\x70'], '\x67\x6f\x6f\x64\x73\x4d\x61\x70': _0x4742ee['\x64\x61\x74\x61']['\x64\x61\x74\x61'][wanzikun_0x4f99('0x3c')] });
              } else {
                this[wanzikun_0x4f99('0x9')]({ '\x6f\x72\x64\x65\x72\x4c\x69\x73\x74': null, '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x4d\x61\x70': {}, '\x67\x6f\x6f\x64\x73\x4d\x61\x70': {} });
              }
            } else {
              wx[wanzikun_0x4f99('0x22')]({ '\x75\x72\x6c': _0x449736[wanzikun_0x4f99('0x3d')](wanzikun_0x5177be[wanzikun_0x4f99('0x26')]['\x75\x72\x6c\x73'], _0x449736[wanzikun_0x4f99('0x3e')]), '\x6d\x65\x74\x68\x6f\x64': _0x449736[wanzikun_0x4f99('0x3f')], '\x68\x65\x61\x64\x65\x72': { 'content-type': _0x449736[wanzikun_0x4f99('0x40')] }, '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5177be[wanzikun_0x4f99('0x26')][wanzikun_0x4f99('0x27')], '\x6f\x72\x64\x65\x72\x49\x64': _0x13c669 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x25929d) {
                  var _this = this;

                  var _0xd76f91 = { '\x42\x42\x74\x61\x76': function BBtav(_0xa532b6, _0x8013db) {
                      return _0x449736[wanzikun_0x4f99('0x38')](_0xa532b6, _0x8013db);
                    } };if (_0x449736[wanzikun_0x4f99('0x41')](_0x449736[wanzikun_0x4f99('0x42')], _0x449736[wanzikun_0x4f99('0x42')])) {
                    wx[wanzikun_0x4f99('0x28')]({ '\x75\x72\x6c': _0x449736[wanzikun_0x4f99('0x43')] });
                  } else {
                    var _0x18c4c8 = _0x4ababd[wanzikun_0x4f99('0x44')][wanzikun_0x4f99('0x45')]('\x7c'),
                        _0x5eb10e = 0x0;while (!![]) {
                      switch (_0x18c4c8[_0x5eb10e++]) {case '\x30':
                          _0x494406[wanzikun_0x4f99('0x46')] = _0x22900e[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x6')];continue;case '\x31':
                          var _0x494406 = { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5177be[wanzikun_0x4f99('0x26')][wanzikun_0x4f99('0x27')] };continue;case '\x32':
                          var _0x22900e = this;continue;case '\x33':
                          this[wanzikun_0x4f99('0x47')]();continue;case '\x34':
                          wx['\x72\x65\x71\x75\x65\x73\x74']({ '\x75\x72\x6c': _0x4ababd[wanzikun_0x4f99('0x48')](wanzikun_0x5177be[wanzikun_0x4f99('0x26')]['\x75\x72\x6c\x73'], _0x4ababd[wanzikun_0x4f99('0x49')]), '\x64\x61\x74\x61': _0x494406, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x157080) {
                              wx[wanzikun_0x4f99('0x3b')]();if (_0xd76f91[wanzikun_0x4f99('0x4a')](_0x157080[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x2d')], 0x0)) {
                                _0x22900e[wanzikun_0x4f99('0x9')]({ '\x6f\x72\x64\x65\x72\x4c\x69\x73\x74': _0x157080[wanzikun_0x4f99('0x11')]['\x64\x61\x74\x61'][wanzikun_0x4f99('0x4b')], '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x4d\x61\x70': _0x157080['\x64\x61\x74\x61'][wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x4c')], '\x67\x6f\x6f\x64\x73\x4d\x61\x70': _0x157080['\x64\x61\x74\x61']['\x64\x61\x74\x61'][wanzikun_0x4f99('0x3c')] });
                              } else {
                                _this[wanzikun_0x4f99('0x9')]({ '\x6f\x72\x64\x65\x72\x4c\x69\x73\x74': null, '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x4d\x61\x70': {}, '\x67\x6f\x6f\x64\x73\x4d\x61\x70': {} });
                              }
                            } });continue;case '\x35':
                          wx[wanzikun_0x4f99('0x2a')]();continue;}break;
                    }
                  }
                } });
            }
          } else {
            wanzikun_0x3aacdc['\x77\x78\x70\x61\x79'](wanzikun_0x5177be, _0x2b380d, _0x13c669, _0x449736[wanzikun_0x4f99('0x43')]);
          }
        } else {
          wx[wanzikun_0x4f99('0x17')]({ '\x74\x69\x74\x6c\x65': '\u9519\u8BEF', '\x63\x6f\x6e\x74\x65\x6e\x74': wanzikun_0x4f99('0x4d'), '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });
        }
      } });
  }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad(_0x39435a) {
    var _0x1fae68 = _0x39435a['\x63\x75\x72\x72\x65\x6e\x74\x54\x79\x70\x65'];this[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x6')] = _0x1fae68;this['\x73\x65\x74\x44\x61\x74\x61']({ '\x63\x75\x72\x72\x65\x6e\x74\x54\x79\x70\x65': _0x1fae68 });this[wanzikun_0x4f99('0x4e')](_0x39435a);
  }, '\x6f\x6e\x52\x65\x61\x64\x79': function onReady() {}, '\x67\x65\x74\x4f\x72\x64\x65\x72\x53\x74\x61\x74\x69\x73\x74\x69\x63\x73': function getOrderStatistics() {
    var _0x320362 = { '\x59\x78\x61\x41\x6a': wanzikun_0x4f99('0x4d'), '\x66\x65\x72\x6d\x42': wanzikun_0x4f99('0x4f'), '\x43\x65\x42\x6b\x75': function CeBku(_0x3548c0, _0x431dbf) {
        return _0x3548c0 > _0x431dbf;
      }, '\x63\x52\x6e\x76\x68': '\x72\x65\x64\x2d\x64\x6f\x74', '\x45\x6f\x4f\x7a\x46': function EoOzF(_0x1dc54e, _0x54ffa1) {
        return _0x1dc54e !== _0x54ffa1;
      }, '\x4d\x59\x53\x4f\x75': wanzikun_0x4f99('0x50'), '\x4b\x6d\x53\x53\x4d': wanzikun_0x4f99('0x51'), '\x4a\x51\x55\x73\x58': '\x53\x4e\x67\x6a\x69', '\x68\x4f\x71\x73\x6e': wanzikun_0x4f99('0x52'), '\x67\x50\x69\x69\x64': function gPiid(_0x2d461a, _0x321354) {
        return _0x2d461a > _0x321354;
      }, '\x74\x6e\x59\x75\x48': function tnYuH(_0x30f26b, _0x3d8521) {
        return _0x30f26b + _0x3d8521;
      }, '\x48\x73\x4d\x4f\x5a': wanzikun_0x4f99('0x53') };var _0x4bfac9 = this;wx[wanzikun_0x4f99('0x22')]({ '\x75\x72\x6c': _0x320362[wanzikun_0x4f99('0x54')](wanzikun_0x5177be[wanzikun_0x4f99('0x26')][wanzikun_0x4f99('0x34')], _0x320362[wanzikun_0x4f99('0x55')]), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5177be[wanzikun_0x4f99('0x26')][wanzikun_0x4f99('0x27')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x57761c) {
        var _0x1fb859 = { '\x48\x63\x46\x42\x64': function HcFBd(_0x1a0282, _0x197b03) {
            return _0x1a0282 + _0x197b03;
          } };wx[wanzikun_0x4f99('0x3b')]();if (_0x57761c[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x2d')] == 0x0) {
          if ('\x63\x73\x4a\x53\x65' === _0x320362['\x66\x65\x72\x6d\x42']) {
            var _0x1ae05c = _0x4bfac9[wanzikun_0x4f99('0x11')]['\x74\x61\x62\x43\x6c\x61\x73\x73'];if (_0x320362[wanzikun_0x4f99('0x56')](_0x57761c['\x64\x61\x74\x61'][wanzikun_0x4f99('0x11')]['\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x70\x61\x79'], 0x0)) {
              _0x1ae05c[0x0] = _0x320362[wanzikun_0x4f99('0x57')];
            } else {
              _0x1ae05c[0x0] = '';
            }if (_0x320362['\x43\x65\x42\x6b\x75'](_0x57761c[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x58')], 0x0)) {
              _0x1ae05c[0x1] = _0x320362[wanzikun_0x4f99('0x57')];
            } else {
              if (_0x320362[wanzikun_0x4f99('0x59')](_0x320362[wanzikun_0x4f99('0x5a')], _0x320362[wanzikun_0x4f99('0x5b')])) {
                _0x1ae05c[0x1] = '';
              } else {
                var _0x49502b = { '\x41\x7a\x78\x70\x6c': function Azxpl(_0x2d6e98, _0x1103f8) {
                    return _0x2d6e98 == _0x1103f8;
                  } };if (_0x57761c[wanzikun_0x4f99('0x5c')]) {
                  wx[wanzikun_0x4f99('0x2a')]();wx[wanzikun_0x4f99('0x22')]({ '\x75\x72\x6c': _0x1fb859[wanzikun_0x4f99('0x5d')](wanzikun_0x5177be['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x4f99('0x34')], '\x2f\x6f\x72\x64\x65\x72\x2f\x63\x6c\x6f\x73\x65'), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5177be[wanzikun_0x4f99('0x26')][wanzikun_0x4f99('0x27')], '\x6f\x72\x64\x65\x72\x49\x64': orderId }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x71ac6a) {
                      wx[wanzikun_0x4f99('0x3b')]();if (_0x49502b[wanzikun_0x4f99('0x5e')](_0x71ac6a['\x64\x61\x74\x61']['\x63\x6f\x64\x65'], 0x0)) {
                        _0x4bfac9['\x6f\x6e\x53\x68\x6f\x77']();
                      }
                    } });
                }
              }
            }if (_0x320362[wanzikun_0x4f99('0x56')](_0x57761c[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x11')]['\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x63\x6f\x6e\x66\x69\x72\x6d'], 0x0)) {
              _0x1ae05c[0x2] = _0x320362['\x63\x52\x6e\x76\x68'];
            } else {
              if (_0x320362[wanzikun_0x4f99('0x5f')] !== _0x320362['\x68\x4f\x71\x73\x6e']) {
                _0x1ae05c[0x2] = '';
              } else {
                _0x1ae05c[0x2] = '';
              }
            }if (_0x320362[wanzikun_0x4f99('0x56')](_0x57761c[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x11')]['\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x6e\x6f\x5f\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e'], 0x0)) {
              _0x1ae05c[0x3] = wanzikun_0x4f99('0x60');
            } else {
              _0x1ae05c[0x3] = '';
            }if (_0x320362[wanzikun_0x4f99('0x61')](_0x57761c[wanzikun_0x4f99('0x11')]['\x64\x61\x74\x61']['\x63\x6f\x75\x6e\x74\x5f\x69\x64\x5f\x73\x75\x63\x63\x65\x73\x73'], 0x0)) {} else {}_0x4bfac9[wanzikun_0x4f99('0x9')]({ '\x74\x61\x62\x43\x6c\x61\x73\x73': _0x1ae05c });
          } else {
            wx[wanzikun_0x4f99('0x17')]({ '\x74\x69\x74\x6c\x65': '\u9519\u8BEF', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x320362[wanzikun_0x4f99('0x62')], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });
          }
        }
      } });
  }, '\x6f\x6e\x53\x68\x6f\x77': function onShow(_0x30b642) {
    var _this2 = this;

    var _0x3da460 = { '\x41\x4b\x4c\x49\x54': function AKLIT(_0x5b3b6c, _0x1cfa32) {
        return _0x5b3b6c !== _0x1cfa32;
      }, '\x4b\x54\x51\x72\x6c': wanzikun_0x4f99('0x63'), '\x43\x45\x44\x6e\x6a': '\x57\x62\x56\x63\x5a', '\x76\x49\x43\x64\x64': function vICdd(_0xc9902a, _0x1ea8aa) {
        return _0xc9902a == _0x1ea8aa;
      }, '\x71\x76\x71\x41\x71': wanzikun_0x4f99('0x64'), '\x62\x6e\x6b\x76\x58': wanzikun_0x4f99('0x65') };wx[wanzikun_0x4f99('0x2a')]();var _0x4d81cc = this;var _0x465c70 = { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5177be[wanzikun_0x4f99('0x26')][wanzikun_0x4f99('0x27')] };_0x465c70[wanzikun_0x4f99('0x46')] = _0x4d81cc[wanzikun_0x4f99('0x11')]['\x63\x75\x72\x72\x65\x6e\x74\x54\x79\x70\x65'];this['\x67\x65\x74\x4f\x72\x64\x65\x72\x53\x74\x61\x74\x69\x73\x74\x69\x63\x73']();wx[wanzikun_0x4f99('0x22')]({ '\x75\x72\x6c': wanzikun_0x5177be[wanzikun_0x4f99('0x26')][wanzikun_0x4f99('0x34')] + _0x3da460['\x62\x6e\x6b\x76\x58'], '\x64\x61\x74\x61': _0x465c70, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x248a92) {
        if (_0x3da460[wanzikun_0x4f99('0x66')](_0x3da460[wanzikun_0x4f99('0x67')], _0x3da460[wanzikun_0x4f99('0x68')])) {
          wx[wanzikun_0x4f99('0x3b')]();if (_0x3da460['\x76\x49\x43\x64\x64'](_0x248a92[wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x2d')], 0x0)) {
            _0x4d81cc[wanzikun_0x4f99('0x9')]({ '\x6f\x72\x64\x65\x72\x4c\x69\x73\x74': _0x248a92['\x64\x61\x74\x61'][wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x4b')], '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x4d\x61\x70': _0x248a92[wanzikun_0x4f99('0x11')]['\x64\x61\x74\x61'][wanzikun_0x4f99('0x4c')], '\x67\x6f\x6f\x64\x73\x4d\x61\x70': _0x248a92['\x64\x61\x74\x61'][wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x3c')] });
          } else {
            if (_0x3da460[wanzikun_0x4f99('0x69')] !== _0x3da460['\x71\x76\x71\x41\x71']) {
              var _0x43e972 = _0x30b642[wanzikun_0x4f99('0x6')];_this2['\x64\x61\x74\x61']['\x63\x75\x72\x72\x65\x6e\x74\x54\x79\x70\x65'] = _0x43e972;_this2['\x73\x65\x74\x44\x61\x74\x61']({ '\x63\x75\x72\x72\x65\x6e\x74\x54\x79\x70\x65': _0x43e972 });_this2[wanzikun_0x4f99('0x4e')](_0x30b642);
            } else {
              _this2[wanzikun_0x4f99('0x9')]({ '\x6f\x72\x64\x65\x72\x4c\x69\x73\x74': null, '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x4d\x61\x70': {}, '\x67\x6f\x6f\x64\x73\x4d\x61\x70': {} });
            }
          }
        } else {
          _0x4d81cc[wanzikun_0x4f99('0x9')]({ '\x6f\x72\x64\x65\x72\x4c\x69\x73\x74': _0x248a92['\x64\x61\x74\x61']['\x64\x61\x74\x61'][wanzikun_0x4f99('0x4b')], '\x6c\x6f\x67\x69\x73\x74\x69\x63\x73\x4d\x61\x70': _0x248a92['\x64\x61\x74\x61'][wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x4c')], '\x67\x6f\x6f\x64\x73\x4d\x61\x70': _0x248a92['\x64\x61\x74\x61'][wanzikun_0x4f99('0x11')][wanzikun_0x4f99('0x3c')] });
        }
      } });
  }, '\x6f\x6e\x48\x69\x64\x65': function onHide() {}, '\x6f\x6e\x55\x6e\x6c\x6f\x61\x64': function onUnload() {}, '\x6f\x6e\x50\x75\x6c\x6c\x44\x6f\x77\x6e\x52\x65\x66\x72\x65\x73\x68': function onPullDownRefresh() {}, '\x6f\x6e\x52\x65\x61\x63\x68\x42\x6f\x74\x74\x6f\x6d': function onReachBottom() {} }); 
 			}); 	require("pages/order-list/index.js");
 		__wxRoute = 'pages/select-address/index';__wxRouteBegin = true; 	define("pages/select-address/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x2693 = ['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x75\x72\x6c\x73', '\x75\x6b\x65\x44\x4b', '\x68\x49\x70\x74\x4f', '\x54\x63\x54\x63\x68', '\x41\x77\x4e\x4b\x57', '\x6e\x61\x76\x69\x67\x61\x74\x65\x42\x61\x63\x6b', '\x2f\x70\x61\x67\x65\x73\x2f\x61\x64\x64\x72\x65\x73\x73\x2d\x61\x64\x64\x2f\x69\x6e\x64\x65\x78', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x57\x67\x52\x52\x70', '\x2f\x70\x61\x67\x65\x73\x2f\x61\x64\x64\x72\x65\x73\x73\x2d\x61\x64\x64\x2f\x69\x6e\x64\x65\x78\x3f\x69\x64\x3d', '\x6b\x52\x6f\x79\x69', '\x69\x6e\x69\x74\x53\x68\x69\x70\x70\x69\x6e\x67\x41\x64\x64\x72\x65\x73\x73', '\x2f\x75\x73\x65\x72\x2f\x73\x68\x69\x70\x70\x69\x6e\x67\x2d\x61\x64\x64\x72\x65\x73\x73\x2f\x6c\x69\x73\x74', '\x63\x6f\x64\x65', '\x6a\x6e\x4c\x6e\x57', '\x74\x53\x56\x56\x44', '\x73\x65\x74\x44\x61\x74\x61', '\x64\x61\x74\x61', '\x2f\x75\x73\x65\x72\x2f\x73\x68\x69\x70\x70\x69\x6e\x67\x2d\x61\x64\x64\x72\x65\x73\x73\x2f\x75\x70\x64\x61\x74\x65', '\x4f\x6c\x77\x47\x6c', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x64\x61\x74\x61\x73\x65\x74', '\x72\x65\x71\x75\x65\x73\x74'];(function (_0x55e9d9, _0x437fe1) {
  var _0x751f4 = function _0x751f4(_0x12c6c7) {
    while (--_0x12c6c7) {
      _0x55e9d9['push'](_0x55e9d9['shift']());
    }
  };_0x751f4(++_0x437fe1);
})(wanzikun_0x2693, 0x11b);var wanzikun_0x2b75 = function wanzikun_0x2b75(_0x3e33e8, _0x464c5d) {
  _0x3e33e8 = _0x3e33e8 - 0x0;var _0x5bc99a = wanzikun_0x2693[_0x3e33e8];return _0x5bc99a;
};var wanzikun_0x5b6e24 = getApp();Page({ '\x64\x61\x74\x61': { '\x61\x64\x64\x72\x65\x73\x73\x4c\x69\x73\x74': [] }, '\x73\x65\x6c\x65\x63\x74\x54\x61\x70': function selectTap(_0x3ee62a) {
    var _0x42bb29 = { '\x75\x6b\x65\x44\x4b': wanzikun_0x2b75('0x0'), '\x68\x49\x70\x74\x4f': '\x74\x72\x75\x65', '\x54\x63\x54\x63\x68': function TcTch(_0x3a5a9d, _0x280083) {
        return _0x3a5a9d === _0x280083;
      }, '\x41\x77\x4e\x4b\x57': wanzikun_0x2b75('0x1') };var _0x5bdb36 = _0x3ee62a[wanzikun_0x2b75('0x2')][wanzikun_0x2b75('0x3')]['\x69\x64'];wx[wanzikun_0x2b75('0x4')]({ '\x75\x72\x6c': wanzikun_0x5b6e24[wanzikun_0x2b75('0x5')][wanzikun_0x2b75('0x6')] + _0x42bb29[wanzikun_0x2b75('0x7')], '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5b6e24[wanzikun_0x2b75('0x5')]['\x74\x6f\x6b\x65\x6e'], '\x69\x64': _0x5bdb36, '\x69\x73\x44\x65\x66\x61\x75\x6c\x74': _0x42bb29[wanzikun_0x2b75('0x8')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3d1a14) {
        if (_0x42bb29[wanzikun_0x2b75('0x9')](_0x42bb29[wanzikun_0x2b75('0xa')], _0x42bb29['\x41\x77\x4e\x4b\x57'])) {
          wx[wanzikun_0x2b75('0xb')]({});
        } else {
          var _0x581054 = _0x3ee62a[wanzikun_0x2b75('0x2')]['\x64\x61\x74\x61\x73\x65\x74']['\x69\x64'];wx[wanzikun_0x2b75('0x4')]({ '\x75\x72\x6c': wanzikun_0x5b6e24[wanzikun_0x2b75('0x5')]['\x75\x72\x6c\x73'] + _0x42bb29[wanzikun_0x2b75('0x7')], '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5b6e24[wanzikun_0x2b75('0x5')]['\x74\x6f\x6b\x65\x6e'], '\x69\x64': _0x581054, '\x69\x73\x44\x65\x66\x61\x75\x6c\x74': _0x42bb29[wanzikun_0x2b75('0x8')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x59732d) {
              wx[wanzikun_0x2b75('0xb')]({});
            } });
        }
      } });
  }, '\x61\x64\x64\x41\x64\x64\x65\x73\x73': function addAddess() {
    var _0x467daa = { '\x57\x67\x52\x52\x70': wanzikun_0x2b75('0xc') };wx[wanzikun_0x2b75('0xd')]({ '\x75\x72\x6c': _0x467daa[wanzikun_0x2b75('0xe')] });
  }, '\x65\x64\x69\x74\x41\x64\x64\x65\x73\x73': function editAddess(_0x33b851) {
    var _0x229766 = { '\x68\x70\x47\x63\x51': function hpGcQ(_0x2eda3b, _0x1cb31c) {
        return _0x2eda3b + _0x1cb31c;
      }, '\x6b\x52\x6f\x79\x69': wanzikun_0x2b75('0xf') };wx[wanzikun_0x2b75('0xd')]({ '\x75\x72\x6c': _0x229766['\x68\x70\x47\x63\x51'](_0x229766[wanzikun_0x2b75('0x10')], _0x33b851[wanzikun_0x2b75('0x2')][wanzikun_0x2b75('0x3')]['\x69\x64']) });
  }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad() {}, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    this[wanzikun_0x2b75('0x11')]();
  }, '\x69\x6e\x69\x74\x53\x68\x69\x70\x70\x69\x6e\x67\x41\x64\x64\x72\x65\x73\x73': function initShippingAddress() {
    var _0x3b01be = { '\x6a\x6e\x4c\x6e\x57': function jnLnW(_0x4ee2d8, _0x192e63) {
        return _0x4ee2d8 === _0x192e63;
      }, '\x62\x70\x43\x70\x59': wanzikun_0x2b75('0x12') };var _0x5c352d = this;wx[wanzikun_0x2b75('0x4')]({ '\x75\x72\x6c': wanzikun_0x5b6e24[wanzikun_0x2b75('0x5')][wanzikun_0x2b75('0x6')] + _0x3b01be['\x62\x70\x43\x70\x59'], '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x5b6e24[wanzikun_0x2b75('0x5')]['\x74\x6f\x6b\x65\x6e'] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x3aecef) {
        if (_0x3aecef['\x64\x61\x74\x61'][wanzikun_0x2b75('0x13')] == 0x0) {
          if (_0x3b01be[wanzikun_0x2b75('0x14')](wanzikun_0x2b75('0x15'), wanzikun_0x2b75('0x15'))) {
            _0x5c352d[wanzikun_0x2b75('0x16')]({ '\x61\x64\x64\x72\x65\x73\x73\x4c\x69\x73\x74': _0x3aecef[wanzikun_0x2b75('0x17')][wanzikun_0x2b75('0x17')] });
          } else {
            _0x5c352d[wanzikun_0x2b75('0x16')]({ '\x61\x64\x64\x72\x65\x73\x73\x4c\x69\x73\x74': null });
          }
        } else if (_0x3aecef[wanzikun_0x2b75('0x17')][wanzikun_0x2b75('0x13')] == 0x2bc) {
          _0x5c352d[wanzikun_0x2b75('0x16')]({ '\x61\x64\x64\x72\x65\x73\x73\x4c\x69\x73\x74': null });
        }
      } });
  } }); 
 			}); 	require("pages/select-address/index.js");
 		__wxRoute = 'pages/mycoupons/index';__wxRouteBegin = true; 	define("pages/mycoupons/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x403d = ['\x73\x55\x47\x76\x49', '\x64\x61\x74\x61', '\x63\x6f\x64\x65', '\x49\x49\x5a\x4a\x4d', '\x73\x65\x74\x44\x61\x74\x61', '\x62\x66\x75\x51\x6a', '\x6c\x65\x6e\x67\x74\x68', '\x52\x4f\x49\x68\x63', '\x78\x76\x5a\x4e\x58', '\x73\x77\x69\x74\x63\x68\x54\x61\x62', '\x66\x44\x75\x51\x71', '\x67\x65\x74\x4d\x79\x43\x6f\x75\x70\x6f\x6e\x73', '\x77\x43\x54\x50\x4d', '\x59\x6e\x79\x6a\x4c', '\x72\x65\x71\x75\x65\x73\x74', '\x4a\x65\x6b\x59\x61', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x75\x72\x6c\x73', '\x74\x6f\x6b\x65\x6e'];(function (_0x16a0df, _0x1b20e3) {
  var _0x40e633 = function _0x40e633(_0x3e8221) {
    while (--_0x3e8221) {
      _0x16a0df['push'](_0x16a0df['shift']());
    }
  };_0x40e633(++_0x1b20e3);
})(wanzikun_0x403d, 0x161);var wanzikun_0x1af6 = function wanzikun_0x1af6(_0x55f950, _0x3109ee) {
  _0x55f950 = _0x55f950 - 0x0;var _0x2bd0fb = wanzikun_0x403d[_0x55f950];return _0x2bd0fb;
};var wanzikun_0x1a7804 = getApp();Page({ '\x64\x61\x74\x61': { '\x63\x6f\x75\x70\x6f\x6e\x73': [] }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad() {}, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    this[wanzikun_0x1af6('0x0')]();
  }, '\x67\x65\x74\x4d\x79\x43\x6f\x75\x70\x6f\x6e\x73': function getMyCoupons() {
    var _0x5c6c2c = { '\x73\x55\x47\x76\x49': function sUGvI(_0x3c1d43, _0x33f9a0) {
        return _0x3c1d43 == _0x33f9a0;
      }, '\x49\x49\x5a\x4a\x4d': wanzikun_0x1af6('0x1'), '\x62\x66\x75\x51\x6a': function bfuQj(_0x19140e, _0x20bb67) {
        return _0x19140e > _0x20bb67;
      }, '\x52\x4f\x49\x68\x63': function ROIhc(_0x1a5f5d, _0x3b59e7) {
        return _0x1a5f5d !== _0x3b59e7;
      }, '\x78\x76\x5a\x4e\x58': wanzikun_0x1af6('0x2'), '\x4a\x65\x6b\x59\x61': function JekYa(_0x5bd6cb, _0x3d1726) {
        return _0x5bd6cb + _0x3d1726;
      }, '\x66\x66\x79\x78\x6f': '\x2f\x64\x69\x73\x63\x6f\x75\x6e\x74\x73\x2f\x6d\x79' };var _0x545cf7 = this;wx[wanzikun_0x1af6('0x3')]({ '\x75\x72\x6c': _0x5c6c2c[wanzikun_0x1af6('0x4')](wanzikun_0x1a7804[wanzikun_0x1af6('0x5')][wanzikun_0x1af6('0x6')], _0x5c6c2c['\x66\x66\x79\x78\x6f']), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x1a7804['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x1af6('0x7')], '\x73\x74\x61\x74\x75\x73': 0x0 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x6d3744) {
        if (_0x5c6c2c[wanzikun_0x1af6('0x8')](_0x6d3744[wanzikun_0x1af6('0x9')][wanzikun_0x1af6('0xa')], 0x0)) {
          if (_0x5c6c2c[wanzikun_0x1af6('0xb')] !== '\x77\x43\x54\x50\x4d') {
            _0x545cf7[wanzikun_0x1af6('0xc')]({ '\x63\x6f\x75\x70\x6f\x6e\x73': _0x2cecf2, '\x6c\x6f\x61\x64\x69\x6e\x67\x4d\x6f\x72\x65\x48\x69\x64\x64\x65\x6e': !![] });
          } else {
            var _0x2cecf2 = _0x6d3744['\x64\x61\x74\x61'][wanzikun_0x1af6('0x9')];if (_0x5c6c2c[wanzikun_0x1af6('0xd')](_0x2cecf2[wanzikun_0x1af6('0xe')], 0x0)) {
              if (_0x5c6c2c[wanzikun_0x1af6('0xf')](_0x5c6c2c[wanzikun_0x1af6('0x10')], _0x5c6c2c[wanzikun_0x1af6('0x10')])) {
                _0x545cf7[wanzikun_0x1af6('0xc')]({ '\x6c\x6f\x61\x64\x69\x6e\x67\x4d\x6f\x72\x65\x48\x69\x64\x64\x65\x6e': ![] });
              } else {
                _0x545cf7[wanzikun_0x1af6('0xc')]({ '\x63\x6f\x75\x70\x6f\x6e\x73': _0x2cecf2, '\x6c\x6f\x61\x64\x69\x6e\x67\x4d\x6f\x72\x65\x48\x69\x64\x64\x65\x6e': !![] });
              }
            }
          }
        } else {
          _0x545cf7[wanzikun_0x1af6('0xc')]({ '\x6c\x6f\x61\x64\x69\x6e\x67\x4d\x6f\x72\x65\x48\x69\x64\x64\x65\x6e': ![] });
        }
      } });
  }, '\x67\x6f\x68\x6f\x6d\x65': function gohome() {
    var _0x5712e8 = { '\x66\x44\x75\x51\x71': '\x2f\x70\x61\x67\x65\x73\x2f\x69\x6e\x64\x65\x78\x2f\x69\x6e\x64\x65\x78' };wx[wanzikun_0x1af6('0x11')]({ '\x75\x72\x6c': _0x5712e8[wanzikun_0x1af6('0x12')] });
  } }); 
 			}); 	require("pages/mycoupons/index.js");
 		__wxRoute = 'pages/fav-list/index';__wxRouteBegin = true; 	define("pages/fav-list/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x2f5a = ['\x75\x72\x6c\x73', '\x75\x71\x4e\x61\x76', '\x74\x6f\x6b\x65\x6e', '\x52\x51\x68\x47\x68', '\x53\x69\x44\x51\x4e', '\x59\x66\x76\x72\x7a', '\x64\x61\x74\x61', '\x63\x6f\x64\x65', '\x73\x65\x74\x44\x61\x74\x61', '\x47\x61\x62\x62\x62', '\x2f\x70\x61\x67\x65\x73\x2f\x67\x6f\x6f\x64\x73\x2d\x64\x65\x74\x61\x69\x6c\x73\x2f\x69\x6e\x64\x65\x78\x3f\x69\x64\x3d', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x4e\x70\x64\x62\x74', '\x71\x4d\x6a\x79\x4f', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x64\x61\x74\x61\x73\x65\x74', '\x62\x68\x74\x79\x75', '\x2f\x73\x68\x6f\x70\x2f\x67\x6f\x6f\x64\x73\x2f\x66\x61\x76\x2f\x6c\x69\x73\x74', '\x72\x65\x71\x75\x65\x73\x74', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'];(function (_0x3de40f, _0x3e6dbc) {
  var _0x22ac07 = function _0x22ac07(_0x258e06) {
    while (--_0x258e06) {
      _0x3de40f['push'](_0x3de40f['shift']());
    }
  };_0x22ac07(++_0x3e6dbc);
})(wanzikun_0x2f5a, 0xd2);var wanzikun_0xc580 = function wanzikun_0xc580(_0xbe123f, _0xfd207e) {
  _0xbe123f = _0xbe123f - 0x0;var _0x475ffa = wanzikun_0x2f5a[_0xbe123f];return _0x475ffa;
};var wanzikun_0x2b980c = getApp();Page({ '\x64\x61\x74\x61': {}, '\x74\x6f\x44\x65\x74\x61\x69\x6c\x73\x54\x61\x70': function toDetailsTap(_0xbb56f2) {
    var _0x946f26 = { '\x4e\x70\x64\x62\x74': function Npdbt(_0x440f18, _0x229924) {
        return _0x440f18 + _0x229924;
      }, '\x71\x4d\x6a\x79\x4f': wanzikun_0xc580('0x0') };wx[wanzikun_0xc580('0x1')]({ '\x75\x72\x6c': _0x946f26[wanzikun_0xc580('0x2')](_0x946f26[wanzikun_0xc580('0x3')], _0xbb56f2[wanzikun_0xc580('0x4')][wanzikun_0xc580('0x5')]['\x69\x64']) });
  }, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    var _0x5ab958 = { '\x7a\x63\x4d\x69\x75': function zcMiu(_0x151398, _0x22997b) {
        return _0x151398 == _0x22997b;
      }, '\x52\x51\x68\x47\x68': function RQhGh(_0x31294f, _0x32f4d4) {
        return _0x31294f !== _0x32f4d4;
      }, '\x53\x69\x44\x51\x4e': '\x52\x68\x5a\x46\x52', '\x59\x66\x76\x72\x7a': wanzikun_0xc580('0x6'), '\x5a\x58\x46\x45\x7a': function ZXFEz(_0x2e4afa, _0x4b04b7) {
        return _0x2e4afa == _0x4b04b7;
      }, '\x62\x41\x4e\x74\x54': function bANtT(_0x17d39e, _0x350c38) {
        return _0x17d39e + _0x350c38;
      }, '\x75\x71\x4e\x61\x76': wanzikun_0xc580('0x7') };var _0x3ee547 = this;wx[wanzikun_0xc580('0x8')]({ '\x75\x72\x6c': _0x5ab958['\x62\x41\x4e\x74\x54'](wanzikun_0x2b980c[wanzikun_0xc580('0x9')][wanzikun_0xc580('0xa')], _0x5ab958[wanzikun_0xc580('0xb')]), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x2b980c[wanzikun_0xc580('0x9')][wanzikun_0xc580('0xc')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x250e1c) {
        var _0x1a2f30 = { '\x47\x61\x62\x62\x62': function Gabbb(_0x589cd2, _0x168e6e) {
            return _0x5ab958['\x7a\x63\x4d\x69\x75'](_0x589cd2, _0x168e6e);
          } };if (_0x5ab958[wanzikun_0xc580('0xd')](_0x5ab958[wanzikun_0xc580('0xe')], _0x5ab958[wanzikun_0xc580('0xf')])) {
          if (_0x5ab958['\x5a\x58\x46\x45\x7a'](_0x250e1c[wanzikun_0xc580('0x10')][wanzikun_0xc580('0x11')], 0x0)) {
            _0x3ee547['\x73\x65\x74\x44\x61\x74\x61']({ '\x66\x61\x76\x4c\x69\x73\x74': _0x250e1c[wanzikun_0xc580('0x10')][wanzikun_0xc580('0x10')], '\x6c\x6f\x61\x64\x69\x6e\x67\x4d\x6f\x72\x65\x48\x69\x64\x64\x65\x6e': !![] });
          } else if (_0x250e1c[wanzikun_0xc580('0x10')][wanzikun_0xc580('0x11')] == 0x194) {
            _0x3ee547[wanzikun_0xc580('0x12')]({ '\x66\x61\x76\x4c\x69\x73\x74': null, '\x6c\x6f\x61\x64\x69\x6e\x67\x4d\x6f\x72\x65\x48\x69\x64\x64\x65\x6e': ![] });
          }
        } else {
          if (_0x1a2f30[wanzikun_0xc580('0x13')](_0x250e1c[wanzikun_0xc580('0x10')]['\x63\x6f\x64\x65'], 0x0)) {
            _0x3ee547[wanzikun_0xc580('0x12')]({ '\x66\x61\x76\x4c\x69\x73\x74': _0x250e1c[wanzikun_0xc580('0x10')][wanzikun_0xc580('0x10')], '\x6c\x6f\x61\x64\x69\x6e\x67\x4d\x6f\x72\x65\x48\x69\x64\x64\x65\x6e': !![] });
          } else if (_0x250e1c[wanzikun_0xc580('0x10')][wanzikun_0xc580('0x11')] == 0x194) {
            _0x3ee547[wanzikun_0xc580('0x12')]({ '\x66\x61\x76\x4c\x69\x73\x74': null, '\x6c\x6f\x61\x64\x69\x6e\x67\x4d\x6f\x72\x65\x48\x69\x64\x64\x65\x6e': ![] });
          }
        }
      } });
  } }); 
 			}); 	require("pages/fav-list/index.js");
 		__wxRoute = 'pages/order-details/index';__wxRouteBegin = true; 	define("pages/order-details/index.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x1ee7 = ['\x6b\x65\x79\x77\x6f\x72\x64\x31', '\x6f\x72\x64\x65\x72\x44\x65\x74\x61\x69\x6c', '\x4b\x7a\x42\x68\x4c', '\x7a\x4c\x48\x61\x67', '\x6f\x72\x64\x65\x72\x5f\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e\x5f\x73\x63\x6f\x72\x65', '\x61\x79\x67\x4e\x71', '\x63\x44\x66\x58\x62', '\x73\x65\x6e\x64\x54\x65\x6d\x70\x6c\x65\x4d\x73\x67\x49\x6d\x6d\x65\x64\x69\x61\x74\x65\x6c\x79', '\x73\x69\x74\x65\x49\x6e\x66\x6f', '\x61\x73\x73\x65\x73\x73\x6f\x72\x64\x65\x72\x6b\x65\x79', '\x2f\x70\x61\x67\x65\x73\x2f\x6f\x72\x64\x65\x72\x2d\x64\x65\x74\x61\x69\x6c\x73\x2f\x69\x6e\x64\x65\x78\x3f\x69\x64\x3d', '\x73\x74\x72\x69\x6e\x67\x69\x66\x79', '\u611F\u8C22\u60A8\u7684\u8BC4\u4EF7\uFF0C\u671F\u5F85\u60A8\u7684\u518D\u6B21\u5149\u4E34\uFF01', '\u79EF\u5206\u5956\u52B1\u5DF2\u53D1\u653E\u81F3\u60A8\u7684\u8D26\u6237\u3002', '\x6a\x42\x4c\x43\x47', '\x67\x6f\x6f\x64\x52\x65\x70\x75\x74\x61\x74\x69\x6f\x6e', '\x67\x6f\x6f\x64\x52\x65\x70\x75\x74\x61\x74\x69\x6f\x6e\x52\x65\x6d\x61\x72\x6b', '\x76\x61\x6c\x75\x65', '\x4a\x68\x6f\x64\x66', '\x57\x62\x79\x78\x62', '\x6f\x73\x6c\x4c\x73', '\x56\x6d\x6a\x53\x4b', '\x7a\x57\x66\x68\x77', '\x68\x41\x69\x79\x4b', '\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e', '\x72\x65\x6d\x61\x72\x6b', '\x70\x75\x73\x68', '\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e\x73', '\x55\x49\x6d\x64\x41', '\x6f\x72\x64\x65\x72\x49\x6e\x66\x6f', '\x6f\x72\x64\x65\x72\x4e\x75\x6d\x62\x65\x72', '\x73\x78\x73\x54\x45', '\x58\x69\x65\x65\x69', '\x48\x6f\x78\x61\x48', '\x55\x71\x4a\x52\x56', '\x73\x75\x63\x63\x65\x73\x73\x6f\x72\x64\x65\x72\x6b\x65\x79', '\x4d\x56\x69\x69\x51', '\x6b\x65\x79\x77\x6f\x72\x64\x32', '\x55\x4f\x74\x65\x72', '\x44\x50\x4f\x4f\x50', '\x30\x2e\x30\x30', '\x64\x61\x74\x61', '\x6f\x72\x64\x65\x72\x49\x64', '\x73\x65\x74\x44\x61\x74\x61', '\x34\x7c\x37\x7c\x33\x7c\x36\x7c\x32\x7c\x31\x7c\x35\x7c\x30', '\x2f\x6f\x72\x64\x65\x72\x2f\x64\x65\x74\x61\x69\x6c', '\x69\x4e\x41\x76\x4a', '\x73\x70\x6c\x69\x74', '\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74', '\x72\x65\x71\x75\x65\x73\x74', '\x41\x65\x66\x47\x52', '\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61', '\x74\x6f\x6b\x65\x6e', '\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67', '\x54\x54\x79\x46\x4d', '\x63\x6f\x64\x65', '\x73\x68\x6f\x77\x4d\x6f\x64\x61\x6c', '\x53\x6f\x48\x65\x44', '\x6c\x65\x6e\x67\x74\x68', '\x4c\x42\x59\x57\x55', '\x44\x4c\x6c\x5a\x45', '\x70\x72\x69\x63\x65', '\x6e\x75\x6d\x62\x65\x72', '\x79\x75\x6e\x50\x72\x69\x63\x65', '\x63\x75\x72\x72\x65\x6e\x74\x54\x61\x72\x67\x65\x74', '\x6e\x61\x76\x69\x67\x61\x74\x65\x54\x6f', '\x2f\x70\x61\x67\x65\x73\x2f\x77\x75\x6c\x69\x75\x2f\x69\x6e\x64\x65\x78\x3f\x69\x64\x3d', '\x72\x76\x4a\x57\x48', '\x23\x31\x37\x33\x31\x37\x37', '\u7ACB\u5373\u597D\u8BC4\uFF0C\u7CFB\u7EDF\u8D60\u9001\u60A8', '\u79EF\u5206\u5956\u52B1\u3002', '\x52\x4d\x6b\x6e\x6a', '\x2f\x6f\x72\x64\x65\x72\x2f\x64\x65\x6c\x69\x76\x65\x72\x79', '\u786E\u8BA4\u60A8\u5DF2\u6536\u5230\u5546\u54C1\uFF1F', '\x64\x65\x74\x61\x69\x6c', '\x66\x6f\x72\x6d\x49\x64', '\x70\x4c\x51\x61\x64', '\x63\x56\x70\x42\x78', '\x6c\x76\x52\x54\x6b', '\x6a\x57\x49\x4c\x62', '\x6b\x69\x52\x6b\x4d', '\x57\x72\x47\x75\x69', '\x63\x6f\x6e\x66\x69\x72\x6d', '\x48\x48\x52\x74\x46', '\x72\x53\x7a\x65\x65', '\x4d\x66\x52\x4e\x4e', '\x6b\x68\x6c\x48\x50', '\x73\x68\x6f\x77\x4c\x6f\x61\x64\x69\x6e\x67', '\x46\x6e\x6f\x75\x6e', '\x75\x72\x6c\x73', '\x6f\x6b\x6b\x78\x57', '\x4a\x52\x62\x57\x6f', '\x4d\x6b\x46\x4d\x70', '\x6f\x6e\x53\x68\x6f\x77'];(function (_0x4b95f7, _0x5a7458) {
  var _0x2f85ce = function _0x2f85ce(_0x7d1e28) {
    while (--_0x7d1e28) {
      _0x4b95f7['push'](_0x4b95f7['shift']());
    }
  };_0x2f85ce(++_0x5a7458);
})(wanzikun_0x1ee7, 0x1a0);var wanzikun_0x54b0 = function wanzikun_0x54b0(_0x1ffa87, _0x339864) {
  _0x1ffa87 = _0x1ffa87 - 0x0;var _0x23be09 = wanzikun_0x1ee7[_0x1ffa87];return _0x23be09;
};var wanzikun_0x3e2171 = getApp();Page({ '\x64\x61\x74\x61': { '\x6f\x72\x64\x65\x72\x49\x64': 0x0, '\x67\x6f\x6f\x64\x73\x4c\x69\x73\x74': [], '\x79\x75\x6e\x50\x72\x69\x63\x65': wanzikun_0x54b0('0x0') }, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad(_0x354856) {
    var _0x54a7b0 = _0x354856['\x69\x64'];this[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x2')] = _0x54a7b0;this[wanzikun_0x54b0('0x3')]({ '\x6f\x72\x64\x65\x72\x49\x64': _0x54a7b0 });
  }, '\x6f\x6e\x53\x68\x6f\x77': function onShow() {
    var _0x1d0854 = { '\x69\x4e\x41\x76\x4a': wanzikun_0x54b0('0x4'), '\x41\x65\x66\x47\x52': function AefGR(_0x1e254e, _0xb5766e) {
        return _0x1e254e + _0xb5766e;
      }, '\x70\x4c\x5a\x4e\x67': wanzikun_0x54b0('0x5'), '\x53\x6f\x48\x65\x44': function SoHeD(_0x3d6519, _0x33398f) {
        return _0x3d6519 < _0x33398f;
      }, '\x4c\x42\x59\x57\x55': function LBYWU(_0x4ebe8c, _0x3a195e) {
        return _0x4ebe8c * _0x3a195e;
      }, '\x44\x4c\x6c\x5a\x45': function DLlZE(_0x4d6104, _0xf87b8b) {
        return _0x4d6104(_0xf87b8b);
      } };var _0x1653a2 = _0x1d0854[wanzikun_0x54b0('0x6')][wanzikun_0x54b0('0x7')]('\x7c'),
        _0x15fca3 = 0x0;while (!![]) {
      switch (_0x1653a2[_0x15fca3++]) {case '\x30':
          this[wanzikun_0x54b0('0x3')]({ '\x61\x6c\x6c\x47\x6f\x6f\x64\x73\x50\x72\x69\x63\x65': _0x70b831, '\x79\x75\x6e\x50\x72\x69\x63\x65': _0x2bf259 });continue;case '\x31':
          var _0x240ea4 = this[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x8')];continue;case '\x32':
          var _0x70b831 = 0x0;continue;case '\x33':
          wx[wanzikun_0x54b0('0x9')]({ '\x75\x72\x6c': _0x1d0854[wanzikun_0x54b0('0xa')](wanzikun_0x3e2171[wanzikun_0x54b0('0xb')]['\x75\x72\x6c\x73'], _0x1d0854['\x70\x4c\x5a\x4e\x67']), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x3e2171[wanzikun_0x54b0('0xb')][wanzikun_0x54b0('0xc')], '\x69\x64': _0x148329[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x2')] }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x2d22bb) {
              wx[wanzikun_0x54b0('0xd')]();if (_0xf85e8b[wanzikun_0x54b0('0xe')](_0x2d22bb[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0xf')], 0x0)) {
                wx[wanzikun_0x54b0('0x10')]({ '\x74\x69\x74\x6c\x65': '\u9519\u8BEF', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x2d22bb[wanzikun_0x54b0('0x1')]['\x6d\x73\x67'], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
              }_0x148329[wanzikun_0x54b0('0x3')]({ '\x6f\x72\x64\x65\x72\x44\x65\x74\x61\x69\x6c': _0x2d22bb[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x1')] });
            } });continue;case '\x34':
          var _0xf85e8b = { '\x54\x54\x79\x46\x4d': function TTyFM(_0x19da02, _0x1c1128) {
              return _0x19da02 != _0x1c1128;
            } };continue;case '\x35':
          for (var _0x492459 = 0x0; _0x1d0854[wanzikun_0x54b0('0x11')](_0x492459, _0x240ea4[wanzikun_0x54b0('0x12')]); _0x492459++) {
            _0x70b831 += _0x1d0854[wanzikun_0x54b0('0x13')](_0x1d0854[wanzikun_0x54b0('0x14')](parseFloat, _0x240ea4[0x0][wanzikun_0x54b0('0x15')]), _0x240ea4[0x0][wanzikun_0x54b0('0x16')]);
          }continue;case '\x36':
          var _0x2bf259 = _0x1d0854[wanzikun_0x54b0('0x14')](parseFloat, this['\x64\x61\x74\x61'][wanzikun_0x54b0('0x17')]);continue;case '\x37':
          var _0x148329 = this;continue;}break;
    }
  }, '\x77\x75\x6c\x69\x75\x44\x65\x74\x61\x69\x6c\x73\x54\x61\x70': function wuliuDetailsTap(_0x1a62dc) {
    var _0x19655b = { '\x6f\x66\x4f\x56\x62': function ofOVb(_0x503ab5, _0x1cf950) {
        return _0x503ab5 + _0x1cf950;
      } };var _0x17327f = _0x1a62dc[wanzikun_0x54b0('0x18')]['\x64\x61\x74\x61\x73\x65\x74']['\x69\x64'];wx[wanzikun_0x54b0('0x19')]({ '\x75\x72\x6c': _0x19655b['\x6f\x66\x4f\x56\x62'](wanzikun_0x54b0('0x1a'), _0x17327f) });
  }, '\x63\x6f\x6e\x66\x69\x72\x6d\x42\x74\x6e\x54\x61\x70': function confirmBtnTap(_0x24d7dc) {
    var _0x45779d = { '\x6b\x68\x6c\x48\x50': function khlHP(_0x5eb057, _0x25f5eb) {
        return _0x5eb057 != _0x25f5eb;
      }, '\x63\x56\x70\x42\x78': wanzikun_0x54b0('0x1b'), '\x6c\x76\x52\x54\x6b': function lvRTk(_0x105a54, _0xc5fec0) {
        return _0x105a54 == _0xc5fec0;
      }, '\x6a\x57\x49\x4c\x62': wanzikun_0x54b0('0x1c'), '\x49\x44\x45\x4c\x61': '\u60A8\u5DF2\u786E\u8BA4\u6536\u8D27\uFF0C\u671F\u5F85\u60A8\u7684\u518D\u6B21\u5149\u4E34\uFF01', '\x41\x6f\x72\x49\x51': function AorIQ(_0x5aca90, _0x5cf5e3) {
        return _0x5aca90 + _0x5cf5e3;
      }, '\x6b\x69\x52\x6b\x4d': wanzikun_0x54b0('0x1d'), '\x57\x72\x47\x75\x69': wanzikun_0x54b0('0x1e'), '\x48\x48\x52\x74\x46': function HHRtF(_0x4cef52, _0x283004) {
        return _0x4cef52 === _0x283004;
      }, '\x72\x53\x7a\x65\x65': wanzikun_0x54b0('0x1f'), '\x4d\x66\x52\x4e\x4e': '\x57\x57\x52\x57\x62', '\x46\x6e\x6f\x75\x6e': function Fnoun(_0x4676c2, _0x4091cc) {
        return _0x4676c2 + _0x4091cc;
      }, '\x6f\x6b\x6b\x78\x57': wanzikun_0x54b0('0x20'), '\x70\x4c\x51\x61\x64': wanzikun_0x54b0('0x21') };var _0x22d5e4 = this;var _0x2abd43 = this[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x2')];var _0x391958 = _0x24d7dc[wanzikun_0x54b0('0x22')][wanzikun_0x54b0('0x23')];wx[wanzikun_0x54b0('0x10')]({ '\x74\x69\x74\x6c\x65': _0x45779d[wanzikun_0x54b0('0x24')], '\x63\x6f\x6e\x74\x65\x6e\x74': '', '\x73\x75\x63\x63\x65\x73\x73': function success(_0x1e8631) {
        var _this = this;

        var _0x237ecb = { '\x4a\x52\x62\x57\x6f': function JRbWo(_0x1fe05f, _0x59ab0f) {
            return _0x1fe05f !== _0x59ab0f;
          }, '\x4d\x6b\x46\x4d\x70': _0x45779d[wanzikun_0x54b0('0x25')], '\x6a\x51\x6d\x57\x48': function jQmWH(_0x160d59, _0x3e23cc) {
            return _0x45779d[wanzikun_0x54b0('0x26')](_0x160d59, _0x3e23cc);
          }, '\x4b\x7a\x42\x68\x4c': _0x45779d[wanzikun_0x54b0('0x27')], '\x7a\x4c\x48\x61\x67': _0x45779d['\x49\x44\x45\x4c\x61'], '\x61\x79\x67\x4e\x71': function aygNq(_0x13ee28, _0x4088c0) {
            return _0x45779d['\x41\x6f\x72\x49\x51'](_0x13ee28, _0x4088c0);
          }, '\x59\x56\x76\x48\x6b': _0x45779d[wanzikun_0x54b0('0x28')], '\x63\x44\x66\x58\x62': _0x45779d[wanzikun_0x54b0('0x29')] };if (_0x1e8631[wanzikun_0x54b0('0x2a')]) {
          if (_0x45779d[wanzikun_0x54b0('0x2b')](_0x45779d[wanzikun_0x54b0('0x2c')], _0x45779d[wanzikun_0x54b0('0x2d')])) {
            wx['\x68\x69\x64\x65\x4c\x6f\x61\x64\x69\x6e\x67']();if (_0x45779d[wanzikun_0x54b0('0x2e')](_0x1e8631['\x64\x61\x74\x61'][wanzikun_0x54b0('0xf')], 0x0)) {
              wx[wanzikun_0x54b0('0x10')]({ '\x74\x69\x74\x6c\x65': '\u9519\u8BEF', '\x63\x6f\x6e\x74\x65\x6e\x74': _0x1e8631[wanzikun_0x54b0('0x1')]['\x6d\x73\x67'], '\x73\x68\x6f\x77\x43\x61\x6e\x63\x65\x6c': ![] });return;
            }_0x22d5e4[wanzikun_0x54b0('0x3')]({ '\x6f\x72\x64\x65\x72\x44\x65\x74\x61\x69\x6c': _0x1e8631[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x1')] });
          } else {
            wx[wanzikun_0x54b0('0x2f')]();wx[wanzikun_0x54b0('0x9')]({ '\x75\x72\x6c': _0x45779d[wanzikun_0x54b0('0x30')](wanzikun_0x3e2171['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x54b0('0x31')], _0x45779d[wanzikun_0x54b0('0x32')]), '\x64\x61\x74\x61': { '\x74\x6f\x6b\x65\x6e': wanzikun_0x3e2171[wanzikun_0x54b0('0xb')][wanzikun_0x54b0('0xc')], '\x6f\x72\x64\x65\x72\x49\x64': _0x2abd43 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0x1e8631) {
                if (_0x237ecb[wanzikun_0x54b0('0x33')](wanzikun_0x54b0('0x1b'), _0x237ecb[wanzikun_0x54b0('0x34')])) {
                  var _0x18aafc = _0x24d7dc['\x69\x64'];_this[wanzikun_0x54b0('0x1')]['\x6f\x72\x64\x65\x72\x49\x64'] = _0x18aafc;_this['\x73\x65\x74\x44\x61\x74\x61']({ '\x6f\x72\x64\x65\x72\x49\x64': _0x18aafc });
                } else {
                  if (_0x237ecb['\x6a\x51\x6d\x57\x48'](_0x1e8631['\x64\x61\x74\x61'][wanzikun_0x54b0('0xf')], 0x0)) {
                    _0x22d5e4[wanzikun_0x54b0('0x35')]();var _0x8e9dfa = {};_0x8e9dfa[wanzikun_0x54b0('0x36')] = { '\x76\x61\x6c\x75\x65': _0x22d5e4[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x37')]['\x6f\x72\x64\x65\x72\x49\x6e\x66\x6f']['\x6f\x72\x64\x65\x72\x4e\x75\x6d\x62\x65\x72'], '\x63\x6f\x6c\x6f\x72': _0x237ecb[wanzikun_0x54b0('0x38')] };var _0x180b4d = _0x237ecb[wanzikun_0x54b0('0x39')];if (wanzikun_0x3e2171[wanzikun_0x54b0('0xb')][wanzikun_0x54b0('0x3a')]) {
                      _0x180b4d += _0x237ecb[wanzikun_0x54b0('0x3b')](_0x237ecb[wanzikun_0x54b0('0x3b')](_0x237ecb['\x59\x56\x76\x48\x6b'], wanzikun_0x3e2171[wanzikun_0x54b0('0xb')][wanzikun_0x54b0('0x3a')]), _0x237ecb[wanzikun_0x54b0('0x3c')]);
                    }_0x8e9dfa['\x6b\x65\x79\x77\x6f\x72\x64\x32'] = { '\x76\x61\x6c\x75\x65': _0x180b4d, '\x63\x6f\x6c\x6f\x72': _0x237ecb[wanzikun_0x54b0('0x38')] };wanzikun_0x3e2171[wanzikun_0x54b0('0x3d')](wanzikun_0x3e2171[wanzikun_0x54b0('0x3e')][wanzikun_0x54b0('0x3f')], _0x391958, _0x237ecb[wanzikun_0x54b0('0x3b')](wanzikun_0x54b0('0x40'), _0x2abd43), JSON[wanzikun_0x54b0('0x41')](_0x8e9dfa));
                  }
                }
              } });
          }
        }
      } });
  }, '\x73\x75\x62\x6d\x69\x74\x52\x65\x70\x75\x74\x61\x74\x69\x6f\x6e': function submitReputation(_0x310f0a) {
    var _0x48fb69 = { '\x58\x69\x65\x65\x69': wanzikun_0x54b0('0x1c'), '\x48\x6f\x78\x61\x48': wanzikun_0x54b0('0x42'), '\x65\x6b\x4f\x53\x79': function ekOSy(_0x4ba298, _0x4972b1) {
        return _0x4ba298 + _0x4972b1;
      }, '\x55\x71\x4a\x52\x56': wanzikun_0x54b0('0x43'), '\x4d\x56\x69\x69\x51': function MViiQ(_0x11d3c0, _0x48d571) {
        return _0x11d3c0 + _0x48d571;
      }, '\x6d\x46\x62\x41\x61': function mFbAa(_0x31b6b2, _0x3e232b) {
        return _0x31b6b2 == _0x3e232b;
      }, '\x73\x78\x73\x54\x45': wanzikun_0x54b0('0x44'), '\x55\x4f\x74\x65\x72': function UOter(_0x5da491, _0x3f01ba) {
        return _0x5da491 + _0x3f01ba;
      }, '\x44\x50\x4f\x4f\x50': wanzikun_0x54b0('0x40'), '\x4a\x68\x6f\x64\x66': function Jhodf(_0x4f910c, _0x39969c) {
        return _0x4f910c + _0x39969c;
      }, '\x6f\x73\x6c\x4c\x73': '\x6f\x72\x64\x65\x72\x47\x6f\x6f\x64\x73\x49\x64', '\x57\x62\x79\x78\x62': function Wbyxb(_0x130b2b, _0x43e6df) {
        return _0x130b2b + _0x43e6df;
      }, '\x56\x6d\x6a\x53\x4b': function VmjSK(_0x4b4c6b, _0x1b948e) {
        return _0x4b4c6b + _0x1b948e;
      }, '\x7a\x57\x66\x68\x77': wanzikun_0x54b0('0x45'), '\x48\x76\x4b\x6d\x75': function HvKmu(_0x4a73f3, _0x48ada2) {
        return _0x4a73f3 + _0x48ada2;
      }, '\x68\x41\x69\x79\x4b': wanzikun_0x54b0('0x46'), '\x50\x50\x58\x66\x7a': function PPXfz(_0x55030d, _0x45fdb2) {
        return _0x55030d + _0x45fdb2;
      }, '\x55\x49\x6d\x64\x41': '\x2f\x6f\x72\x64\x65\x72\x2f\x72\x65\x70\x75\x74\x61\x74\x69\x6f\x6e' };var _0x3e11e1 = this;var _0x37b36c = _0x310f0a[wanzikun_0x54b0('0x22')]['\x66\x6f\x72\x6d\x49\x64'];var _0x4bb0e6 = {};_0x4bb0e6['\x74\x6f\x6b\x65\x6e'] = wanzikun_0x3e2171['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x54b0('0xc')];_0x4bb0e6[wanzikun_0x54b0('0x2')] = this[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x2')];var _0x11c8e3 = [];var _0x370f49 = 0x0;while (_0x310f0a[wanzikun_0x54b0('0x22')][wanzikun_0x54b0('0x47')][_0x48fb69[wanzikun_0x54b0('0x48')](_0x48fb69['\x6f\x73\x6c\x4c\x73'], _0x370f49)]) {
      var _0x4a78d0 = _0x310f0a['\x64\x65\x74\x61\x69\x6c'][wanzikun_0x54b0('0x47')][_0x48fb69[wanzikun_0x54b0('0x49')](_0x48fb69[wanzikun_0x54b0('0x4a')], _0x370f49)];var _0x5c2d5b = _0x310f0a[wanzikun_0x54b0('0x22')][wanzikun_0x54b0('0x47')][_0x48fb69[wanzikun_0x54b0('0x4b')](_0x48fb69[wanzikun_0x54b0('0x4c')], _0x370f49)];var _0x44f688 = _0x310f0a[wanzikun_0x54b0('0x22')]['\x76\x61\x6c\x75\x65'][_0x48fb69['\x48\x76\x4b\x6d\x75'](_0x48fb69[wanzikun_0x54b0('0x4d')], _0x370f49)];var _0xb61a5b = {};_0xb61a5b['\x69\x64'] = _0x4a78d0;_0xb61a5b[wanzikun_0x54b0('0x4e')] = _0x5c2d5b;_0xb61a5b[wanzikun_0x54b0('0x4f')] = _0x44f688;_0x11c8e3[wanzikun_0x54b0('0x50')](_0xb61a5b);_0x370f49++;
    }_0x4bb0e6[wanzikun_0x54b0('0x51')] = _0x11c8e3;wx[wanzikun_0x54b0('0x2f')]();wx[wanzikun_0x54b0('0x9')]({ '\x75\x72\x6c': _0x48fb69['\x50\x50\x58\x66\x7a'](wanzikun_0x3e2171[wanzikun_0x54b0('0xb')][wanzikun_0x54b0('0x31')], _0x48fb69[wanzikun_0x54b0('0x52')]), '\x64\x61\x74\x61': { '\x70\x6f\x73\x74\x4a\x73\x6f\x6e\x53\x74\x72\x69\x6e\x67': _0x4bb0e6 }, '\x73\x75\x63\x63\x65\x73\x73': function success(_0xa7fe08) {
        wx[wanzikun_0x54b0('0xd')]();if (_0x48fb69['\x6d\x46\x62\x41\x61'](_0xa7fe08[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0xf')], 0x0)) {
          _0x3e11e1[wanzikun_0x54b0('0x35')]();var _0x4bb0e = {};_0x4bb0e['\x6b\x65\x79\x77\x6f\x72\x64\x31'] = { '\x76\x61\x6c\x75\x65': _0x3e11e1[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x37')][wanzikun_0x54b0('0x53')][wanzikun_0x54b0('0x54')], '\x63\x6f\x6c\x6f\x72': _0x48fb69['\x58\x69\x65\x65\x69'] };var _0x2ff4c5 = '\u611F\u8C22\u60A8\u7684\u8BC4\u4EF7\uFF0C\u671F\u5F85\u60A8\u7684\u518D\u6B21\u5149\u4E34\uFF01';if (wanzikun_0x3e2171['\x67\x6c\x6f\x62\x61\x6c\x44\x61\x74\x61'][wanzikun_0x54b0('0x3a')]) {
            if (_0x48fb69[wanzikun_0x54b0('0x55')] === wanzikun_0x54b0('0x44')) {
              _0x2ff4c5 += _0x48fb69['\x4d\x56\x69\x69\x51'](wanzikun_0x3e2171[wanzikun_0x54b0('0xb')][wanzikun_0x54b0('0x3a')], wanzikun_0x54b0('0x43'));
            } else {
              _0x3e11e1['\x6f\x6e\x53\x68\x6f\x77']();var _0x5d742e = {};_0x5d742e[wanzikun_0x54b0('0x36')] = { '\x76\x61\x6c\x75\x65': _0x3e11e1[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x37')][wanzikun_0x54b0('0x53')][wanzikun_0x54b0('0x54')], '\x63\x6f\x6c\x6f\x72': _0x48fb69[wanzikun_0x54b0('0x56')] };var _0x2c4aae = _0x48fb69[wanzikun_0x54b0('0x57')];if (wanzikun_0x3e2171[wanzikun_0x54b0('0xb')][wanzikun_0x54b0('0x3a')]) {
                _0x2c4aae += _0x48fb69['\x65\x6b\x4f\x53\x79'](wanzikun_0x3e2171[wanzikun_0x54b0('0xb')][wanzikun_0x54b0('0x3a')], _0x48fb69[wanzikun_0x54b0('0x58')]);
              }_0x5d742e['\x6b\x65\x79\x77\x6f\x72\x64\x32'] = { '\x76\x61\x6c\x75\x65': _0x2c4aae, '\x63\x6f\x6c\x6f\x72': _0x48fb69[wanzikun_0x54b0('0x56')] };wanzikun_0x3e2171[wanzikun_0x54b0('0x3d')](wanzikun_0x3e2171['\x73\x69\x74\x65\x49\x6e\x66\x6f'][wanzikun_0x54b0('0x59')], _0x37b36c, _0x48fb69[wanzikun_0x54b0('0x5a')](wanzikun_0x54b0('0x40'), _0x3e11e1[wanzikun_0x54b0('0x1')][wanzikun_0x54b0('0x2')]), JSON[wanzikun_0x54b0('0x41')](_0x5d742e));
            }
          }_0x4bb0e[wanzikun_0x54b0('0x5b')] = { '\x76\x61\x6c\x75\x65': _0x2ff4c5, '\x63\x6f\x6c\x6f\x72': wanzikun_0x54b0('0x1c') };wanzikun_0x3e2171[wanzikun_0x54b0('0x3d')](wanzikun_0x3e2171[wanzikun_0x54b0('0x3e')][wanzikun_0x54b0('0x59')], _0x37b36c, _0x48fb69[wanzikun_0x54b0('0x5c')](_0x48fb69[wanzikun_0x54b0('0x5d')], _0x3e11e1['\x64\x61\x74\x61'][wanzikun_0x54b0('0x2')]), JSON[wanzikun_0x54b0('0x41')](_0x4bb0e));
        }
      } });
  } }); 
 			}); 	require("pages/order-details/index.js");
 		__wxRoute = 'pages/template-cart/template-cart';__wxRouteBegin = true; 	define("pages/template-cart/template-cart.js", function(require, module, exports, window,document,frames,self,location,navigator,localStorage,history,Caches,screen,alert,confirm,prompt,XMLHttpRequest,WebSocket,Reporter,webkit,WeixinJSCore){ 			
'use strict';

var wanzikun_0x2b1c = ['\u52A0\u8F7D\u4E2D...', '\x73\x68\x6f\x77\x4c\x6f\x61\x64\x69\x6e\x67'];(function (_0x44e12e, _0x2aab7b) {
  var _0x4daa28 = function _0x4daa28(_0xf732e3) {
    while (--_0xf732e3) {
      _0x44e12e['push'](_0x44e12e['shift']());
    }
  };_0x4daa28(++_0x2aab7b);
})(wanzikun_0x2b1c, 0x102);var wanzikun_0x3b59 = function wanzikun_0x3b59(_0x563041, _0x2e4746) {
  _0x563041 = _0x563041 - 0x0;var _0x10b885 = wanzikun_0x2b1c[_0x563041];return _0x10b885;
};var wanzikun_0x5ca038 = getApp();Page({ '\x64\x61\x74\x61': {}, '\x6f\x6e\x4c\x6f\x61\x64': function onLoad() {
    var _0x330c2f = { '\x62\x43\x57\x53\x51': wanzikun_0x3b59('0x0') };wx[wanzikun_0x3b59('0x1')]({ '\x74\x69\x74\x6c\x65': _0x330c2f['\x62\x43\x57\x53\x51'], '\x6d\x61\x73\x6b': !![] });
  } }); 
 			}); 	require("pages/template-cart/template-cart.js");
 	